gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c

#include "../H698/Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../MS/MS.h"
#include "../DL698/RM_Record.h"
#include "../DL698/DL698_UART.h"

#include "../DL698/Contrl_Manage.h"

#include "../DL698/DL698_JSON.h"
//#include "../DL698/cJSON.h"
#include "../Calculate/ascii.h"
#include "../Calculate/Calculate.h"

#include "../STM32F4xx/STM32F4xx_WDG.h"
#include "../STM32F4xx/STM32F4xx_UART.h"

#pragma  diag_suppress 870     //·ÀÖ¹KEIL±¨¾¯¸æ
//½­ËÕÉÏ±¨È«ÍøÊµÊ±Êı¾İµÄOAD
__align(4) const u16 fcstab[256] = {
0x0000, 0x1189, 0x2312, 0x329b, 0x4624, 0x57ad, 0x6536, 0x74bf,
0x8c48, 0x9dc1, 0xaf5a, 0xbed3, 0xca6c, 0xdbe5, 0xe97e, 0xf8f7,
0x1081, 0x0108, 0x3393, 0x221a, 0x56a5, 0x472c, 0x75b7, 0x643e,
0x9cc9, 0x8d40, 0xbfdb, 0xae52, 0xdaed, 0xcb64, 0xf9ff, 0xe876,
0x2102, 0x308b, 0x0210, 0x1399, 0x6726, 0x76af, 0x4434, 0x55bd,
0xad4a, 0xbcc3, 0x8e58, 0x9fd1, 0xeb6e, 0xfae7, 0xc87c, 0xd9f5,
0x3183, 0x200a, 0x1291, 0x0318, 0x77a7, 0x662e, 0x54b5, 0x453c,
0xbdcb, 0xac42, 0x9ed9, 0x8f50, 0xfbef, 0xea66, 0xd8fd, 0xc974,
0x4204, 0x538d, 0x6116, 0x709f, 0x0420, 0x15a9, 0x2732, 0x36bb,
0xce4c, 0xdfc5, 0xed5e, 0xfcd7, 0x8868, 0x99e1, 0xab7a, 0xbaf3,
0x5285, 0x430c, 0x7197, 0x601e, 0x14a1, 0x0528, 0x37b3, 0x263a,
0xdecd, 0xcf44, 0xfddf, 0xec56, 0x98e9, 0x8960, 0xbbfb, 0xaa72,
0x6306, 0x728f, 0x4014, 0x519d, 0x2522, 0x34ab, 0x0630, 0x17b9,
0xef4e, 0xfec7, 0xcc5c, 0xddd5, 0xa96a, 0xb8e3, 0x8a78, 0x9bf1,
0x7387, 0x620e, 0x5095, 0x411c, 0x35a3, 0x242a, 0x16b1, 0x0738,
0xffcf, 0xee46, 0xdcdd, 0xcd54, 0xb9eb, 0xa862, 0x9af9, 0x8b70,
0x8408, 0x9581, 0xa71a, 0xb693, 0xc22c, 0xd3a5, 0xe13e, 0xf0b7,
0x0840, 0x19c9, 0x2b52, 0x3adb, 0x4e64, 0x5fed, 0x6d76, 0x7cff,
0x9489, 0x8500, 0xb79b, 0xa612, 0xd2ad, 0xc324, 0xf1bf, 0xe036,
0x18c1, 0x0948, 0x3bd3, 0x2a5a, 0x5ee5, 0x4f6c, 0x7df7, 0x6c7e,
0xa50a, 0xb483, 0x8618, 0x9791, 0xe32e, 0xf2a7, 0xc03c, 0xd1b5,
0x2942, 0x38cb, 0x0a50, 0x1bd9, 0x6f66, 0x7eef, 0x4c74, 0x5dfd,
0xb58b, 0xa402, 0x9699, 0x8710, 0xf3af, 0xe226, 0xd0bd, 0xc134,
0x39c3, 0x284a, 0x1ad1, 0x0b58, 0x7fe7, 0x6e6e, 0x5cf5, 0x4d7c,
0xc60c, 0xd785, 0xe51e, 0xf497, 0x8028, 0x91a1, 0xa33a, 0xb2b3,
0x4a44, 0x5bcd, 0x6956, 0x78df, 0x0c60, 0x1de9, 0x2f72, 0x3efb,
0xd68d, 0xc704, 0xf59f, 0xe416, 0x90a9, 0x8120, 0xb3bb, 0xa232,
0x5ac5, 0x4b4c, 0x79d7, 0x685e, 0x1ce1, 0x0d68, 0x3ff3, 0x2e7a,
0xe70e, 0xf687, 0xc41c, 0xd595, 0xa12a, 0xb0a3, 0x8238, 0x93b1,
0x6b46, 0x7acf, 0x4854, 0x59dd, 0x2d62, 0x3ceb, 0x0e70, 0x1ff9,
0xf78f, 0xe606, 0xd49d, 0xc514, 0xb1ab, 0xa022, 0x92b9, 0x8330,
0x7bc7, 0x6a4e, 0x58d5, 0x495c, 0x3de3, 0x2c6a, 0x1ef1, 0x0f78
};

const u32 RealDataOAD_JSON[]=//ÊµÊ±JSONÎÄ¼ş´ò°üµÄÊı¾İÏî
{
	0x40020200,	//²É¼¯´æ´¢Ê±±ê
	0x20000201,	//AÏàµçÑ¹
	0x20000202,	//BÏàµçÑ¹
	0x20000203,	//CÏàµçÑ¹

	0x20010201,	//AÏàµçÁ÷
	0x20010202,	//BÏàµçÁ÷
	0x20010203,	//CÏàµçÁ÷

	0x20010400,	//ÁãÏßµçÁ÷
	0x20010500,	//Ê£ÓàµçÁ÷

	0x20040201,	//×ÜÓĞ¹¦¹¦ÂÊ
	0x20040202,	//AÏàÓĞ¹¦¹¦ÂÊ
	0x20040203,	//BÏàÓĞ¹¦¹¦ÂÊ
	0x20040204,	//CÏàÓĞ¹¦¹¦ÂÊ
	
	0x43140506,	//(ÊÒÍâÎÂ¶È)
	0x43140505,	//(ÊÒÄÚÎÂ¶È)
	0x43140501,	//(¿Õµ÷ÉèÖÃÎÂ¶È)
	0x43140400,	//(¿Õµ÷¿ª¹Ø»ú×´Ì¬)
	0x43110502,	//(ÈÈË®Æ÷¼ÓÈÈÎÂ¶È)
	0x43110400,	//(ÈÈË®Æ÷¿ª¹Ø»ú×´Ì¬)

	0x00100201, //ÕıÓĞ×Ü
	0x00100203,	//ÕıÓĞ·æ
	0x00100205,	//ÕıÓĞ¹È

	0x00200201, //·´ÓĞ×Ü
	0x00200203,	//·´ÓĞ·æ
	0x00200205,	//·´ÓĞ¹È
};		
//½­ËÕÉÏ±¨È«ÍøÊµÊ±Êı¾İµÄOADÊıÁ¿
const u32 RealDataOAD_JSONSIZE=sizeof(RealDataOAD_JSON)/sizeof(u32);

typedef struct
{
	u16 OI;
	u16 POINTNUM;//Ğ¡ÊıµãÎ»Êı
}POINTNUM_type;

const POINTNUM_type OAD_PointNUM_list[]=//OAD¶ÔÓ¦Ğ¡ÊıµãÎ»Êı
{
	{0x2000,	1},//	µçÑ¹	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£ºV£¬»»Ëã£º-1
	{0x2001,	3},//	µçÁ÷	Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºA »»Ëã£º-3
	{0x2002,	1},//	µçÑ¹Ïà½Ç	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£º¶È£¬»»Ëã£º-1
	{0x2003,	1},//	µçÑ¹µçÁ÷Ïà½Ç	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£º¶È£¬»»Ëã£º-1
	{0x2004,	1},//	ÓĞ¹¦¹¦ÂÊ	Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºW£¬»»Ëã£º-1
	{0x2005,	1},//	ÎŞ¹¦¹¦ÂÊ	Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºvar£¬»»Ëã£º-1
	{0x2006,	1},//	ÊÓÔÚ¹¦ÂÊ	Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºVA£¬»»Ëã£º-1
	{0x2007,	1},//	Ò»·ÖÖÓÆ½¾ùÓĞ¹¦¹¦ÂÊ Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºW£¬»»Ëã£º-1
	{0x2008,	1},//	Ò»·ÖÖÓÆ½¾ùÎŞ¹¦¹¦ÂÊ Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºvar£¬»»Ëã£º-1
	{0x2009,	1},//	Ò»·ÖÖÓÆ½¾ùÊÓÔÚ¹¦ÂÊ Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºVA£¬»»Ëã£º-1
	{0x200A,	3},//	¹¦ÂÊÒòÊı	Êı¾İÀàĞÍ£ºlong£¬µ¥Î»£ºÎŞ£¬»»Ëã£º-3
	{0x200B,	2},//	µçÑ¹²¨ĞÎÊ§Õæ¶È	Êı¾İÀàĞÍ£ºlong£¬µ¥Î»£º%£¬»»Ëã£º-2
	{0x200C,	2},//	µçÁ÷²¨ĞÎÊ§Õæ¶È	Êı¾İÀàĞÍ£ºlong£¬µ¥Î»£º%£¬»»Ëã£º-2
	{0x200D,	2},//	µçÑ¹Ğ³²¨º¬ÓĞÁ¿£¨×Ü¼° 2?n ´Î£© Êı¾İÀàĞÍ£ºlong£¬µ¥Î»£º%£¬»»Ëã£º-2
	{0x200E,	2},//	µçÁ÷Ğ³²¨º¬ÓĞÁ¿£¨×Ü¼° 2?n ´Î£© Êı¾İÀàĞÍ£ºlong£¬µ¥Î»£º%£¬»»Ëã£º-2
	{0x200F,	2},//	µçÍøÆµÂÊ	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£ºHz£¬»»Ëã£º-2
	 
	
	//¶ÔÏó±êÊ¶ OI ½Ó¿ÚÀà IC	¶ÔÏóÃû³Æ	ÊµÀıµÄ¶ÔÏóÊôĞÔ¼°·½·¨¶¨Òå
	{0x2010,	1},//	±íÄÚÎÂ¶È	Êı¾İÀàĞÍ£ºlong£¬µ¥Î»£º¡æ£¬»»Ëã£º-1
	{0x2011,	2},//	Ê±ÖÓµç³ØµçÑ¹	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£ºV£¬»»Ëã£º-2
	{0x2012,	2},//	Í£µç³­±íµç³ØµçÑ¹	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£ºV£¬»»Ëã£º-2
	//{0x2013,	0},//	Ê±ÖÓµç³Ø¹¤×÷Ê±¼ä	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£º·ÖÖÓ£¬ÎŞ»»Ëã
	//2014	6	µçÄÜ±íÔËĞĞ×´Ì¬×Ö	Êı¾İÀàĞÍ£ºarray bit-string£¬ÎŞµ¥Î»£¬ÎŞ»»Ëã£¬°üÀ¨µçÄÜ ±íÔËĞĞ×´Ì¬×Ö 1¡­7£¬¼û¸½  Â¼ G
	
	//2015	6	µçÄÜ±í¸úËæÉÏ±¨×´Ì¬×Ö	Êı¾İÀàĞÍ£ºbit-string(SIZE(32))£¬ÎŞµ¥Î»£¬ÎŞ»»Ëã£¬¼û¸½ Â¼  G
	//ÊôĞÔ 4£¨µçÄÜ±í¸úËæÉÏ±¨Ä£Ê½×Ö£©¡Ë= bit-string(SIZE(32)) ·½·¨ 127£¨È·ÈÏµçÄÜ±í¸úËæÉÏ±¨×´Ì¬×Ö£©¡Ë=
	//bit-string(SIZE(32))
	{0x2017,	4},//	µ±Ç°ÓĞ¹¦ĞèÁ¿	Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºkW£¬»»Ëã£º-4
	{0x2018,	4},//	µ±Ç°ÎŞ¹¦ĞèÁ¿	Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºkvar£¬»»Ëã£º-4
	{0x2019,	4},//	µ±Ç°ÊÓÔÚĞèÁ¿	Êı¾İÀàĞÍ£ºdouble-long£¬µ¥Î»£ºkVA£¬»»Ëã£º-4
	{0x201A,	4},//	µ±Ç°µç¼Û	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºÔª/kWh£¬»»Ëã£º-4
	{0x201B,	4},//	µ±Ç°·ÑÂÊµç¼Û	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºÔª/kWh£¬»»Ëã£º-4
	{0x201C,	4},//	µ±Ç°½×Ìİµç¼Û	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºÔª/kWh£¬»»Ëã£º-4
	//201E	8	ÊÂ¼ş·¢ÉúÊ±¼ä	Êı¾İÀàĞÍ£ºdate_time_s
	//2020	8	ÊÂ¼ş½áÊøÊ±¼ä	Êı¾İÀàĞÍ£ºdate_time_s
	//2021	8	Êı¾İ¶³½áÊ±¼ä	Êı¾İÀàĞÍ£ºdate_time_s
	//2022	8	ÊÂ¼ş¼ÇÂ¼ĞòºÅ	Êı¾İÀàĞÍ£ºdouble-long-unsigned
	//2023	8	¶³½á¼ÇÂ¼ĞòºÅ	Êı¾İÀàĞÍ£ºdouble-long-unsigned
	//2024	8	ÊÂ¼ş·¢ÉúÔ´ ¾ßÌå¶ÔÏó¶¨Òå¡£
	//2025	8	ÊÂ¼şµ±Ç°Öµ structure
	//{
	//ÊÂ¼ş·¢Éú´ÎÊı double-long-unsigned£¬
	//ÊÂ¼şÀÛ¼ÆÊ±¼ä double-long-unsigned£¨µ¥Î»£ºÃë£¬ÎŞ»» Ëã£©
	//}
	{0x2026,	2},//	µçÑ¹²»Æ½ºâÂÊ	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£º%£¬»»Ëã£º-2
	{0x2027,	2},//	µçÁ÷²»Æ½ºâÂÊ	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£º%£¬»»Ëã£º-2
	{0x2028,	2},//	¸ºÔØÂÊ	Êı¾İÀàĞÍ£ºlong-unsigned£¬µ¥Î»£º%£¬»»Ëã£º-2
	{0x2029,	2},//	°²Ê±Öµ	ÊôĞÔ 2 °²Ê±ÊıÖµ¡Ë=array Ïà°²Ê±ÖµÏà°²Ê±Öµ¡Ë=double-long-unsigned£¬µ¥Î»£ºAh£¬»»Ëã£º-2 Ïà°²Ê±Öµ°ü×Ü¡¢A¡¢B¡¢C Ïà¡£
	//202A	8	Ä¿±ê·şÎñÆ÷µØÖ·	ÊôĞÔ 2¡Ë=TSA
	 
	
	//¶ÔÏó±êÊ¶ OI ½Ó¿ÚÀà IC	¶ÔÏóÃû³Æ	ÊµÀıµÄ¶ÔÏóÊôĞÔ¼°·½·¨¶¨Òå
	{0x202C,	2},//	£¨µ±Ç°£©Ç®°üÎÄ¼ş	ÊıÖµ¡Ë=structure
	//{
	//Ê£Óà½ğ¶î	double-long-unsigned£¨µ¥Î»£ºÔª£¬»»Ëã£º-2£©£¬ ¹ºµç´ÎÊı	double-long-unsigned
	//}
	{0x202D,	2},//	£¨µ±Ç°£©Í¸Ö§½ğ¶î	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºÔª£¬»»Ëã£º-2
	{0x202E,	2},//	ÀÛ¼Æ¹ºµç½ğ¶î	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºÔª£¬»»Ëã£º-2
	{0x2031,	2},//	ÔÂ¶ÈÓÃµçÁ¿ ÊôĞÔ 2 ÓÃµçÁ¿¡Ë=double-long-unsigned£¬ µ¥Î»£ºkWh£¬»»Ëã£º-2
	{0x2032,	2},//	½×Ìİ½áËãÓÃµçÁ¿	ÊôĞÔ 2 ÓÃµçÁ¿¡Ë=double-long-unsigned£¬ µ¥Î»£ºkWh£¬»»Ëã£º-2
	//2040	6	¿ØÖÆÃüÁîÖ´ĞĞ×´Ì¬×Ö Êı¾İÀàĞÍ£ºbit-string(SIZE(16))£¬ÎŞµ¥Î»£¬ÎŞ»»Ëã
	//2041	6	¿ØÖÆÃüÁî´íÎó×´Ì¬×Ö Êı¾İÀàĞÍ£ºbit-string(SIZE(16))£¬ÎŞµ¥Î»£¬ÎŞ»»Ëã
	//2100	14	·ÖÖÓÇø¼äÍ³¼Æ	Í³¼ÆÖÜÆÚµ¥Î»Îª·ÖÖÓ
	//2101	14	Ğ¡Ê±Çø¼äÍ³¼Æ	Í³¼ÆÖÜÆÚµ¥Î»ÎªĞ¡Ê±
	//2102	14	ÈÕÇø¼äÍ³¼Æ Í³¼ÆÖÜÆÚµ¥Î»ÎªÈÕ
	//2103	14	ÔÂÇø¼äÍ³¼Æ Í³¼ÆÖÜÆÚµ¥Î»ÎªÔÂ
	//2104	14	ÄêÇø¼äÍ³¼Æ Í³¼ÆÖÜÆÚµ¥Î»ÎªÄê
	//2110	15	·ÖÖÓÆ½¾ù	Í³¼ÆÖÜÆÚµ¥Î»Îª·ÖÖÓ
	//2111	15	Ğ¡Ê±Æ½¾ù	Í³¼ÆÖÜÆÚµ¥Î»ÎªÊ±
	//2112	15	ÈÕÆ½¾ù	Í³¼ÆÖÜÆÚµ¥Î»ÎªÈÕ
	//2113	15	ÔÂÆ½¾ù	Í³¼ÆÖÜÆÚµ¥Î»ÎªÔÂ
	//2114	15	ÄêÆ½¾ù	Í³¼ÆÖÜÆÚµ¥Î»ÎªÄê
	//2120	16	·ÖÖÓ¼«Öµ	Í³¼ÆÖÜÆÚµ¥Î»Îª·ÖÖÓ
	//2121	16	Ğ¡Ê±¼«Öµ	Í³¼ÆÖÜÆÚµ¥Î»ÎªÊ±
	//2122	16	ÈÕ¼«Öµ	Í³¼ÆÖÜÆÚµ¥Î»ÎªÈÕ
	//2123	16	ÔÂ¼«Öµ	Í³¼ÆÖÜÆÚµ¥Î»ÎªÔÂ
	//2124	16	Äê¼«Öµ	Í³¼ÆÖÜÆÚµ¥Î»ÎªÄê
	//2131	6	µ±ÔÂ A ÏàµçÑ¹ºÏ¸ñÂÊ ÊôĞÔ 2£¨µçÑ¹ºÏ¸ñÂÊÊı¾İ£©¡Ë=structure
	//{
	//µ±ÈÕµçÑ¹ºÏ¸ñÂÊ	µçÑ¹ºÏ¸ñÂÊ£¬
	//µ±ÔÂµçÑ¹ºÏ¸ñÂÊ	µçÑ¹ºÏ¸ñÂÊ
	//}
	
	
