gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
	//µçÑ¹ºÏ¸ñÂÊ¡Ë=structure
	//{
	//µçÑ¹¼à²âÊ±¼ä double-long-unsigned£¨µ¥Î»£º·ÖÖÓ£¬ÎŞ»» Ëã£©£¬
	 
	
	//¶ÔÏó±êÊ¶ OI ½Ó¿ÚÀà IC	¶ÔÏóÃû³Æ	ÊµÀıµÄ¶ÔÏóÊôĞÔ¼°·½·¨¶¨Òå
	{0x2131,	2},//	µ±ÔÂ A ÏàµçÑ¹ºÏ¸ñÂÊ µçÑ¹ºÏ¸ñÂÊ long-unsigned£¨µ¥Î»£º%£¬»»Ëã£º-2£©£¬ µçÑ¹³¬ÏŞÂÊ	long-unsigned£¨µ¥Î»£º%£¬»»Ëã£º-2£©£¬ µçÑ¹³¬ÉÏÏŞÊ±¼ä  double-long-unsigned£¨µ¥Î»£º·ÖÖÓ£¬ÎŞ»»Ëã£©£¬µçÑ¹³¬ÏÂÏŞÊ±¼ä double-long-unsigned£¨µ¥Î»£º·ÖÖÓ£¬ ÎŞ»»Ëã£©}
	{0x2132,	2},//	µ±ÔÂ B ÏàµçÑ¹ºÏ¸ñÂÊ Í¬ 2131
	{0x2133,	2},//	µ±ÔÂ C ÏàµçÑ¹ºÏ¸ñÂÊ Í¬ 2131
	//2140	2	ÈÕ×î´óÓĞ¹¦¹¦ÂÊ¼°·¢ÉúÊ±¼ä	×î´ó¹¦ÂÊ¼°·¢ÉúÊ±¼ä¡Ë=structure
	//{
	//×î´ó¹¦ÂÊÖµ double-long-unsigned£¬ ·¢ÉúÊ±¼ä	date_time_s
	//}
	//¹¦ÂÊµ¥Î»£ºkW£¬»»Ëã£º-4
	{0x2141,	4},//	ÔÂ×î´óÓĞ¹¦¹¦ÂÊ¼°·¢ÉúÊ±¼ä	Í¬ 2140¡£
	//2200	6	Í¨ĞÅÁ÷Á¿	ÊıÖµ¡Ë=structure
	//{
	//µ±ÈÕÍ¨ĞÅÁ÷Á¿ double-long-unsigned£¬ µ±ÔÂÍ¨ĞÅÁ÷Á¿ double-long-unsigned
	//}
	//µ¥Î»£ºbyte£¬»»Ëã£º0
	//2203	6	¹©µçÊ±¼ä	ÊıÖµ¡Ë=structure
	//{
	//ÈÕ¹©µçÀÛ¼ÆÊ±¼ä double-long-unsigned£¬ ÔÂ¹©µçÀÛ¼ÆÊ±¼ä double-long-unsigned
	//}
	//µ¥Î»£º·ÖÖÓ£¬»»Ëã£º0
	//2204	6	¸´Î»´ÎÊı	ÊıÖµ¡Ë=structure
	//{
	//ÈÕ¸´Î»ÀÛ¼Æ´ÎÊı long-unsigned£¬ ÔÂ¸´Î»ÀÛ¼Æ´ÎÊı long-unsigned
	//}
	//2301	23	×Ü¼Ó×é 1 
	//2302	23	×Ü¼Ó×é 2 
	//2303	23	×Ü¼Ó×é 3 
	//2304	23	×Ü¼Ó×é 4 
	//2305	23	×Ü¼Ó×é 5 
	 
	
	//¶ÔÏó±êÊ¶ OI ½Ó¿ÚÀà IC	¶ÔÏóÃû³Æ	ÊµÀıµÄ¶ÔÏóÊôĞÔ¼°·½·¨¶¨Òå
	//2306	23	×Ü¼Ó×é 6 
	//2307	23	×Ü¼Ó×é 7 
	//2308	23	×Ü¼Ó×é 8 
	//2401	12	Âö³å¼ÆÁ¿ 1	
	//2402	12	Âö³å¼ÆÁ¿ 2	
	//2403	12	Âö³å¼ÆÁ¿ 3	
	//2404	12	Âö³å¼ÆÁ¿ 4	
	//2405	12	Âö³å¼ÆÁ¿ 5	
	//2406	12	Âö³å¼ÆÁ¿ 6	
	//2407	12	Âö³å¼ÆÁ¿ 7	
	//2408	12	Âö³å¼ÆÁ¿ 8	
	//2500	6	ÀÛ¼ÆË®£¨ÈÈ£©Á÷Á¿	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºm3£¬»»Ëã£º-4
	//£¨×¢£ºË®±íºÍÈÈ±í¹²ÓÃ£©
	{0x2501,	4},//	ÀÛ¼ÆÆøÁ÷Á¿ Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºm3£¬»»Ëã£º-4
	{0x2502,	2},//	ÀÛ¼ÆÈÈÁ¿	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºJ£¬»»Ëã£º-2
	{0x2503,	2},//	ÈÈ¹¦ÂÊ	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºJ/h£¬»»Ëã£º-2
	//2504	6	ÀÛ¼Æ¹¤×÷Ê±¼ä	Êı¾İÀàĞÍ£ºdouble-long-unsigned£¬µ¥Î»£ºĞ¡Ê±£¬»»Ëã£º0
	{0x2505,	2},//	Ë®ÎÂ	ÊıÖµ¡Ë=structure
	//{
	//¹©Ë®ÎÂ¶È double-long-unsigned£¬ »ØË®ÎÂ¶È double-long-unsigned
	//}
	//µ¥Î»£º¡æ£¬»»Ëã£º-2¡£
	//2506	6	£¨ÒÇ±í£©×´Ì¬ ST	ÊıÖµ¡Ë=structure
	///{
	//·§ÃÅ×´Ì¬  enum{¿ª£¨0£©£¬¹Ø£¨1£©£¬±£Áô£¨2£©£¬Òì³££¨3£©}£¬ µç³ØµçÑ¹  enum{Õı³££¨0£©£¬Ç·Ñ¹£¨0£©}
	//}
};
const u32 OAD_PointNUMSIZE=sizeof(OAD_PointNUM_list)/sizeof(POINTNUM_type);



u32 Str_CRandLF(u8 *p)//»Ø³µºÍ»»ĞĞ
{
#ifdef UNFORMAT_JSON
	*p=0x0D;
	p++;
	*p=0x0A;

	return 2;
#else
	return 0;
#endif
}

u32 Str_CR(u8 *p)//»Ø³µ
{
	*p=0x0D;
	return 1;
}

u32 Str_LF(u8 *p)//»»ĞĞ
{
	*p=0x0A;
	return 1;
}

u32 Str_SPASE(u8 *p)//¿Õ¸ñ
{
	*p=0x20;
	return 1;
}

u32 Str_nSPASE(u8 *p,u32 NUM)//¿Õ¸ñ
{
#ifdef UNFORMAT_JSON
	u32 i;
	for(i=0;i<NUM;i++)
	{
		*p=0x20;
		p++;
	}
	return NUM;
#else
	return 0;
#endif
}

u32 Str_COMMA(u8 *p)//¶ººÅ
{
	*p=0x2C;
	return 1;
}

u32 Str_QM(u8 *p)//ÒıºÅ
{
	*p=0x22;
	return 1;
}

u32 Str_COL(u8 *p)//Ã°ºÅ
{
	*p=0x3A;
	return 1;
}
u32 Str_L_SQB(u8 *p)//×ó·½À¨ºÅ
{
	*p=0x5B;
	return 1;
}

u32 Str_R_SQB(u8 *p)//ÓÒ·½À¨ºÅ
{
	*p=0x5D;
	return 1;
}
u32 Str_L_CUB(u8 *p)//×ó»¨À¨ºÅ
{
	*p=0x7B;
	return 1;
}

u32 Str_R_CUB(u8 *p)//ÓÒ»¨À¨ºÅ
{
	*p=0x7D;
	return 1;
}

void myprintf(char *pStr,u32 param1,u32 param2,u32 param3)
{
#ifdef DEBUG_JSON
	ms_Type *ms;
	ms=Get_ms();
	
	ms->link_printf((char *)pStr,param1,param2,param3);
#endif
}

u32 mystrlen(const char *p)//¼ÆËã×Ö·û´®³¤¶È
{
	u32 i;
	i=0;
	while((*p!='\0')||(*p!=0))
	{
		i++;
		p++;
	}
	return i;
}

void ByteInverte(u8 *ps,u8 *pc,u32 Len)//psÖĞLen×Ö½Úµ¹ĞğÊä³öµ½pcÖĞ
{
	u32 i;
	u32 j;
	j=0;
	for(i=Len;i>0;i--)
	{
		pc[j]=ps[i-1];
		j++;
	}
}
u32 mymemcmp(u8 *p,u32 val,u32 Len)//±È½ÏÁ½¸öÊı¾İ,1²»ÏàÍ¬,0ÏàÍ¬
{
	u32 i;
	for(i=0;i<Len;i++)
	{
		if(*p!=val)
		{
			return 1;
		}
		p++;
	}
	return 0;
}
void mystrcpy(char *p,const char *pc)//pc×Ö½Ú¿½±´µ½pÀïÃæÈ¥
{
	u32 pclen;
	u32 i;
	pclen=mystrlen(pc);
	for(i=0;i<pclen;i++)
	{
		*p=*pc;
		pc++;
		p++;
	}
	*p=0;
}
void mystrncpy(char *p,const char *pc,u32 Len)//pc×Ö½Ú¿½±´n¸öµ½pÀïÃæÈ¥
{
	u32 i;
	for(i=0;i<Len;i++)
	{
		*p=*pc;
		pc++;
		p++;
	}
	*p=0;
}
void mystrncat(char *p,const char *pc,u32 Len)//pºóÃæÁ¬½ÓLen³¤¶Èpc×Ö·û
{
	u32 plen;
	//u32 pclen;
	u32 i;
	plen=mystrlen(p);
	//pclen=mystrlen(pc);
	p+=plen;
	for(i=0;i<Len;i++)
	{
		*p=*pc;
		pc++;
		p++;
	}
	*p=0;
}

u32 Data_Ascii(u64 ida,u8 *p,u32 NUM)//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı
{
	u32 i;
	u64 data;
	u32 Len=0;
	u8 tm;
	data=hex_bcd16(ida);
	if(0==data)
	{	
		*p=0x30;
		p++;
		Len++;
		for(i=0;i<NUM;i++)
		{			
			if(0==i)
			{
				*p='.';	
				p++;
				Len++;
				*p=0x30;
				Len++;
			}else
			{
				*p=0x30;
				Len++;
			}
			p++;
		}
	}else
	{
		for(i=16;i>0;i--)
		{
			tm=(data>>((i-1)*4))&0xf;
			if(NUM==i)
			{
				*p='.';	
				p++;	
				Len++;
			}
			if(0!=tm)
			{
				*p=tm+0x30;
				p++;
				Len++;
			}else
			{
				if(Len!=0||NUM+1==i)
				{
					*p=tm+0x30;
					p++;
					Len++;
				}
			}
		}
	}
	*p=0;
	return Len;
}

void mystrcat(char *p,const char *pc)//p×Ö·ûÁ¬½Ópcµ½p
{
	u32 plen;
	u32 pclen;
	u32 i;
	plen=mystrlen(p);
	pclen=mystrlen(pc);
	p+=plen;
	for(i=0;i<pclen;i++)
	{
		*p=*pc;
		pc++;
		p++;
	}
	*p=0;
}

u32 Cmp_Ascii_Inverte(u8 *p,u8 *pc,u32 Byte)//×Ö½Úpc×ª³ÉascÂëµ¹Ğò¸úp±È½Ï
{
	u32 i;
	u8 data;
	u32 x;
	for(i=Byte;i>0;i--)
	{
		data=pc[i-1];
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		if(*p!=x)
		{
			return 1;
		}
		p++;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		if(*p!=x)
		{
			return 1;
		}
		p++;
	}
	return 0;
}

u32 Cmp_Ascii(u8 *p,u8 *pc,u32 Byte)//×Ö½Úpc×ª³ÉascÂë¸úp±È½Ï
{
	u32 i;
	u8 data;
	u32 x;
	for(i=0;i<Byte;i++)
	{
		data=pc[i];
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		if(*p!=x)
		{
			return 1;
		}
		p++;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		if(*p!=x)
		{
			return 1;
		}
		p++;
	}
	return 0;
}

void Add_StrToASCII_Inverte(u8 *pStr,u8 *pbuf,u32 Byte)//pbufÀïÃæµÄ×Ö½Úµ¹ĞòÊä³öµ½pstr²¢×ª³ÉascÂë
{
	u32 i;
	u32 j=0;
	u8 data;
	u32 x;
	for(i=Byte;i>0;i--)
	{
		data=pbuf[i-1];
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		pStr[j++]=x;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		pStr[j++]=x;
		
