gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
	}
	pStr[j]=0;
}

void Add_StrToASCII(u8 *pStr,u8 *pbuf,u32 Byte)//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
{
	u32 i;
	u32 j=0;
	u8 data;
	u32 x;
	for(i=0;i<Byte;i++)
	{
		data=pbuf[i];
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		pStr[j++]=x;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		pStr[j++]=x;
		
	}
	pStr[j]=0;
}

void Get698CurTime_Ascii(u8 *p8,u32 subD)//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë,¼õÈ¥subD
{
	u32 i;
	u32 x;
	u8 data;
	u8 *p8s;
	//Ğ´Ê±¼ä
	//Äê
	u32 YYMD;
	YYMD=(Comm_Ram->DL698YMDHMS[0]<<24)+(Comm_Ram->DL698YMDHMS[1]<<16)+(Comm_Ram->DL698YMDHMS[2]<<8)+Comm_Ram->DL698YMDHMS[3];
	if(subD!=0)
	{
		for(i=0;i<subD;i++)
			YYMD=YYMD_Sub1D_hex(YYMD);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ	
	}
	
	p8s=(u8*)ADDR_4KWRITE_BUFF;	
	p8s[0]=YYMD>>24;
	p8s[1]=YYMD>>16;
	p8s[2]=YYMD>>8;
	p8s[3]=YYMD>>0;
	p8s[4]=Comm_Ram->DL698YMDHMS[4];//Ê±¼ä:Ê±
	p8s[5]=Comm_Ram->DL698YMDHMS[5];//Ê±¼ä:·Ö
	p8s[6]=Comm_Ram->DL698YMDHMS[5];//Ê±¼ä:Ãë
	//x=(Comm_Ram->DL698YMDHMS[0]<<8)|Comm_Ram->DL698YMDHMS[1];
	x=(p8s[0]<<8)|p8s[1];
	x=hex_bcd(x);
	Add_StrToASCII_Inverte(p8,(u8 *)&x,2);
	p8+=4;
	for(i=2;i<7;i++)
	{
		data=p8s[i];
		data=hex_bcd(data);
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		*p8=x;
		p8++;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		*p8=x;
		p8++;
	}
	*p8=0;
}

void Get698Time_Ascii(u8 *p,u8 *p8)//pÊ±¼äÇ°Á½¸ö×Ö½Ú±íÊ¾Äê·İp8Êä³öascÂë
{
	u32 i;
	u32 x;
	u8 data;
	//Ğ´Ê±¼ä
	//Äê
	x=(p[0]<<8)|p[1];
	x=hex_bcd(x);
	Add_StrToASCII_Inverte(p8,(u8 *)&x,2);
	p8+=4;
	for(i=2;i<7;i++)
	{
		data=p[i];
		data=hex_bcd(data);
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		*p8=x;
		p8++;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		*p8=x;
		p8++;
	}
	*p8=0;
}

u32 Cmp698Time_Ascii(u8 *p,u8 *pc,u32 Byte)//698Ê±¼ä±È½ÏpcÇ°Á½¸ö×Ö½Ú´ú±íÄê·İ
{
	u32 i;
	u8 data;
	u32 x;
	u8 ptim[4]={0};
	//Ğ´Ê±¼ä
	//Äê
	x=(pc[0]<<8)|pc[1];
	x=hex_bcd(x);
	Add_StrToASCII_Inverte(ptim,(u8 *)&x,2);
	//ÏÈ±È½ÏÄê·İ
	for(i=0;i<4;i++)
	{
		if(*p!=ptim[i])
		{
			return 1;
		}
	}
	for(i=2;i<Byte;i++)
	{
		data=pc[i];
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		if(*p!=x)
		{
			return 1;
		}
		p++;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		if(*p!=x)
		{
			return 1;
		}
		p++;
	}
	return 0;
}

void Get698Time_HMS_Ascii(u8 *pt,u8 *p8,u8 hour,u8 min,u8 sec)//pÊ±¼äÇ°Á½¸ö×Ö½Ú±íÊ¾Äê·İp8Êä³öascÂë
{
	u32 i;
	u32 x;
	u8 data;
	//Ğ´Ê±¼ä
	//Äê
	//x=(Comm_Ram->DL698YMDHMS[0]<<8)|Comm_Ram->DL698YMDHMS[1];
	x=(pt[0]<<8)|pt[1];
	x=hex_bcd(x);
	Add_StrToASCII_Inverte(p8,(u8 *)&x,2);
	p8+=4;
	for(i=2;i<4;i++)
	{
		//data=Comm_Ram->DL698YMDHMS[i];
		data=pt[i];
		data=hex_bcd(data);
		x=data>>4;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		*p8=x;
		p8++;
		x=data&0xf;
		if(x<10)
		{
			x+=0x30;
		}
		else
		{
			x+=55;
		}
		*p8=x;
		p8++;
	}
	data=hex_bcd(hour);
	x=data>>4;
	if(x<10)
	{
		x+=0x30;
	}
	else
	{
		x+=55;
	}
	*p8=x;
	p8++;
	x=data&0xf;
	if(x<10)
	{
		x+=0x30;
	}
	else
	{
		x+=55;
	}
	*p8=x;
	p8++;
	data=hex_bcd(min);
	x=data>>4;
	if(x<10)
	{
		x+=0x30;
	}
	else
	{
		x+=55;
	}
	*p8=x;
	p8++;
	x=data&0xf;
	if(x<10)
	{
		x+=0x30;
	}
	else
	{
		x+=55;
	}
	*p8=x;
	p8++;
	data=hex_bcd(sec);
	x=data>>4;
	if(x<10)
	{
		x+=0x30;
	}
	else
	{
		x+=55;
	}
	*p8=x;
	p8++;
	x=data&0xf;
	if(x<10)
	{
		x+=0x30;
	}
	else
	{
		x+=55;
	}
	*p8=x;
	p8++;
	*p8=0;
}
void GetNullTime(u8 *pt)//µÃµ½Ò»¸öJSON¸ñÊ½ÒªÇóµÄ¿ÕÊ±¼ä¸ñÊ½
{
	u32 offset;
	offset=0;
	pt[offset++]='0';
	pt[offset++]='0';
	pt[offset++]='-';
	pt[offset++]='0';
	pt[offset++]='0';
	pt[offset++]='-';
	pt[offset++]='0';
	pt[offset++]='0';
	pt[offset++]=' ';
	pt[offset++]='0';
	pt[offset++]='0';
	pt[offset++]=':';
	pt[offset++]='0';
	pt[offset++]='0';
	pt[offset++]=':';
	pt[offset++]='0';
	pt[offset++]='0';
	pt[offset++]=0;
}
void GetJsonTime(u8 *pt)//°Ñ´¦ÀíºÃµÄÊ±¼äbuf pt×ª»»³ÉJSONÎÄ¼şÀïÃæµÄÊ±¼ä¸ñÊ½£¨2020-05-01 20:00:00£©
{
	u8 tt[14];
	MW((u32)pt,(u32)tt,sizeof(tt));
	//Äê
	pt[0]=tt[0];
	pt[1]=tt[1];
	pt[2]=tt[2];
	pt[3]=tt[3];	
	//ÔÂ
	pt[4]='-';
	pt[5]=tt[4];
	pt[6]=tt[5];
	//ÈÕ
	pt[7]='-';
	pt[8]=tt[6];
	pt[9]=tt[7];

	pt[10]=' ';
	//Ê±
	pt[11]=tt[8];
	pt[12]=tt[9];
	pt[13]=':';
	//·Ö
	pt[14]=tt[10];
	pt[15]=tt[11];
	pt[16]=':';
	//Ãë
	pt[17]=tt[12];
	pt[18]=tt[13];
	pt[19]=0;
}

void WriteNullString(u8 *p8)//Êı¾İBUFÀïÃæĞ´ASC µÄNULL
{
	p8[0]='n';
	p8[1]='u';
	p8[2]='l';
	p8[3]='l';
	p8[4]=0;	
}

u32 Get_DataPointNUM(u16 OI)//ÔÚOAD_PointNUM_list±í¸ñÖĞÕÒOAD²¢µÃµ½Õâ¸öOADµÄĞ¡ÊıÎ»Êı
{
	u32 i;
	u32 ret=0;
	for(i=0;i<OAD_PointNUMSIZE;i++)
	{
		if(OAD_PointNUM_list[i].OI==OI)
		{
			ret=OAD_PointNUM_list[i].POINTNUM;
			break;
		}
	}
	return ret;
}
u32 DealMetData_Ascii(u16 OI,u8 *pdata,u8 *pout,u32 isReal)//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii
{
	u32 i;
	u32 datalen;
	u32 pointnum;
	u64 data;
	i=Get_DL698DataLen_S(pdata,0);
	if(0==i)
	{		
		return i;
	}
	if(pdata[0])
	{
		i--;
		data=0;
		if(i>8)
		{
			i=8;
		}
		datalen=i;
		while(i>0)
		{
			pdata++;
			i--;
			data|=((*pdata)<<(i*8));
		}
		if((data&0xffffffff)==0xffffffff || (data&0xffffffff)==0x7fffffff)
		{
			if(!isReal)
			{
				WriteNullString(pout);//Êı¾İBUFÀïÃæĞ´ASC µÄNULL
				i=4;
			}else
			{
				pout[0]=0;
				i=1;
			}
		}else
		{
			switch (OI>>8)
			{
				case 0x00:
				case 0x01:
				case 0x02:
				case 0x03:
				case 0x04:
				case 0x05:
					pointnum=2;
					break;
				case 0x10:
				case 0x11:
					pointnum=4;
					break;
				default:
					pointnum=Get_DataPointNUM(OI);
					break;		
			}
			i=0;
			i=(data>>((datalen-1)*8));
			if(i>>4)//Õâ¸öÊı¾İÊÇ¸ºÊı
			{
				*pout='-';
				pout++;
				i=(u32)data;
				data=(u64)(~(i)+1);
			}
			i=Data_Ascii(data,pout,pointnum);//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı			
		}
	}else
	{
		if(!isReal)
		{
			WriteNullString(pout);//Êı¾İBUFÀïÃæĞ´ASC µÄNULL
			i=4;
		}else
		{
			pout[0]=0;
			i=1;
		}
	}
	return i;
}

u32 Createitem_Json(u8 *pout,u8 *ph,u8 *pd,u32 spacenum)//´´½¨JSON¸ñÊ½: "XXXXX":"XXXXXXX",
{
	u32 i;
	u32 CJSONLEN;
	CJSONLEN=0;
	i=Str_CRandLF(pout+CJSONLEN);//»Ø³µºÍ»»ĞĞ
	CJSONLEN+=i;
	i=Str_nSPASE(pout+CJSONLEN,spacenum);//¿Õ¸ñ
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	mystrcpy((char *)pout+CJSONLEN,(const char *)ph);
	i=mystrlen((const char *)pout+CJSONLEN);
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	i=Str_COL(pout+CJSONLEN);//Ã°ºÅ
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	mystrcpy((char *)pout+CJSONLEN,(const char *)pd);
	i=mystrlen((const char *)pout+CJSONLEN);
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	i=Str_COMMA(pout+CJSONLEN);//¶ººÅ
	CJSONLEN+=i;

	return CJSONLEN;
}

