gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
u32 CreateitemNum_Json(u8 *pout,u8 *ph,u8 *pd,u32 spacenum)//´´½¨JSON¸ñÊ½: "XXXXX":XXXXXXX,
{
	u32 i;
	u32 CJSONLEN;
	CJSONLEN=0;
	i=Str_CRandLF(pout+CJSONLEN);//»Ø³µºÍ»»ĞĞ
	CJSONLEN+=i;
	i=Str_nSPASE(pout+CJSONLEN,spacenum);//¿Õ¸ñ
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	mystrcpy((char *)pout+CJSONLEN,(const char *)ph);
	i=mystrlen((const char *)pout+CJSONLEN);
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	i=Str_COL(pout+CJSONLEN);//Ã°ºÅ
	CJSONLEN+=i;
	mystrcpy((char *)pout+CJSONLEN,(const char *)pd);
	i=mystrlen((const char *)pout+CJSONLEN);
	CJSONLEN+=i;
	i=Str_COMMA(pout+CJSONLEN);//¶ººÅ
	CJSONLEN+=i;

	return CJSONLEN;
}

u32 CreateitemArrayHead_Json(u8 *pout,u8 *ph,u32 spacenum)//´´½¨JSON¸ñÊ½: "XXXXX":[
{
	u32 i;
	u32 CJSONLEN;
	CJSONLEN=0;
	i=Str_CRandLF(pout+CJSONLEN);//»Ø³µºÍ»»ĞĞ
	CJSONLEN+=i;
	i=Str_nSPASE(pout+CJSONLEN,spacenum);//¿Õ¸ñ
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	mystrcpy((char *)pout+CJSONLEN,(const char *)ph);
	i=mystrlen((const char *)pout+CJSONLEN);
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	i=Str_COL(pout+CJSONLEN);//Ã°ºÅ
	CJSONLEN+=i;
	i=Str_L_SQB(pout+CJSONLEN);//×ó·½À¨ºÅ
	CJSONLEN+=i;
	return CJSONLEN;
}

u32 CreateitemArrayEnd_Json(u8 *pout,u32 Len,u32 spacenum)//´´½¨JSON¸ñÊ½: ],
{
	u32 i;
	u32 CJSONLEN;
	u8 flag=0;
	CJSONLEN=0;
	if(Len>0)
	{
		if(','==pout[Len-1])
		{
			Len--;
			flag=1;
		}
	}
	i=Str_CRandLF(pout+Len+CJSONLEN);//»Ø³µºÍ»»ĞĞ
	CJSONLEN+=i;
	i=Str_nSPASE(pout+Len+CJSONLEN,spacenum);//¿Õ¸ñ
	CJSONLEN+=i;
	i=Str_R_SQB(pout+Len+CJSONLEN);//ÓÒ·½À¨ºÅ
	CJSONLEN+=i;
	i=Str_COMMA(pout+Len+CJSONLEN);//¶ººÅ
	CJSONLEN+=i;
	if(0!=flag)
	{
		CJSONLEN--;
	}
	return CJSONLEN;
}

u32 CreateArrayHead_Json(u8 *pout,u32 spacenum)//´´½¨JSON¸ñÊ½: {
{
	u32 i;
	u32 CJSONLEN;
	CJSONLEN=0;
	i=Str_CRandLF(pout+CJSONLEN);//»Ø³µºÍ»»ĞĞ
	CJSONLEN+=i;
	i=Str_nSPASE(pout+CJSONLEN,spacenum);//¿Õ¸ñ
	CJSONLEN+=i;
	i=Str_L_CUB(pout+CJSONLEN);//×ó»¨À¨ºÅ
	CJSONLEN+=i;
	return CJSONLEN;
}

u32 CreateArrayEnd_Json(u8 *pout,u32 Len,u32 spacenum)//´´½¨JSON¸ñÊ½: },
{
	u32 i;
	u32 CJSONLEN;
	u8 flag=0;
	CJSONLEN=0;
	if(Len>0)
	{
		if(','==pout[Len-1])
		{
			Len--;
			flag=1;
		}
	}
	i=Str_CRandLF(pout+Len+CJSONLEN);//»Ø³µºÍ»»ĞĞ
	CJSONLEN+=i;
	i=Str_nSPASE(pout+Len+CJSONLEN,spacenum);//¿Õ¸ñ
	CJSONLEN+=i;
	i=Str_R_CUB(pout+Len+CJSONLEN);//ÓÒ»¨À¨ºÅ
	CJSONLEN+=i;
	i=Str_COMMA(pout+Len+CJSONLEN);//¶ººÅ
	CJSONLEN+=i;
	if(0!=flag)
	{
		CJSONLEN--;
	}
	return CJSONLEN;
}

u32 CreateDataHead_Json(u8 *pout,u8 *ph,u32 spacenum)//´´½¨JSON¸ñÊ½: "XXXXXXX","
{
	u32 i;
	u32 CJSONLEN;
	CJSONLEN=0;
	i=Str_CRandLF(pout+CJSONLEN);//»Ø³µºÍ»»ĞĞ
	CJSONLEN+=i;
	i=Str_nSPASE(pout+CJSONLEN,spacenum);//¿Õ¸ñ
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	mystrcpy((char *)pout+CJSONLEN,(const char *)ph);
	i=mystrlen((const char *)pout+CJSONLEN);
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	i=Str_COL(pout+CJSONLEN);//Ã°ºÅ
	CJSONLEN+=i;
	i=Str_QM(pout+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;

	return CJSONLEN;
}

u32 CreateData_Json(u8 *pout,u8 *pd)//´´½¨JSON¸ñÊ½: XXXX,
{
	u32 i;
	u32 CJSONLEN;
	CJSONLEN=0;
	if(pd[0]!=0)
	{
		mystrcpy((char *)pout+CJSONLEN, (const char *)pd);
		i=mystrlen((const char *)pout+CJSONLEN);
		CJSONLEN+=i;
	}
	i=Str_COMMA(pout+CJSONLEN);//¶ººÅ
	CJSONLEN+=i;

	return CJSONLEN;
}

u32 CreateDataEnd_Json(u8 *pout,u32 Len)//´´½¨JSON¸ñÊ½: ",
{
	u32 i;
	u32 CJSONLEN;
	u8 flag=0;
	CJSONLEN=0;
	if(Len>0)
	{
		if(','==pout[Len-1])
		{
			Len--;
			flag=1;
		}
	}
	//CJSONLEN=Len;
	i=Str_QM(pout+Len+CJSONLEN);//ÒıºÅ
	CJSONLEN+=i;
	i=Str_COMMA(pout+Len+CJSONLEN);//¶ººÅ
	CJSONLEN+=i;
	if(0!=flag)
	{
		CJSONLEN--;
	}
	return CJSONLEN;
}
u32 Delet_COMMA(u8 *pout,u32 Len)//É¾³ı¶ººÅ,·µ»Ø×Ü³¤
{
	if(Len>0)
	{
		if(','==pout[Len-1])
		{
			Len--;
		}
	}
	return Len;
}
u32 Get_OneFreDataLen_FromFlash(u8 *pIn)//¼ÆËãÒ»¸ö·ÖÊ±¶ÎÊı¾İ°üÊı¾İµÄ³¤¶È,pinµ¼ÈëµÄÊÇÍêÕûµÄ°ü°üº¬21¸öÊ±±ê×Ö½Ú
{
	u8 OADNUM;

	u32 i;
	u32 x;

	u32 Offset;
	Offset=21;

	Offset+=4;//ROAD

	Offset+=4;//OADNUM
	OADNUM=pIn[Offset];
	Offset++;
	Offset+=OADNUM*4;

	for(x=0;x<OADNUM;x++)
	{		
		i=Get_DL698DataLen_S(pIn+Offset,0);//Ëã³öµÚÒ»¸öÊı¾İµÄ³¤¶È
		Offset+=i;
	}
	return Offset;
}

u32 Day_Month_PackJson(u8 *pInbuf,u8 *pout)//ÈÕÔÂ¶³½áÊı¾İ´ò°üpINbufÇ°Á½¸ö×Ö½Ú±íÊ¾Ò»¹²¶àÉÙÊı¾İ°ü
{
	u8 *p8;
	u8 *p8s;
	u8 *p8Str;
	u8 *pdata;
	u16 *p16;
	
	u8 NUM;//Êı¾İ¸öÊı
	u32 ROAD;//ROADÆğÊ¼Î»ÖÃ
	u8 OADNUM;//OADµÄÊıÁ¿
	u8 OADPORT;//OADÆğÊ¼Î»ÖÃ
	u8 DataNUM;
	
	u16 TotalNUM;
	u32 OAD;

	u32 i;
	u32 x;
	u32 y;
	u32 z;
	u32 Offset;
	u32 CJSONLEN=0;

	p16=(u16 *)pInbuf;
	TotalNUM=p16[0];//Ò»¹²µÄ²É¼¯ÊıÁ¿
	pInbuf+=2;
	while(TotalNUM>0)
	{
		TotalNUM--;	
		Offset=21;//7¸ö×Ö½Ú²É¼¯Æô¶¯Ê±±ê,²É¼¯³É¹¦Ê±±ê,²É¼¯½áÊøÊ±±ê
		if(pInbuf[Offset]!=1)
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,(u32)__LINE__,0);
			#endif
			goto JSON_ERROR;
		}
		p8=(u8 *)ADDR_DATABUFF; 
		Offset++;
		NUM=pInbuf[Offset];//Êı¾İ¸öÊı
		//myprintf("[%s:%d]:NUM=%d\n",(u32)&__func__,(u32)__LINE__,NUM);
		Offset++;
	for(x=0;x<NUM;x++)
	{
		p8Str=Get_Element(pInbuf+21,1+x,0,0);//¼ÆËãÔªËØµØÖ·(ĞéÄâµØÖ·Ö¸Õë),Ê¹ÓÃADDR_128KDATABUFF;³ö¿Ú:µØÖ·Ö¸ÏòÔªËØµÄÀàĞÍ×Ö½Ú,0=´íÎó
		if(!p8Str)
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
			#endif
			goto JSON_ERROR;
		}
		Offset=0;
		if(p8Str[Offset]!=0x5b)//PROAD
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó p8Str[Offset]=%02x\n",(u32)&__func__,__LINE__,p8Str[Offset]);
			#endif
			goto JSON_ERROR;
		}
		Offset+=2;
		
		ROAD=(p8Str[Offset]<<24)|(p8Str[Offset+1]<<16)|(p8Str[Offset+2]<<8)|p8Str[Offset+3];
		//myprintf("[%s:%d]:ROAD=%08x\n",(u32)&__func__,__LINE__,ROAD);
		Offset+=4;
		OADNUM=p8Str[Offset];//OADµÄÊıÁ¿
		Offset++;
		OADPORT=Offset;//OADÆğÊ¼Î»ÖÃ
		Offset+=OADNUM*4;
		p8s=p8Str+Offset;
		//ÕÒ¶³½áÊ±±êµÄÎ»ÖÃ
		for(y=0;y<OADNUM;y++)
		{
			p8s=p8Str+Offset;
			p8s=Get_Element(p8s,y+1,0,0);//¼ÆËãÔªËØµØÖ·(ĞéÄâµØÖ·Ö¸Õë),Ê¹ÓÃADDR_128KDATABUFF;³ö¿Ú:µØÖ·Ö¸ÏòÔªËØµÄÀàĞÍ×Ö½Ú,0=´íÎó
			if(!p8s)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
				#endif
				goto JSON_ERROR;
			}
			OAD=(p8Str[OADPORT+y*4]<<24)|(p8Str[OADPORT+1+y*4]<<16)|(p8Str[OADPORT+2+y*4]<<8)|(p8Str[OADPORT+3+y*4]);
			if(0x20210200==OAD)//¶³½áÊ±±ê
			{
				p8s+=8;//Ò»¸ö±êÊ¶7¸öÊı¾İ
				continue;
			}
			if(1==p8s[0])//Êı×é
			{
				DataNUM=p8s[1];
				if(0==p8s[1])
				{
					DataNUM=1;
				}
			}else
			{
				DataNUM=1;
			}
			for(z=0;z<DataNUM;z++)
			{
				if(0!=p8s[1])
				{
					pdata=Get_Element(p8s,z+1,0,0);//¼ÆËãÔªËØµØÖ·(ĞéÄâµØÖ·Ö¸Õë),Ê¹ÓÃADDR_128KDATABUFF;³ö¿Ú:µØÖ·Ö¸ÏòÔªËØµÄÀàĞÍ×Ö½Ú,0=´íÎó
					if(!pdata)
					{
						#ifdef DEBUG_JSON
						myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
						#endif
						goto JSON_ERROR;
					}
				}
				i=CreateArrayHead_Json(pout+CJSONLEN, DEBUG_SECOND_SPACENUM);
				CJSONLEN+=i;
				i=ROAD>>16;
				Add_StrToASCII_Inverte(p8,(u8 *)&(i),2);//pbufÀïÃæµÄ×Ö½Úµ¹ĞòÊä³öµ½pstr²¢×ª³ÉascÂë
				i=Createitem_Json(pout+CJSONLEN, STR_TYPE, p8, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				
				i=OAD+z+1;
				Add_StrToASCII_Inverte(p8,(u8 *)&i,4);//pbufÀïÃæµÄ×Ö½Úµ¹ĞòÊä³öµ½pstr²¢×ª³ÉascÂë(p8, p8+4,4);
				i=Createitem_Json(pout+CJSONLEN, STR_ITEMID, p8, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				
				Get698Time_Ascii(pInbuf+7,p8);
				GetJsonTime(p8);
				i=Createitem_Json(pout+CJSONLEN, STR_OT, p8, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				
				Get698Time_Ascii(pInbuf+14,p8);
				GetJsonTime(p8);
				i=Createitem_Json(pout+CJSONLEN, STR_DT, p8, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				
				i=Data_Ascii(1,p8,0);//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı
				i=CreateitemNum_Json(pout+CJSONLEN, STR_INTY, p8, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				
				i=Data_Ascii(1,p8,0);//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı
				i=CreateitemNum_Json(pout+CJSONLEN, STR_NUM, p8, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				
