gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
				i=CreateitemArrayHead_Json(pout+CJSONLEN, STR_DL, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				if(0==p8s[1])
				{//È«²¿Ğ´NULL
					if(((OAD>>28)&0xf) == 1)//ĞèÁ¿
					{	
						i=CreateArrayHead_Json(pout+CJSONLEN, DEBUG_THIRD_SPACENUM);
						CJSONLEN+=i;
						i=0;
						i=DealMetData_Ascii(OAD>>16,(u8 *)&i,p8,0);//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii
						if(0==i)
						{
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
							#endif
							goto JSON_ERROR;
						}
						i=CreateitemNum_Json(pout+CJSONLEN, STR_MV, p8, DEBUG_THIRD_SPACENUM);
						CJSONLEN+=i;
						
						GetNullTime(p8);
						i=Createitem_Json(pout+CJSONLEN, STR_MDT,p8,DEBUG_THIRD_SPACENUM);
						CJSONLEN+=i;	
						i=CreateArrayEnd_Json(pout, CJSONLEN,DEBUG_THIRD_SPACENUM);
						CJSONLEN+=i;
					}else
					{	
						i=0;
						i=DealMetData_Ascii(OAD>>16,(u8 *)&i,p8,0);//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii
						if(0==i)
						{
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
							#endif
							goto JSON_ERROR;
						}
						i=CreateData_Json(pout+CJSONLEN, p8);
						CJSONLEN+=i;

					}
				}else
				{
					if(((OAD>>28)&0xf) == 1)//ĞèÁ¿
					{	
						i=CreateArrayHead_Json(pout+CJSONLEN, DEBUG_THIRD_SPACENUM);
						CJSONLEN+=i;
		
						if(pdata[0]==0x02)
						{		
							pdata+=2;
							//´¦ÀíĞèÁ¿µÄÊı¾İ
							i=DealMetData_Ascii(OAD>>16,pdata,p8,0);//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii
							if(0==i)
							{
								#ifdef DEBUG_JSON
								myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
								#endif
								goto JSON_ERROR;
							}
							i=CreateitemNum_Json(pout+CJSONLEN, STR_MV, p8, DEBUG_THIRD_SPACENUM);
							CJSONLEN+=i;
							//´¦ÀíĞèÁ¿µÄ×î´ó·¢ÉúÊ±¼ä
							i=Get_DL698DataLen_S(pdata,0);
							pdata+=i;
							if(pdata[0]==0x1c)//ĞèÁ¿µÄÊ±¼ä
							{
								pdata++;
								Get698Time_Ascii(pdata,p8);
								GetJsonTime(p8);
							}else
							{
								GetNullTime(p8);
							}
							i=Createitem_Json(pout+CJSONLEN, STR_MDT,p8,DEBUG_THIRD_SPACENUM);
							CJSONLEN+=i;
						}
						
						i=CreateArrayEnd_Json(pout, CJSONLEN,DEBUG_THIRD_SPACENUM);
						CJSONLEN+=i;
					}else
					{	
						i=DealMetData_Ascii(OAD>>16,pdata,p8,0);//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii
						if(0==i)
						{
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
							#endif
							goto JSON_ERROR;
						}

						i=CreateData_Json(pout+CJSONLEN, p8);
						CJSONLEN+=i;

					}	
				}
				i=CreateitemArrayEnd_Json(pout, CJSONLEN, DEBUG_THIRD_SPACENUM);
				CJSONLEN+=i;
				i=CreateArrayEnd_Json( pout, CJSONLEN, DEBUG_SECOND_SPACENUM);
				CJSONLEN+=i;
			}
		}
	}
	i=Get_OneFreDataLen_FromFlash(pInbuf);
	pInbuf+=i;
}
	return CJSONLEN;
JSON_ERROR:
	return 0;
}

void Add_NewOADToBuff(u8 *pOAD,u8 *pBuff,u8 OADNUM)//pBuffÖĞµÄOADÌí¼Óµ½pPADÖĞ ÊıÁ¿ÎªOADNUM
{
	u8 x;	
	pOAD[0]=OADNUM;
	pOAD++;
	for(x=0;x<OADNUM;x++)
	{
		MW((u32)pBuff+x*4,(u32)pOAD+x*4,4);
	}
}

u32 IsFindOneOADFromBuff(u8 *pOAD,u8 *pBuff)//´Ó´¢´æºÃµÄPOAD bufÖĞÕÒPBUFF¶ÔÓ¦OAD,Èç¹ûÕÒµ½¾ÍËµÃ÷ÔÚpOADÖĞ´æÔÚpBuffÕâ¸öOAD
{

	u8 x;
	u8 NUM;
	u32 OAD;
	u32 OAD1;
	u32 ret=1;
	NUM=pOAD[0];
	pOAD++;

	OAD1=(pBuff[0]<<24)|(pBuff[1]<<16)|(pBuff[2]<<8)|pBuff[3];
	if(0x20210200==OAD1)
	{
		return 0;
	}
	for(x=0;x<NUM;x++)
	{
		OAD=(pOAD[x*4]<<24)|(pOAD[x*4+1]<<16)|(pOAD[x*4+2]<<8)|pOAD[x*4+3];	
		if(OAD==OAD1)
		{
			break;
		}
	}
	if(x>=NUM)
	{
		ret=0;
	}	
	return ret;
}

u8 *Find_DataHead(u8 *pIn,u8 *pOAD,u32 oadcnt)//¸ù¾İFlashÀïÃæµÄ´æ´¢¸ñÊ½ÓÃpInÀïÃæOADµÄÎ»ÖÃÈ¥ÕÒpInÀïÃæÊı¾İµÄÎ»ÖÃ,pOADµÚÒ»×Ö½ÚÊÇOADÊıÁ¿,oadcntÊÇpOADÀïÃæµÄÆ«ÒÆ,·µ»ØPinÀïÃæÊı¾İµÄÕıÈ·Î»ÖÃ
{
	u8 OADNUM;
	u32 i;
	u32 y;
	u32 Offset;
	pIn+=21;
	Offset=0;
	Offset+=4;
	Offset+=4;

	OADNUM=pIn[Offset];
	Offset++;
	Offset+=(OADNUM*4);
	
	if(oadcnt>OADNUM-1)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:ËÑË÷³öÀ´µÄOADÏÂ±ê´óÓÚÊµ¼ÊµÄOAD×ÜÊı\n",(u32)&__func__,__LINE__,0);
		#endif
		return 0;
	}
	pIn+=Offset;
	Offset=0;
	for(i=0;i<=oadcnt;i++)
	{
		if(i==oadcnt)
		{			
			return pIn+Offset;
		}
		y=Get_DL698DataLen_S(pIn+Offset,0);//Ëã³öµÚÒ»¸öÊı¾İµÄ³¤¶È
		Offset+=y;
	}
	return 0;
}

u32 JudegMin_FromTime(u8 *pch,u32 cnt,u32 Min)//´ÓflashÀïÃæµÄÊ±¼äÈ¥ÅĞ¶ÏÕâ¸öÊ±¼äµãµÄ·ÖÖÓ´æ²»´æÔÚ(ÈçÓĞ1440·ÖÖÓ´Ó0·ÖÖÓ¿ªÊ¼ÅĞ¶Ï)
{
	u8 hh;
	u8 mm;
	u32 i;
	pch+=14;
	//²É¼¯´æ´¢Ê±±ê
	//07 00 01 02 00 00 00
	pch+=4;
	hh=pch[0];
	mm=pch[1];
	i=hh*60+mm;
	
	if(i==(cnt*Min))
	{
		return 1;
	}
	return 0;
}

u32 Is_SingleOADNUM_FromData(u8 *pOAD,u8 *pData,u32 OADNUM)//±ÈÈçËµÕâ¸öOADÊÇ00100200 ËûÒ»¹²ÓĞ5Ïî ×Ü¼â·åÆ½¹È
{
	u32 i;
	u32 n;
	u32 Len;
	u32 OAD;
	OAD=(pOAD[0]<<24)|(pOAD[1]<<16)|(pOAD[2]<<8)|pOAD[3];

	if((OAD&0xff)==0)
	{
		Len=0;
		for(i=0;i<OADNUM;i++)
		{
			n=Get_DL698DataLen_S(pData+Len,0);//Ëã³öµÚÒ»¸öÊı¾İµÄ³¤¶È
			Len+=n;
		}
		if(1==pData[Len])//ÊÇ¸öÊı×é£¨Ò»°ã¶¼ÊÇÊı×é£©
		{
			i=pData[Len+1];
			if(i>1)
			{
				return i;
			}else
			{
				return 0;
			}
		}
	}
	return 0;
}

u32 Min_PackJson(u8 *pInbuf,u8 *pout,u32 Min)//·ÖÖÓ¶³½áÊı¾İµÄ´ò°üMiNÇø·ÖÊÇ15·ÖÖÓ»¹ÊÇ1·ÖÖÓ
{
	u32 i;
	u32 x;
	u32 y;
	u32 z;	
	u32 CJSONLEN;
	u8 *p8;
	u8 *pOAD;
	u8 *pbuf=pInbuf;
	u8 *pdata;//Ö¸ÏòÊı¾İÇøµÄÖ¸Õë

	u32 Offset;
	u32 TotalNUM;
	u32 OAD;
	u32 ROAD;		//¼ÇÂ¼±¨ÎÄÖĞROAD
	u32 TIMESPOT;	//Ê±¼ä±êÇ©µÄÎ»ÖÃ
	u8 OADNUM;		//¼ÇÂ¼±¨ÎÄÖĞROADÊıÁ¿
	u8 OADNUM_S;
	u32 OADSPOT; 	//¼ÇÂ¼±¨ÎÄÖĞROADÊıÁ¿µÄÎ»ÖÃ//20210200
	u32 Fre_Dst;	//Êı¾İ¶³½áÃÜ¶È
	u16 *p16;
	CJSONLEN=0;
	p16=(u16 *)pbuf;
	TotalNUM=p16[0];
	if(0==TotalNUM)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:Ã»ÓĞÊı¾İÄÚÈİ %d\n", (u32)&__func__, __LINE__, TotalNUM);
		#endif
		return 0;
	}
	pbuf+=2;//Êı¾İ×ÜÊı³¤¶È
	for(TIMESPOT=0;TIMESPOT<1440;TIMESPOT++)
	{
		x=mymemcmp(pbuf+TIMESPOT*ONEDATASIZE, 0, 2);
		if(x)
		{
			break;
		}
	}
	if(TIMESPOT>=1440)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:Ã»ÓĞÊı¾İÄÚÈİ %d\n", (u32)&__func__, __LINE__, TotalNUM);
		#endif
		return 0;
	}
	Offset=TIMESPOT*ONEDATASIZE;//ÏÈÕÒµ½Ò»¸öÓĞĞ§,ÄÃÕâÒ»¸öÓĞĞ§µÄÍ·¸ãÊÂÇé
	p8=(u8 *)ADDR_DATABUFF;
	
