gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
	pOAD=(u8 *)ADDR_DATABUFF+1024;
	MC(0,(u32)ADDR_DATABUFF+1024,1024);

	Offset+=21;

	Offset+=4;
	ROAD=(pbuf[Offset]<<24)|(pbuf[Offset+1]<<16)|(pbuf[Offset+2]<<8)|pbuf[Offset+3];
	if(ROAD!=0x50020200)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:²»ÊÇ·ÖÖÓ¶³½áÊı¾İ\n", (u32)&__func__, __LINE__, 0);
		#endif
		goto Min_JSON_ERROR;
	}
	Offset+=4;
	OADNUM=pbuf[Offset];
	Offset++;	
	Add_NewOADToBuff(pOAD,pbuf+Offset,OADNUM);//pBuffÖĞµÄOADÌí¼Óµ½pPADÖĞ ÊıÁ¿ÎªOADNUM
	OADSPOT=Offset;
	Offset+=(OADNUM*4);	
	for(y=0;y<OADNUM;y++)
	{
		if(!IsFindOneOADFromBuff(pOAD,pbuf+OADSPOT+y*4))//´Ó´¢´æºÃµÄPOAD bufÖĞÕÒPBUFF¶ÔÓ¦OAD,Èç¹ûÕÒµ½¾ÍËµÃ÷ÔÚpOADÖĞ´æÔÚpBuffÕâ¸öOAD
		{	
			continue;
		}
		
		i=Is_SingleOADNUM_FromData(pbuf+OADSPOT+y*4,pbuf+Offset,y);
		if(0==i)
		{
			i=CreateArrayHead_Json(pout+CJSONLEN, DEBUG_SECOND_SPACENUM);
			CJSONLEN+=i;
			i=ROAD>>16;
			Add_StrToASCII_Inverte(p8,(u8 *)&(i),2);//pbufÀïÃæµÄ×Ö½Úµ¹ĞòÊä³öµ½pstr²¢×ª³ÉascÂë
			i=Createitem_Json(pout+CJSONLEN, STR_TYPE, p8, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			OAD=(pbuf[OADSPOT+y*4]<<24)|(pbuf[OADSPOT+y*4+1]<<16)|(pbuf[OADSPOT+y*4+2]<<8)|(pbuf[OADSPOT+y*4+3]<<0);
			Add_StrToASCII_Inverte(p8,(u8 *)&OAD,4);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
			i=Createitem_Json(pout+CJSONLEN, STR_ITEMID, p8, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			Get698Time_Ascii(pbuf+TIMESPOT*ONEDATASIZE+7,p8);//pÊ±¼äÇ°Á½¸ö×Ö½Ú±íÊ¾Äê·İp8Êä³öascÂë
			//Get698Time_HMS_Ascii(p8,0,0,0);
			//p8[3]-=1;
			GetJsonTime(p8);
			i=Createitem_Json(pout+CJSONLEN, STR_OT, p8, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			switch(Min)
			{
				case 1:
					Get698Time_HMS_Ascii(pbuf+TIMESPOT*ONEDATASIZE+14,p8,23,59,0);
					//cJSON_AddStringToObject(obj,"dt",(char*)p8);//²É¼¯´æ´¢Ê±±ê(Êı¾İÊ±±ê)
					break;
				case 15:
					Get698Time_HMS_Ascii(pbuf+TIMESPOT*ONEDATASIZE+14,p8,23,45,0);
					//cJSON_AddStringToObject(obj,"dt",(char*)p8);//²É¼¯´æ´¢Ê±±ê(Êı¾İÊ±±ê)
					break;
			}
			GetJsonTime(p8);
			i=Createitem_Json(pout+CJSONLEN, STR_DT, p8, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			i=Data_Ascii((u64)Min,p8,0);//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı
			i=CreateitemNum_Json(pout+CJSONLEN, STR_INTY, p8, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			Fre_Dst=(24*60)/Min;
			i=Data_Ascii((u64)Fre_Dst,p8,0);//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı
			i=CreateitemNum_Json(pout+CJSONLEN, STR_NUM, p8, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			i=CreateitemArrayHead_Json(pout+CJSONLEN, STR_DL, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			//ÅĞ¶Ï·ÖÖÓµãÊı¾İ´æ²»´æÔÚ		

			for(z=0;z<Fre_Dst;z++)
			{	
				x=mymemcmp(pbuf+z*ONEDATASIZE*Min, 0, 2);
				if(x)
				{
					pdata=Find_DataHead(pbuf+z*ONEDATASIZE*Min,pOAD,y);//¸ù¾İFlashÀïÃæµÄ´æ´¢¸ñÊ½ÓÃpInÀïÃæOADµÄÎ»ÖÃÈ¥ÕÒpInÀïÃæÊı¾İµÄÎ»ÖÃ,pOADµÚÒ»×Ö½ÚÊÇOADÊıÁ¿,oadcntÊÇpOADÀïÃæµÄÆ«ÒÆ,·µ»ØPinÀïÃæÊı¾İµÄÕıÈ·Î»ÖÃ
					if(pdata)
					{	
						i=DealMetData_Ascii(OAD>>16,pdata,p8,0);//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii
						if(0==i)
						{
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
							#endif
							goto Min_JSON_ERROR;
						}
						i=CreateData_Json(pout+CJSONLEN, p8);
						CJSONLEN+=i;
					}else
					{
						WriteNullString(p8);//Êı¾İBUFÀïÃæĞ´ASC µÄNULL
						i=CreateData_Json(pout+CJSONLEN, p8);
						CJSONLEN+=i;
					}
				}else
				{
					WriteNullString(p8);//Êı¾İBUFÀïÃæĞ´ASC µÄNULL
					i=CreateData_Json(pout+CJSONLEN, p8);
					CJSONLEN+=i;
				}
			}

			i=CreateitemArrayEnd_Json(pout, CJSONLEN, DEBUG_THIRD_SPACENUM);
			CJSONLEN+=i;
			
			i=CreateArrayEnd_Json(pout,CJSONLEN, DEBUG_SECOND_SPACENUM);
			CJSONLEN+=i;
		}
		else//´¦Àí½»²ÉµÄOAD,ÓĞOADºÏ²¢µÄÏî
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:½»²É15·ÖÖÓÊı¾İ´¦Àí\n",(u32)&__func__,__LINE__,0);
			#endif
				OADNUM_S=i;//Êı×éµÄ¸öÊı¾ÍÊÇOADµÄ·ÖÁ¿µÄ¸öÊı
				OAD=(pbuf[OADSPOT+y*4]<<24)|(pbuf[OADSPOT+y*4+1]<<16)|(pbuf[OADSPOT+y*4+2]<<8)|(pbuf[OADSPOT+y*4+3]);
				for(x=1;x<=OADNUM_S;x++)//Ñ­»·¼ÇÂ¼Ã¿Ò»¸öOADÓĞ¶àÉÙ¸ö×ÓOAD
				{
					i=CreateArrayHead_Json(pout+CJSONLEN, DEBUG_SECOND_SPACENUM);
					CJSONLEN+=i;
					i=ROAD>>16;
					Add_StrToASCII_Inverte(p8,(u8 *)&(i),2);//pbufÀïÃæµÄ×Ö½Úµ¹ĞòÊä³öµ½pstr²¢×ª³ÉascÂë
					i=Createitem_Json(pout+CJSONLEN, STR_TYPE, p8, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;
					
					OAD&=0xffffff00;
					OAD|=x;
					Add_StrToASCII_Inverte(p8,(u8 *)&OAD,4);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
					i=Createitem_Json(pout+CJSONLEN, STR_ITEMID, p8, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;
					
					Get698Time_Ascii(pbuf+TIMESPOT*ONEDATASIZE+7,p8);//pÊ±¼äÇ°Á½¸ö×Ö½Ú±íÊ¾Äê·İp8Êä³öascÂë
					//Get698Time_HMS_Ascii(p8,0,0,0);
					//p8[3]-=1;
					GetJsonTime(p8);
					i=Createitem_Json(pout+CJSONLEN, STR_OT, p8, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;
					
					switch(Min)
					{
						case 1:
							Get698Time_HMS_Ascii(pbuf+TIMESPOT*ONEDATASIZE+14,p8,23,59,0);
							//cJSON_AddStringToObject(obj,"dt",(char*)p8);//²É¼¯´æ´¢Ê±±ê(Êı¾İÊ±±ê)
							break;
						case 15:
							Get698Time_HMS_Ascii(pbuf+TIMESPOT*ONEDATASIZE+14,p8,23,45,0);
							//cJSON_AddStringToObject(obj,"dt",(char*)p8);//²É¼¯´æ´¢Ê±±ê(Êı¾İÊ±±ê)
							break;
					}
					GetJsonTime(p8);
					i=Createitem_Json(pout+CJSONLEN, STR_DT, p8, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;
					
					i=Data_Ascii((u64)Min,p8,0);//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı
					i=CreateitemNum_Json(pout+CJSONLEN, STR_INTY, p8, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;
					
					Fre_Dst=(24*60)/Min;
					i=Data_Ascii((u64)Fre_Dst,p8,0);//½«idaÖµ´æµ½pÖĞ,NUMÎªĞ¡ÊıµãµÄÎ»Êı
					i=CreateitemNum_Json(pout+CJSONLEN, STR_NUM, p8, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;
					
					i=CreateitemArrayHead_Json(pout+CJSONLEN, STR_DL, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;

					//ÅĞ¶Ï·ÖÖÓµãÊı¾İ´æ²»´æÔÚ	
					for(z=0;z<Fre_Dst;z++)
					{
						i=mymemcmp(pbuf+z*ONEDATASIZE*Min, 0, 2);
						if(i)
						{
							pdata=Find_DataHead(pbuf+z*ONEDATASIZE*Min,pOAD,y);//¸ù¾İFlashÀïÃæµÄ´æ´¢¸ñÊ½ÓÃpInÀïÃæOADµÄÎ»ÖÃÈ¥ÕÒpInÀïÃæÊı¾İµÄÎ»ÖÃ,pOADµÚÒ»×Ö½ÚÊÇOADÊıÁ¿,oadcntÊÇpOADÀïÃæµÄÆ«ÒÆ,·µ»ØPinÀïÃæÊı¾İµÄÕıÈ·Î»ÖÃ
							pdata=Get_Element(pdata,x,0,0);//¼ÆËãÔªËØµØÖ·(ĞéÄâµØÖ·Ö¸Õë),Ê¹ÓÃADDR_128KDATABUFF;³ö¿Ú:µØÖ·Ö¸ÏòÔªËØµÄÀàĞÍ×Ö½Ú,0=´íÎó
							if(pdata)
							{	
								i=DealMetData_Ascii(OAD>>16,pdata,p8,0);//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii
								if(0==i)
								{
									#ifdef DEBUG_JSON
									myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
									#endif
									goto Min_JSON_ERROR;
								}
								i=CreateData_Json(pout+CJSONLEN, p8);
								CJSONLEN+=i;
							}else
							{
								WriteNullString(p8);//Êı¾İBUFÀïÃæĞ´ASC µÄNULL
								i=CreateData_Json(pout+CJSONLEN, p8);
								CJSONLEN+=i;
							}
						}else
						{
							WriteNullString(p8);//Êı¾İBUFÀïÃæĞ´ASC µÄNULL
							i=CreateData_Json(pout+CJSONLEN, p8);
							CJSONLEN+=i;
						}
					}

					i=CreateitemArrayEnd_Json(pout, CJSONLEN, DEBUG_THIRD_SPACENUM);
					CJSONLEN+=i;
					
					i=CreateArrayEnd_Json(pout,CJSONLEN, DEBUG_SECOND_SPACENUM);
					CJSONLEN+=i;
				}
			}
	}
	
	return CJSONLEN;
Min_JSON_ERROR:
	return 0;
}

u32 RCSDtoFileID_JS(u16 *pAddr,u32 ROAD,u32 Min)//¼ÇÂ¼ÁĞÑ¡ÔñRCSDÏà¶ÔÓ¦µÄFileID,Èë¿Ú:pRCSDÖ¸ÏòÀàĞÍ×Ö½Ú;·µ»Ø:0±íÊ¾Ã»ÕÒµ½ÎŞĞ§FileID,µ±ÓĞ2¸öÉÏÏàÍ¬·½°¸Ê±TaskNO=0xff£¬MIN£¬1·ÖÖÓ»¹ÊÇ15·ÖÖÓ×öÇø·Ö
{	
	if(0==ROAD)
	{	
		if(Min==15)
		{
			return 0x13f12000;
		}
		if(Min==1)
		{
			return 0x13f17000;
		}
	}else
	{
		switch(ROAD)
		{
			case 0x50040200:
				return 0x13f16000;
			case 0x50020200:
				if(Min==15)
				{
					return 0x13f19000;
				}
				if(Min==1)
				{
					return 0x13f22000;
				}
			case 0x50060200:
				return 0x13f18000;
		}
	}				
	return 0;//·µ»Ø:0±íÊ¾Ã»ÕÒµ½ÎŞĞ§FileID
}

u32 Filter_Time(u8 *pfiletm,u32 ROAD,u32 isReal,u32 All)//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
{
	u32 i;
	u32 x;
	u32 ret=0;
	switch (ROAD)
	{
		case 0x50020200://·ÖÖÓ¶³½á
			//±È½ÏÊ±±êÊÇÉÏÒ»ÌìµÄ
			i=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<24)|(JSON->Lastrealtime[2]<<8)|(JSON->Lastrealtime[3]);
			i=YYMD_Sub1D_hex(i);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			x=(pfiletm[0]<<16)|(pfiletm[1]<<24)|(pfiletm[2]<<8)|(pfiletm[3]);
			if(i==x)
			{
				ret=1;
			}		
		  	break;
		case 0x50040200://ÈÕ¶³½á
			i=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<24)|(JSON->Lastrealtime[2]<<8)|(JSON->Lastrealtime[3]);
			i=YYMD_Sub1D_hex(i);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			x=(pfiletm[0]<<16)|(pfiletm[1]<<24)|(pfiletm[2]<<8)|(pfiletm[3]);
			if(i==x)
			{
				ret=1;
			}
			break;
		case 0x50060200://ÔÂ¶³½á
			//±È½ÏÊ±±êÊÇÉÏÒ»ÌìµÄ
			i=(JSON->Lastrealtime[0]<<8)|(JSON->Lastrealtime[1]<<16)|JSON->Lastrealtime[2];
			i=YYM_SubM_hex(i, 1);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			x=(pfiletm[0]<<8)|(pfiletm[1]<<16)|pfiletm[2];
			if(i==x)
			{
				if(JSON->Lastrealtime[3]==1)//Ã¿¸öÔÂµÄÒ»ºÅ²Å»ØÈ¥´ò°üÔÂ¶³½á
				{
					ret=1;
				}
			}			
			break;
		default://ÊµÊ±Êı¾İ
		break;
	}
	return ret;
}

u32 Min_FrzNUM(u8 *pIn)//·µ»Ø°ÑĞ¡Ê±·ÖÖÓ,×ª»»³É·ÖÖÓÊı
{
	u8 hh;
	u8 mm;
	u32 i;
	pIn+=14;
	pIn+=4;
	hh=pIn[0];
	mm=pIn[1];
	i=60*hh+mm;
	return i;
}

u32 Filter_Same_Data(u8 *pt,u32 datanum,u8 *pdata)//ÓÃ²É¼¯´æ´¢Ê±±êÈ¥ÅĞ¶ÏÊÇ²»ÊÇÖØ¸´µÄÊı¾İ,·µ»Ø1ÊÇÖØ¸´µÄÊı¾İ,·µ»Ø0²»ÊÇÖØ¸´µÄÊı¾İ
{
	u32 i;
	u32 x;
	if(0==datanum)//Ò»¸öÊı¾İ¶¼Ã»ÓĞµÄÊ±ºòÄ¬ÈÏÃ»ÓĞÖØ¸´µÄÊı¾İ
	{
		return 0;
	}
	pdata+=14;//Ö¸Ïò²É¼¯´æ´¢Ê±±ê
	for(i=0;i<datanum;i++)
	{
		//É¾Ñ¡µ½·ÖÖÓ
		for(x=0;x<6;x++)
		{
			if(pt[x]!=pdata[x])
			{
				break;
			}
		}
		if(x>=6)
		{
			return 1;
		}
		pt+=7;
	}
	return 0;
}

u32 Is_1MinData(u8 *pdata,u8 ACSAMPLE_FLAG)//ÅĞ¶ÏÕâ°üÊı¾İÊÇ²»ÊÇ1·ÖÖÓÊı¾İ,1ÊÇ.0²»ÊÇ,ACSAMPLE_FLAG½»²ÉÃ»ÓĞ1·ÖÖÓÊı¾İ
{
	u32 i;
	u32 OAD;
	u32 OADnum;
	if(ACSAMPLE_FLAG!=0)
	{
		return 0;
	}
	pdata+=21;
	pdata+=4;
	pdata+=4;
	OADnum=*pdata;
	pdata++;
	
	for(i=0;i<OADnum;i++)
	{
		OAD=(pdata[0]<<24)|(pdata[1]<<16)|(pdata[2]<<8)|(pdata[3]);
		if((OAD>>8)==0x200002)
		{
			return 1;
		}
		pdata+=4;
	}
	return 0;
}

