gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
u32 Filter_Realtime(u8 *ptime)//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
{
	u32 ret=0;
	u32 i;
	i=Compare_DL698DataString(JSON->Lastrealtime,ptime,6);//Êı¾İ´®±È½Ï(¸ßÎ»ÔÚµÍ×Ö½Ú),p1ºÍp2ÒÑÔÚRAMÖĞ,·µ»Ø:0=ÏàÍ¬,1=²»ÏàÍ¬p1>p2,2=²»ÏàÍ¬p1<p2
	if(i==1)
	{
		ret=1;
	}	
	return ret;
}

u32 Is_ACSAMPLE(u16 *pAddr)
{
	u8 *p8;
	u8 *p8s;
	//u16 *p16;
	u16 *p16s;
	u32 i;
	p8=(u8*)ADDR_6000_SDRAM;
	for(i=0;i<NUMmax_6000;i++)
	{
		if(p8[0]==DataType_structure)
		{
			p8s=Get_Element(p8,2,4,0);//¼ÆËãÔªËØµØÖ·(ĞéÄâµØÖ·Ö¸Õë),Ê¹ÓÃADDR_128KDATABUFF;³ö¿Ú:µØÖ·Ö¸ÏòÔªËØµÄÀàĞÍ×Ö½Ú,0=´íÎó
			if(0x08!=p8s[2])//½»²É
			{
				p8+=LENper_6000;
				continue;
			}
			p16s=(u16*)(p8+10);//È¡²É¼¯µµ°¸ÅäÖÃĞòºÅµÄÍ¨ĞÅµØÖ·
			if(pAddr[0]==p16s[0])
			{
				if(pAddr[1]==p16s[1])
				{
					if(pAddr[2]==p16s[2])
					{
						return 0;
					}
				}
			}
					
		}
		p8+=LENper_6000;
	}
	#ifdef DEBUG_JSON
	myprintf("%04x %04x \n",pAddr[0],p16s[0],0);
	myprintf("%04x %04x \n",pAddr[1],p16s[1],0);
	myprintf("%04x %04x \n",pAddr[2],p16s[2],0);
	#endif
	return 1;
}

u32 Get_RecordData(u32 ROAD,u32 FileID,u16 *pAddr,u8 *pstack,u32 *DataLen,u32 isReal,u32 All)//ÓÃFlashÖĞ»ñÈ¡Êı¾İ,·µ»ØÒ»¸öÊı¾İÖ¸Õë,¸ÃÖ¸ÕëĞèÒªFreeÊÍ·Å
{
	//u32 iii;
	u32 z;
	u8 *p8;
	u8 *p8time;
	u32 MetNUM;
	u32 i;
	u32 n;
	u32 offset;
	u32 DataNUM;
	u32 filename;
	u8 ACSAMPLE_FLAG;
	msFILE_TypeDef *file;
	ms_Type *ms;
	RecordFileHead_TypeDef* RecordFileHead;//³­±í¼ÇÂ¼ÎÄ¼şÍ·ÎÄ¼ş
	ms=(ms_Type *)Get_ms();
	WWDT_Enable_Feed(WDTTimerOutVal);//ÔÊĞí¿´ÃÅ¹·ºÍÎ¹¹·
	
	DataNUM=0;
	*DataLen=0;
	Comm_Ram->msFILESearchCount=0;	
	
	ACSAMPLE_FLAG=0;
	if(ROAD==0x50020200&&FileID==0x13f19000)//ÅĞ¶ÏÊÇ²»ÊÇ½»²Éµµ°¸,15·ÖÖÓÇúÏß
	{
		//ÊÇ²»ÊÇ½»²Éµµ°¸
		i=Is_ACSAMPLE(pAddr);
		if(i==0)
		{
			ACSAMPLE_FLAG=1;
		}
	}
	while(Comm_Ram->msFILESearchCount<(recordFILENAMEmax_FLASH))
	{		
		filename=Get_RecordFileName_JS(FileID,0xffffffff,0);//ËÑË÷ÎÄ¼şÃû:Èë¿Ú:FileID=b31-b28·½°¸ÀàĞÍ,b27-b24²É¼¯ÀàĞÍ,b23-b20´æ´¢Ê±±êÀàĞÍ,b19-b12ÈÎÎñºÅ,b11-b8¶Ë¿ÚºÅ,b7-b0,ÏàÓ¦ÓòÖµÎª0xF±íÊ¾²»¹Ø×¢,pTimeÊı¾İ´æ´¢Ê±±ê=0±íÊ¾²»¹Ø×¢;SearchCount=¿ªÊ¼ËÑË÷µÄÎÄ¼şºÅ0xFFFF±íÊ¾´ÓÉÏ´Î½áÊøºÅ¿ªÊ¼ËÑË÷;·µ»Ø:0--(FILENAMEmax_FLASH-1)±íÊ¾ÎÄ¼şÔÚFLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)±íÊ¾ÎÄ¼şÔÚRAM,0xffffffff±íÊ¾Ã»ÕÒµ½
		if(filename==0xffffffff)
		{
			continue;
		}
		//Ö»ÔÚFlashÎÄ¼şÀïÃæ²éÕÒ RAMÎÄ¼şÀïÃæÃ»ÓĞÊı¾İ
		if(filename<FILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
		}
		else
		{
			continue;
		}
		if(file->BLOCK_ENTRY==0)
		{
			continue;
		}
		if(0==ROAD)//ÊµÊ±ÔöÁ¿ÓÃ²É¼¯Æô¶¯Ê±±êÀ´ÅĞ¶Ï
		{
			i=Filter_Realtime(file->save_date_time_s);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
		}else
		{	
			i=Filter_Time(file->save_date_time_s,ROAD,isReal,All);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
		}
		if(0==i)
		{
			continue;
		}
		if(0==ROAD)//ÀïÃæ¿ÉÄÜÓĞÖØ¸´µÄµØÖ·µ«ÊÇÊı¾İÄÚÈİ²»Í¬Ò²ÒªÈ¡³öÀ´
		{
			p8time=(u8 *)ms->ms_malloc(7*1440);
			if(!p8time)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:ÉêÇë¿Õ¼äÊ§°Ü\n ",(u32)&__func__,(u32)__LINE__,0);	
				#endif
				return 0;
			}
			n=file->NUM_DATA;
			//myprintf("[%s:%d]:ĞÂÔö±íµÄÊıÁ¿ n=%d\n ",(u32)&__func__,(u32)__LINE__,n);	
			if((n*sizeof(RecordFileHead_TypeDef))>(LEN_128KDATABUFF-2))
			{
				n=0;
			}
			ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF+2,n*sizeof(RecordFileHead_TypeDef));
			offset=0;
			RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF+2);
			for(MetNUM=0;MetNUM<n;MetNUM++)
			{
				if(RecordFileHead->Addr0==pAddr[0])
				{
					if(RecordFileHead->Addr1==pAddr[1])
					{
						if(RecordFileHead->Addr2==pAddr[2])
						{
							i=RecordFileHead->LEN_DATA;
							if(i>(LEN_128KDATABUFF-(2+NUM_RMmax*sizeof(RecordFileHead_TypeDef))))
							{
								#ifdef DEBUG_JSON
								myprintf("[%s:%d]:È¡µ½µÄÄÚÈİ³¤¶È³¬ÏŞ\n ",(u32)&__func__,(u32)__LINE__,0);	
								#endif
								continue;
							}
							ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+offset,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),i);		
							p8=(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef));	
							if(0!=p8[0])//È¡µ½µÄÊı¾İÄÚÈİÓĞ¿ÉÄÜ¶¼ÊÇ0µÄÖ±½Ó¹ıÂËµô,ÎªÁË¼õÉÙÑ­»·´ÎÊı¾Í²éµÚÒ»¸ö×Ö½Ú
							{
								if(!Filter_Same_Data(p8time,DataNUM,p8))//ÓÃ²É¼¯´æ´¢Ê±±êÈ¥ÅĞ¶ÏÊÇ²»ÊÇÖØ¸´µÄÊı¾İ,·µ»Ø1ÊÇÖØ¸´µÄÊı¾İ,·µ»Ø0²»ÊÇÖØ¸´µÄÊı¾İ
								{
									MW((u32)p8,(u32)pstack+(*DataLen),i);
									MW((u32)p8+14,(u32)p8time+(DataNUM*7),7);//±£´æ²É¼¯´æ´¢Ê±±ê·½±ã²éÖØ
									(*DataLen)+=i;
									DataNUM++;//²éµ½Ò»¸öĞÂµÄÊı¾İ×Ô¶¯¼Ó1	
								}
							}	
						}
								
					}
				}
				offset+=RecordFileHead->LEN_DATA;
				RecordFileHead++;
			}
			ms->ms_free(p8time);
			p8time=NULL;
		}else
		{
			n=file->NUM_DATA;
			if((n*sizeof(RecordFileHead_TypeDef))>(LEN_128KDATABUFF-2))
			{
				n=0;
			}
			ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF+2,n*sizeof(RecordFileHead_TypeDef));
			offset=0;
			RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF+2);
			for(i=0;i<n;i++)
			{
				if(RecordFileHead->Addr0==pAddr[0])
				{
					if(RecordFileHead->Addr1==pAddr[1])
					{
						if(RecordFileHead->Addr2==pAddr[2])
						{
							break;
						}
					}
				}
				offset+=RecordFileHead->LEN_DATA;
				RecordFileHead++;
			}
			if(i>=n)
			{//Ã»ÕÒµ½		
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:µØÖ·Ã»ÓĞÕÒµ½\n ",(u32)&__func__,(u32)__LINE__,0);	
				#endif
				continue;
			}
			i=RecordFileHead->LEN_DATA;
			if(i>(LEN_128KDATABUFF-(2+NUM_RMmax*sizeof(RecordFileHead_TypeDef))))
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:È¡µ½µÄÄÚÈİ³¤¶È³¬ÏŞ\n ",(u32)&__func__,(u32)__LINE__,0);	
				#endif
				continue;
			}
			ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+offset,(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef)),i);		
			
			p8=(u8*)ADDR_128KDATABUFF+2+(NUM_RMmax*sizeof(RecordFileHead_TypeDef));	
			
			if(0x50020200==ROAD)//Èç¹ûÊÇ·ÖÖÓ,ÄÇ¾ÍÔÚÖ¡µÄÇ°Ãæ¶à¼ÓÁ½¸ö×Ö½Ú×÷ÎªĞòºÅ
			{
				z=Min_FrzNUM(p8);
				if(i<ONEDATASIZE&&z<1440)
				{
					if(FileID==0x13f22000)
					{
						if(Is_1MinData(p8,ACSAMPLE_FLAG))
						{
							MW((u32)p8,(u32)pstack+z*ONEDATASIZE,i);	
							DataNUM++;//²éµ½Ò»¸öĞÂµÄÊı¾İ×Ô¶¯¼Ó1	
						}
					}else
					{
						if(!Is_1MinData(p8,ACSAMPLE_FLAG))
						{
							MW((u32)p8,(u32)pstack+z*ONEDATASIZE,i);	
							DataNUM++;//²éµ½Ò»¸öĞÂµÄÊı¾İ×Ô¶¯¼Ó1	
						}
					}
					
