gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
				}else
				{
					#ifdef DEBUG_JSON
					myprintf("¶³½áÊı¾İ´ÓFlashÀïÃæ¶ÁµÄÓĞÎÊÌâ,ĞèÒªĞŞ¸Ä i=%d,z=%d\n ",i,z,0);	
					#endif
				}
				
			}else
			{	
				MW((u32)p8,(u32)pstack+(*DataLen),i);
				(*DataLen)+=i;
				DataNUM++;//²éµ½Ò»¸öĞÂµÄÊı¾İ×Ô¶¯¼Ó1	
			}
		}
	}
	return DataNUM;
}

u8 *Get_MetData_ROAD(u16 *pAddr,u32 ROAD,u32 Min,u32 isReal,u32 All)//¸ù¾İROADÀ´È¡FlashÖĞµÄÊı¾İ,pAddr±íµØÖ·,MinÈ¡·ÖÖÓ¶³½áµÄÊ±ºòÓÃ,1±íÊ¾1·ÖÖÓ15±íÊ¾15·ÖÖÓ,·µ»Ø0ÎŞÊı¾İ,·ñÔò·µ»ØÒ»¸öÊı¾İbufÖ¸Õë,isRealÊÇ·ñÊÇÈ«ÍøÊµÊ±
{
	u16 *p16;
	u16 DataNUM;
	u32 Len;
	u32 i;
	u32 x;
	u8 *pstack=NULL;
	u32 FileID;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	
	pstack=(u8 *)ms->ms_malloc(1024*1024);
	if(!pstack)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:ÉêÇë¿Õ¼äÊ§°Ü\n ",(u32)&__func__,(u32)__LINE__,0);	
		#endif
		return 0;
	}
	MC(0,(u32)pstack,1024*1024);
	Len=0;
	DataNUM=0;
	switch(ROAD)
	{
		case 0x50020200:
			FileID=RCSDtoFileID_JS(pAddr,ROAD,Min);//¼ÇÂ¼ÁĞÑ¡ÔñRCSDÏà¶ÔÓ¦µÄFileID,Èë¿Ú:pRCSDÖ¸ÏòÀàĞÍ×Ö½Ú;·µ»Ø:0±íÊ¾Ã»ÕÒµ½ÎŞĞ§FileID,µ±ÓĞ2¸öÉÏÏàÍ¬·½°¸Ê±TaskNO=0xff
			if(0!=FileID)
			{
				x=Get_RecordData(ROAD,FileID,pAddr,pstack+2+Len,&i,isReal,All);
				Len+=i;
				DataNUM+=x;
			}
			break;
		case 0x50040200:
			FileID=RCSDtoFileID_JS(pAddr,ROAD,Min);//¼ÇÂ¼ÁĞÑ¡ÔñRCSDÏà¶ÔÓ¦µÄFileID,Èë¿Ú:pRCSDÖ¸ÏòÀàĞÍ×Ö½Ú;·µ»Ø:0±íÊ¾Ã»ÕÒµ½ÎŞĞ§FileID,µ±ÓĞ2¸öÉÏÏàÍ¬·½°¸Ê±TaskNO=0xff
			if(0!=FileID)
			{
				x=Get_RecordData(ROAD,FileID,pAddr,pstack+2+Len,&i,isReal,All);
				Len+=i;
				DataNUM+=x;
			}
			FileID=0x13f11000;
			x=Get_RecordData(ROAD,FileID,pAddr,pstack+2+Len,&i,isReal,All);
			Len+=i;
			DataNUM+=x;
			break;
		case 0x50060200:
			FileID=RCSDtoFileID_JS(pAddr,ROAD,Min);//¼ÇÂ¼ÁĞÑ¡ÔñRCSDÏà¶ÔÓ¦µÄFileID,Èë¿Ú:pRCSDÖ¸ÏòÀàĞÍ×Ö½Ú;·µ»Ø:0±íÊ¾Ã»ÕÒµ½ÎŞĞ§FileID,µ±ÓĞ2¸öÉÏÏàÍ¬·½°¸Ê±TaskNO=0xff
			if(0!=FileID)
			{
				x=Get_RecordData(ROAD,FileID,pAddr,pstack+2+Len,&i,isReal,All);
				Len+=i;
				DataNUM+=x;
			}
			FileID=0x13f13000;
			x=Get_RecordData(ROAD,FileID,pAddr,pstack+2+Len,&i,isReal,All);
			Len+=i;
			DataNUM+=x;
			break;
		default://ÊµÊ±
			FileID=RCSDtoFileID_JS(pAddr,ROAD,Min);//¼ÇÂ¼ÁĞÑ¡ÔñRCSDÏà¶ÔÓ¦µÄFileID,Èë¿Ú:pRCSDÖ¸ÏòÀàĞÍ×Ö½Ú;·µ»Ø:0±íÊ¾Ã»ÕÒµ½ÎŞĞ§FileID,µ±ÓĞ2¸öÉÏÏàÍ¬·½°¸Ê±TaskNO=0xff
			if(0!=FileID)
			{
				x=Get_RecordData(ROAD,FileID,pAddr,pstack+2+Len,&i,isReal,All);
				Len+=i;
				DataNUM+=x;
			}
		break;
	}
	if(0==DataNUM)
	{
		ms->ms_free(pstack);
		pstack=NULL;
	}else
	{
		p16=(u16 *)pstack;
		p16[0]=DataNUM;	
	}
	return pstack;
}

u32 FreData_PackJson(u32 ROAD,u8 *pInbuf,u8 *pout,u32 Min)//¶³½áÊı¾İ´ò°üÓÃROADÇø·Ö ·ÖÖÓ¶³½áºÍÈÕÔÂ¶³½á
{
	u32 ret=0;
	switch(ROAD)
	{
		case 0x50020200:
			ret=Min_PackJson(pInbuf,pout,Min);
			break;
		case 0x50040200:
		case 0x50060200:
			ret=Day_Month_PackJson(pInbuf,pout);
			break;
		default:
			break;
	}
	return ret;
}

void GetMetAddr(void)//È¡µÃËùÓĞ±íµÄµØÖ·
{
	u8 *p8;
	u16 *p16;
	u16 *p16s;
	u32 i;
	u32 AddrNUM;
//1.È¡µÃ±íµµ°¸µÄËùÓĞÓĞĞ§µØÖ·,¹ıÂË½»²ÉµØÖ·
	AddrNUM=0;
	p16=(u16*)(ADDR_AddrList+2);
	p8=(u8*)ADDR_6000_SDRAM;
	for(i=0;i<NUMmax_6000;i++)
	{
		if(p8[0]==DataType_structure)
		{
			p16s=(u16*)(p8+10);//È¡²É¼¯µµ°¸ÅäÖÃĞòºÅµÄÍ¨ĞÅµØÖ·
			p16[0]=p16s[0];
			p16[1]=p16s[1];
			p16[2]=p16s[2];
			p16+=3;
			AddrNUM+=1;
		}
		p8+=LENper_6000;
	}
	p16=(u16*)(ADDR_AddrList);
	p16[0]=AddrNUM;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:È¡µÃµµ°¸ÖĞËùÓĞµÄ±íµØÖ· ÊıÁ¿:%d\n",(u32)&__func__, __LINE__, AddrNUM);
	#endif
}

u8 *CreateRealJsonFile(void)//´´½¨Ò»¸öĞÂµÄÊµÊ±jsonÏîÄ¿ÎÄ¼ş
{	
	u8 *paddr;
	u8 *p8;
	u32 i;
	u32 Len;
	//´´½¨ÎÄ¼ş¼Ğ
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_REAL);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Get698CurTime_Ascii(p8+Len);//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë		
	Get698Time_Ascii(JSON->Lastrealtime, p8+Len);
	mystrcpy((char *)p8+Len+12, ".json");	
	i=mystrlen((const char *)p8);
	if(sizeof(JSON->RealFileName)>=i+1)
	{
		mystrncpy((char *)JSON->RealFileName,(const char *)p8,i);
	}else
	{
		#ifdef DEBUG_JSON
		myprintf("\n[%s:%d]:JSON->RealFileName buf¿Õ¼ä´óĞ¡²»¹» ËùĞèi+1=%d\n", (u32)&__func__, __LINE__, i+1);
		#endif
	}
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);
	myprintf("\n[%s:%d]:×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )JSON->RealFileName);
	#endif
	return p8;
}

u8 *CreateFreJsonFile(void)//´´½¨Ò»¸öĞÂµÄ¶³½ájsonÏîÄ¿ÎÄ¼ş
{
	u8 *paddr;
	u8 *p8;
	u32 i;
	u32 Len;
	//´´½¨ÎÄ¼ş¼Ğ
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, JSONFREPATH);
	i=mystrlen((const char *)p8);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_FRE);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	Get698CurTime_Ascii(p8+Len,1);//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë	
	mystrcpy((char *)p8+Len+8, ".json");	
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);
	#endif
	return p8;
}

u8 *CreateFreJsonFile_RAM(void)//ÔÚRAMÇø,´´½¨Ò»¸öĞÂµÄ¶³½áÏîÄ¿ÎÄ¼ş
{
	u8 *paddr;
	u8 *p8;
	u32 i;
	u32 Len;
	//´´½¨ÎÄ¼ş¼Ğ
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, JSONFREPATH_RAM);
	i=mystrlen((const char *)p8);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_FRE);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	Get698CurTime_Ascii(p8+Len,1);//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë	
	mystrcpy((char *)p8+Len+8, ".json");	
	
	return p8;
}

