gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
void Compress_JSONFile(u8 *fname,u32 fnamesiz,u32 isReal)//½«JSONÎÄ¼ş´ò°ü³Étar.gz¸ñÊ½,isReal,1ÊµÊ±ÎÄ¼ş,0¶³½áÎÄ¼ş
{
	u8 *p8;
	u32 i;
	u32 SLen;
	ms_Type *ms;
	ms=Get_ms();
	p8=(u8 *)ADDR_DATABUFF+1024;
	SLen=0;
	//°ÑÎÄ¼ş¼ĞÀïÃæµÄÎÄ¼şÒÆ¶¯µ½µ±Ç°Ä¿Â¼ÏÂÀ´
	mystrcpy((char *)p8+SLen,"mv ");
	i=mystrlen((const char *)p8+SLen);
	SLen+=i;
	mystrcpy((char *)p8+SLen,(const char *)fname);
	i=mystrlen((const char *)p8+SLen);
	SLen+=i;
	mystrcpy((char *)p8+SLen," .");
	ms->link_system((char *)p8);
	//´ò°üÕâ¸öÎÄ¼ş
	SLen=0;
	if(isReal)
	{
		mystrcpy((char *)p8+SLen, "tar jcvf ");
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		i=mystrlen(JSONREALPATH);
		mystrcpy((char *)p8+SLen, (const char *)fname+i);
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		for(i=0;i<SLen;i++)
		{
			if('.'==p8[i])
			{
				break;
			}
		}
		mystrcpy((char *)p8+i, ".tar.bz2 ");
		i=mystrlen((const char *)p8);
		SLen=i;
		i=mystrlen(JSONREALPATH);
		mystrcpy((char *)p8+SLen, (const char *)fname+i);
	}else
	{
		mystrcpy((char *)p8+SLen, "tar zcvf ");
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		i=mystrlen(JSONFREPATH);
		mystrcpy((char *)p8+SLen, (const char *)fname+i);
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		for(i=0;i<SLen;i++)
		{
			if('.'==p8[i])
			{
				break;
			}
		}
		mystrcpy((char *)p8+i, ".tar.gz ");
		i=mystrlen((const char *)p8);
		SLen=i;
		i=mystrlen(JSONFREPATH);
		mystrcpy((char *)p8+SLen, (const char *)fname+i);
	}	
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:½âÑ¹ÎÄ¼ş×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);	
	#endif
	ms->link_system((char *)p8);
	//°Ñ.JSONÎÄ¼şÉ¾³ıµô,È»ºóÔÙ°ÑÑ¹Ëõ°üÒÆ¶¯µ½¶ÔÓ¦µÄÎ»ÖÃ
	SLen=0;
	mystrcpy((char *)p8+SLen, "mv ");
	i=mystrlen((const char *)p8+SLen);
	SLen+=i;
	if(isReal)
	{
		i=mystrlen(JSONREALPATH);
	}else
	{
		i=mystrlen(JSONFREPATH);
	}
	mystrcpy((char *)p8+SLen, (const char *)fname+i);
	i=mystrlen((const char *)p8+SLen);
	SLen+=i;
	for(i=0;i<SLen;i++)
	{
		if('.'==p8[i])
		{
			break;
		}
	}
	if(isReal)
	{
		mystrcpy((char *)p8+i, ".tar.bz2 ");
		i=mystrlen((const char *)p8);
		SLen=i;
		mystrcpy((char *)p8+SLen, JSONREALPATH);
	}else
	{
		mystrcpy((char *)p8+i, ".tar.gz ");
		i=mystrlen((const char *)p8);
		SLen=i;
		mystrcpy((char *)p8+SLen, JSONFREPATH);
	}
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:ÒÆ¶¯ÎÄ¼ş×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);	
	#endif
	ms->link_system((char *)p8);
	//É¾³ıµ±Ç°µÄ.jsonÎÄ¼ş
	SLen=0;
	mystrcpy((char *)p8+SLen, "rm ");
	i=mystrlen((const char *)p8+SLen);
	SLen+=i;
	if(isReal)
	{
		mystrcpy((char *)p8+SLen, JSONFILENAMEHEAD_REAL);
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		p8[SLen++]='*';
		p8[SLen++]=0;
	}else
	{
		mystrcpy((char *)p8+SLen, JSONFILENAMEHEAD_FRE);
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		p8[SLen++]='*';
		p8[SLen++]=0;
	}
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:É¾³ıµ±Ç°JSONÎÄ¼ş×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);	
	#endif
	ms->link_system((char *)p8);
	if(isReal)
	{
		Delet_JsonFile(JSON->RealFileName);
	}else
	{
		p8=(u8 *)ADDR_DATABUFF+1024;
		mystrcpy((char *)p8, (const char *)fname);
		Delet_JsonFile(p8);
	}
}

u32 HeadStart_JSON(u8 *pstc)//´´½¨JSON¸ñÊ½: [
{
	u32 Offset;
	u32 i;
	Offset=0;
	i=Str_L_SQB(pstc+Offset);//×ó·½À¨ºÅ
	Offset+=i;
	return Offset;
}	

u32 HeadEnd_JSON(u8 *pstc,u32 Len)//´´½¨JSON¸ñÊ½: ]
{
	u32 flag=0;
	u32 Offset;
	u32 i;
	Offset=0;
	if(Len>0)
	{
		if(','==pstc[Len-1])
		{
			Len--;
			flag=1;
		}
	}
	i=Str_CRandLF(pstc+Len+Offset);//»Ø³µºÍ»»ĞĞ
	Offset+=i;
	i=Str_R_SQB(pstc+Len+Offset);//ÓÒ·½À¨ºÅ
	Offset+=i;
	if(1==flag)
	{
		Offset--;
	}
	return Offset;
}

u32 FreDataPack(u16 *pAddr,u8 *pd,u32 ROAD,u32 Min,u32 isReal)
{
	u32 i;
	u8 *pDATA;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	pDATA=Get_MetData_ROAD(pAddr,ROAD,Min,isReal,0);//¸ù¾İROADÀ´È¡FlashÖĞµÄÊı¾İ,pAddr±íµØÖ·,MinÈ¡·ÖÖÓ¶³½áµÄÊ±ºòÓÃ,1±íÊ¾1·ÖÖÓ15±íÊ¾15·ÖÖÓ,·µ»Ø0ÎŞÊı¾İ,·ñÔò·µ»ØÒ»¸öÊı¾İbufÖ¸Õë
	if(NULL==pDATA)
	{	
		return 0;	
	}
	i=FreData_PackJson(ROAD,pDATA,pd,Min);
	ms->ms_free(pDATA);
	pDATA=NULL;	
	return i;
}

u32 AllDataPack(u16 *pAddr,u8 *pd)
{
	u32 i;
	u32 CJSONLEN;
	CJSONLEN=0;
	//»ñÈ¡¶³½áÊı¾İ²¢´ò°ü³ÉJSON¸ñÊ½,·µ»Ø0Ã»ÓĞÕÒµ½Êı¾İ
	i=FreDataPack(pAddr,pd+CJSONLEN,0x50040200,0,0);
	CJSONLEN+=i;
	i=FreDataPack(pAddr,pd+CJSONLEN,0x50060200,0,0);
	CJSONLEN+=i;
	i=FreDataPack(pAddr,pd+CJSONLEN,0x50020200,15,0);
	CJSONLEN+=i;
	i=FreDataPack(pAddr,pd+CJSONLEN,0x50020200,1,0);
	CJSONLEN+=i;	
	return CJSONLEN;
}

void Delet_FrzJsonFile(void)//É¾³ıFlash¿Õ¼äÀïÃæ,ËùÓĞµÄ¶³½áÎÄ¼ş
{
	u32 i;
	u32 Len;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFREPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	ms->link_system((char *)p8);
}

void Crl_AllJsonFileAndTar(void)//Çå¿ÕËùÓĞÓĞ¹ØµÄJSONÎÄ¼şÄÚÈİ
{
	u32 i;
	u32 Len;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFREPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFREPATH_RAM);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH_RAM);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILEPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	mystrcpy((char *)p8+Len, ".tar.gz");
	i=mystrlen((const char *)p8+Len);
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILEPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	mystrcpy((char *)p8+Len, ".json");
	i=mystrlen((const char *)p8+Len);
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILEPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	mystrcpy((char *)p8+Len, ".tar.bz2");
	i=mystrlen((const char *)p8+Len);
	ms->link_system((char *)p8);
}


void Delet_Yesterday_Data_Flash(void)
{
	//É¾³ı×òÌìµÄÈÕ¶³½á
	Delet_All_FromFlash(0x13f16000);
	Delet_All_FromFlash(0x13f11000);
	//É¾³ı×òÌìµÄÔÂ¶³½á
	Delet_All_FromFlash(0x13f18000);
	Delet_All_FromFlash(0x13f13000);
	//É¾³ı×òÌìµÄ·ÖÖÓ¶³½á
	Delet_All_FromFlash(0x13f19000);
	Delet_All_FromFlash(0x13f22000);	
}

