gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
u32 Get_OneRealDataLen_FromFlash(u8 *pIn)//¼ÆËãÒ»¸öÊµÊ±Êı¾İ°üÊı¾İµÄ³¤¶È,pinµ¼ÈëµÄÊÇÍêÕûµÄ°ü°üº¬21¸öÊ±±ê×Ö½Ú
{
	u8 *p8;
	u32 i;
	u32 x;
	u32 OADNUM;
	u32 Len;
	Len=0;
	Len+=21;//Ìø¹ı21¸öÊ±¼ä×Ö½Ú
	OADNUM=pIn[Len+1];//OADÊıÁ¿
	Len+=2;
	Len+=OADNUM*6;
	p8=pIn+Len;//Ö¸ÏòÊı¾İ²¿·Ö
	for(x=0;x<OADNUM;x++)
	{
		i=Get_DL698DataLen_S(p8,0);
		p8+=i;
		Len+=i;
	}
	return Len;
}

u32 RealData_PackJson(u8 *pInbuf,u8 *pout,u8 *pAddr,u32 All)//´¦ÀíÊµÊ±Êı¾İ
{
	u32 i;
	u32 x;
	u32 y;
	u32 z;	
	u32 CJSONLEN=0;
	u32 CJSONL;
	u8 *p8;
	u8 *pdata;//Ö¸ÏòÊı¾İÇøµÄÖ¸Õë
	u8 val;

	u32 Offset=0;
	u32 TotalNUM;
	u32 OAD;
	u32 ROAD;		//¼ÇÂ¼±¨ÎÄÖĞROAD
	u8 OADNUM;		//¼ÇÂ¼±¨ÎÄÖĞROADÊıÁ¿
	u8 OADSPOT; 	//¼ÇÂ¼±¨ÎÄÖĞROADÊıÁ¿µÄÎ»ÖÃ//20210200
	u32 DataLen;	//Êı¾İ´óĞ¡

	u16 *p16;
	p16=(u16 *)pInbuf;
	TotalNUM=p16[0];

	pInbuf+=2;
	p8=(u8 *)ADDR_DATABUFF;
	MC(0,(u32)ADDR_DATABUFF+1024,1024);
	DataLen=0;
	val=0;
	WWDT_Disable();
	if(TotalNUM==0)
	{
		if(All!=0)
		{
			TotalNUM=1;
		}
	}
	for(z=0;z<TotalNUM;z++)
	{
		Offset=21;
		Offset+=4;
		ROAD=(pInbuf[Offset]<<24)|(pInbuf[Offset+1]<<16)|(pInbuf[Offset+2]<<8)|pInbuf[Offset+3];
		if(ROAD!=0x50020200)
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:²»ÊÇ·ÖÖÓ¶³½áÊı¾İ:%08x\n", (u32)&__func__, __LINE__, ROAD);
			#endif
			goto Real_JSON_ERROR;
		}
		Offset+=4;
		OADNUM=pInbuf[Offset];
		Offset++;
		OADSPOT=Offset;
		Offset+=(OADNUM*4); 
		//=====================
		CJSONL=CJSONLEN;
		val=0;
		i=CreateArrayHead_Json(pout+CJSONLEN, DEBUG_SECOND_SPACENUM);
		CJSONLEN+=i;
		Add_StrToASCII(p8,pAddr,6);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
		i=CreateDataHead_Json(pout+CJSONLEN, p8, DEBUG_THIRD_SPACENUM);
		CJSONLEN+=i;
		
		//Êı¾İÊ±¼ä
		Get698Time_Ascii(pInbuf+14,p8);//pÊ±¼äÇ°Á½¸ö×Ö½Ú±íÊ¾Äê·İp8Êä³öascÂë
		GetJsonTime(p8);
		i=CreateData_Json(pout+CJSONLEN, p8);
		CJSONLEN+=i;
		for(y=1;y<RealDataOAD_JSONSIZE;y++)//y´Ó1¿ªÊ¼Ëã ÒòÎªµÚÒ»¸öÊÇÊ±¼äÔÚÇ°ÃæÒÑ¾­Ğ´ºÃÁË
		{
			for(x=0;x<OADNUM;x++)
			{
				OAD=(pInbuf[OADSPOT+x*4]<<24)|(pInbuf[OADSPOT+x*4+1]<<16)|(pInbuf[OADSPOT+x*4+2]<<8)|pInbuf[OADSPOT+x*4+3];
				
				if((RealDataOAD_JSON[y])==(OAD))
				{
					break;
				}else
				{
					if((OAD&0xff)==0)//Èç¹ûOAD×îºóÒ»¸ö×Ö½ÚÊÇ0ÓĞ¿ÉÄÜ¾ÍÊÇµçÑ¹ µçÁ¿ÕâÖÖºÏÏîµÄ
					{
						if((RealDataOAD_JSON[y]>>8)==(OAD>>8))
						{
							break;
						}	
					}
				}
			}
			if(x<OADNUM)//ÕÒµ½ÁËÓĞĞ§OAD
			{	
				pdata=Find_DataHead(pInbuf,pInbuf+OADSPOT,x);//¸ù¾İFlashÀïÃæµÄ´æ´¢¸ñÊ½ÓÃpInÀïÃæOADµÄÎ»ÖÃÈ¥ÕÒpInÀïÃæÊı¾İµÄÎ»ÖÃ,pOADµÚÒ»×Ö½ÚÊÇOADÊıÁ¿,oadcntÊÇpOADÀïÃæµÄÆ«ÒÆ,·µ»ØPinÀïÃæÊı¾İµÄÕıÈ·Î»ÖÃ
				if((RealDataOAD_JSON[y]!=OAD)&&((OAD&0xff)==0))
				{
					#ifdef DEBUG_JSON
					myprintf("[%s:%d]:ÊÇ½»²ÉÊı¾İ\n",(u32)&__func__,__LINE__,0);
					myprintf("[%s:%d]:ÊÇ½»²ÉÊı¾İOAD=%08x\n",(u32)&__func__,__LINE__,OAD);
					
					for(i=0;i<50;i++)
							myprintf("%02x ",pdata[i],0,0);
						myprintf("\n",0,0,0);
					#endif
					i=RealDataOAD_JSON[y]&0xff;
					pdata=Get_Element(pdata,i,0,0);//¼ÆËãÔªËØµØÖ·(ĞéÄâµØÖ·Ö¸Õë),Ê¹ÓÃADDR_128KDATABUFF;³ö¿Ú:µØÖ·Ö¸ÏòÔªËØµÄÀàĞÍ×Ö½Ú,0=´íÎó
				}
				if(!pdata)
				{
					#ifdef DEBUG_JSON
					myprintf("[%s:%d]:Ã»ÓĞÕÒµ½ÓĞĞ§µÄÊı¾İ\n",(u32)&__func__,__LINE__,0);
					#endif
					continue;
				}
				i=DealMetData_Ascii(OAD>>16,pdata,p8,1);//´¦Àí³­¶Á»Øµç±íµÄÊı¾İ,·µ»Ø´æÈëpoutµÄ×Ö½ÚÊıÁ¿,poutÒÑ¾­´¦ÀíºÃµÄASCii			
				if(0==i)
				{
					#ifdef DEBUG_JSON
					myprintf("[%s:%d]:²É¼¯µ½µÄÊı¾İ´æ´¢¸ñÊ½ÓĞ´íÎó\n",(u32)&__func__,__LINE__,0);
					#endif
					goto Real_JSON_ERROR;
				}
				if(All)
				{//È«Íø
					val=1;
				}else
				{//ÔöÁ¿  ¹ıÂËµô0
					if(0==p8[0])
					{
						continue;
					}else
					{
						val=1;
					}
				}
				i=CreateData_Json(pout+CJSONLEN, p8);
				CJSONLEN+=i;
			}else
			{
				i=Str_COMMA(pout+CJSONLEN);//¶ººÅ
				CJSONLEN+=i;
			}
		}
		i=CreateDataEnd_Json(pout,CJSONLEN);
		CJSONLEN+=i;
		i=CreateArrayEnd_Json(pout, CJSONLEN,DEBUG_SECOND_SPACENUM);
		CJSONLEN+=i;
		i=Str_LF(pout+CJSONLEN);
		CJSONLEN+=i;
		DataLen=Get_OneFreDataLen_FromFlash(pInbuf);//¼ÆËãÒ»¸ö·ÖÊ±¶ÎÊı¾İ°üÊı¾İµÄ³¤¶È,pinµ¼ÈëµÄÊÇÍêÕûµÄ°ü°üº¬21¸öÊ±±ê×Ö½Ú
		if(z<TotalNUM)
		{	
			pInbuf+=DataLen;
		}
		if(!All)
		{
			if(0==val)
			{
				CJSONLEN=CJSONL;
			}
		}
	}
	if(!All)
	{
		if(0==val)
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:Êı¾İÎª¿Õ!!!!!!\n",(u32)&__func__,__LINE__,0);
			#endif
			return 0;
		}
	}
	return CJSONLEN;
Real_JSON_ERROR:
	return 0;
}

u32 RealDataPackNull(u8 *pout,u8 *pAddr)//È«ÍøÊµÊ±´´½¨¿ÕÊı¾İÁĞ±í
{
	u8 *p8;
	u32 i;
	u32 y;
	u32 CJSONLEN;
	CJSONLEN=0;
	i=CreateArrayHead_Json(pout+CJSONLEN, DEBUG_SECOND_SPACENUM);
	CJSONLEN+=i;
	p8=(u8 *)ADDR_DATABUFF;
	Add_StrToASCII(p8,pAddr,6);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=CreateDataHead_Json(pout+CJSONLEN, p8, DEBUG_THIRD_SPACENUM);
	CJSONLEN+=i;
	
	//Êı¾İÊ±¼ä
	//Get698CurTime_Ascii(p8);
	Get698Time_Ascii(JSON->Lastrealtime,p8);//pÊ±¼äÇ°Á½¸ö×Ö½Ú±íÊ¾Äê·İp8Êä³öascÂë
	GetJsonTime(p8);
	i=CreateData_Json(pout+CJSONLEN, p8);
	CJSONLEN+=i;	
	for(y=1;y<RealDataOAD_JSONSIZE;y++)//y´Ó1¿ªÊ¼Ëã ÒòÎªµÚÒ»¸öÊÇÊ±¼äÔÚÇ°ÃæÒÑ¾­Ğ´ºÃÁË
	{
		i=Str_COMMA(pout+CJSONLEN);//¶ººÅ
		CJSONLEN+=i;
	}
	i=CreateDataEnd_Json(pout,CJSONLEN);
	CJSONLEN+=i;
	i=CreateArrayEnd_Json(pout, CJSONLEN,DEBUG_SECOND_SPACENUM);
	CJSONLEN+=i;
	i=Str_LF(pout+CJSONLEN);
	CJSONLEN+=i;
	return CJSONLEN;
}

u32 RealDataPack(u16 *pAddr,u8 *pd,u32 ROAD,u32 Min,u32 isReal,u32 All)
{
	u32 i;
	u8 *pDATA;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	pDATA=Get_MetData_ROAD(pAddr,ROAD,Min,isReal,All);//¸ù¾İROADÀ´È¡FlashÖĞµÄÊı¾İ,pAddr±íµØÖ·,MinÈ¡·ÖÖÓ¶³½áµÄÊ±ºòÓÃ,1±íÊ¾1·ÖÖÓ15±íÊ¾15·ÖÖÓ,·µ»Ø0ÎŞÊı¾İ,·ñÔò·µ»ØÒ»¸öÊı¾İbufÖ¸Õë
	if(NULL==pDATA)
	{	
		if(All)
		{
			p8=(u8 *)pAddr;
			i=RealDataPackNull(pd,p8);
			ms->ms_free(pDATA);
			pDATA=NULL;	
			return i;
		}
		return 0;	
	}
	p8=(u8 *)pAddr;
	i=RealData_PackJson(pDATA,pd,p8,All);
	ms->ms_free(pDATA);
	pDATA=NULL;	
	return i;
}

u32 DeletFlashData_SelectTime(u32 ROAD,u8 *ptime)//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
{
	u32 i;
	u32 x;
	u32 ret=0;
	switch (ROAD)
	{
		case 0x50020200://·ÖÖÓ¶³½á
			//±È½ÏÊ±±êÊÇÉÏÒ»ÌìµÄ
			i=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<24)|(JSON->Lastrealtime[2]<<8)|(JSON->Lastrealtime[3]);
			i=YYMD_Sub1D_hex(i);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			x=(ptime[0]<<16)|(ptime[1]<<24)|(ptime[2]<<8)|(ptime[3]);
			if(i>=x)
			{
				ret=1;
			}		
			break;
		case 0x50040200://ÈÕ¶³½á
		//´ò°üµÄÊ±ºòÊÇµÚ¶şÌì
			i=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<24)|(JSON->Lastrealtime[2]<<8)|(JSON->Lastrealtime[3]);
		//¼õÒ»ÌìÊÇ×òÌìµÄÈÕ¶³½á
			i=YYMD_Sub1D_hex(i);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			
			i=YYMD_Sub1D_hex(i);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			i=YYMD_Sub1D_hex(i);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			i=YYMD_Sub1D_hex(i);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			x=(ptime[0]<<16)|(ptime[1]<<24)|(ptime[2]<<8)|(ptime[3]);
			if(i>=x)
			{
				ret=1;
			}
			break;
		case 0x50060200://ÔÂ¶³½á(±£´æÒ»¸öÔÂµÄÊ±¼ä)
			//±È½ÏÊ±±êÊÇÉÏÒ»ÌìµÄ
			i=(JSON->Lastrealtime[0]<<16)|(JSON->Lastrealtime[1]<<8)|JSON->Lastrealtime[2];
			i=YYM_SubM_hex(i, 2);//ÄêÄêÔÂÈÕ¼õ1ÈÕ,·µ»Ø¼õ1ºóµÄÄêÄêÔÂÈÕ
			x=(ptime[0]<<8)|(ptime[1]<<16)|ptime[2];
			if(i>=x)
			{
				ret=1;
			}			
			break;
		case 0x5002020E:
		case 0x50020201:
			i=Compare_DL698DataString(JSON->Lastrealtime,ptime,6);//Êı¾İ´®±È½Ï(¸ßÎ»ÔÚµÍ×Ö½Ú),p1ºÍp2ÒÑÔÚRAMÖĞ,·µ»Ø:0=ÏàÍ¬,1=²»ÏàÍ¬p1>p2,2=²»ÏàÍ¬p1<p2
			if(i==1)
			{
				ret=1;
			}		
			break;	
		default:
		break;
	}
	return ret;
}

void Delet_All_FromFlash(u32 FileID)
{
	u32 i;
	u32	filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	WWDT_Enable_Feed(WDTTimerOutVal);//ÔÊĞí¿´ÃÅ¹·ºÍÎ¹¹·
	Comm_Ram->msFILESearchCount=0;
	while(Comm_Ram->msFILESearchCount<(recordFILENAMEmax_FLASH))
	{	
		filename=Get_RecordFileName_JS(FileID,0xffffffff,0);//ËÑË÷ÎÄ¼şÃû:Èë¿Ú:FileID=b31-b28·½°¸ÀàĞÍ,b27-b24²É¼¯ÀàĞÍ,b23-b20´æ´¢Ê±±êÀàĞÍ,b19-b12ÈÎÎñºÅ,b11-b8¶Ë¿ÚºÅ,b7-b0,ÏàÓ¦ÓòÖµÎª0xF±íÊ¾²»¹Ø×¢,pTimeÊı¾İ´æ´¢Ê±±ê=0±íÊ¾²»¹Ø×¢;SearchCount=¿ªÊ¼ËÑË÷µÄÎÄ¼şºÅ0xFFFF±íÊ¾´ÓÉÏ´Î½áÊøºÅ¿ªÊ¼ËÑË÷;·µ»Ø:0--(FILENAMEmax_FLASH-1)±íÊ¾ÎÄ¼şÔÚFLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)±íÊ¾ÎÄ¼şÔÚRAM,0xffffffff±íÊ¾Ã»ÕÒµ½
		if(filename==0xffffffff)
		{
			continue;
		}
		if(filename<FILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
		}
		else
		{
			//file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
			continue;
		}
		if(file->BLOCK_ENTRY==0)
		{
			continue;
		}
		switch (FileID)
		{
			case 0x13f11000://ÈÕ¶³½á
				//i=Filter_Time(file->save_date_time_s,0x50040200,0,0);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
				i=DeletFlashData_SelectTime(0x50040200,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			case 0x13f13000://ÔÂ¶³½á
				//i=Filter_Time(file->save_date_time_s,0x50060200,0,0);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
				i=DeletFlashData_SelectTime(0x50060200,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			case 0x13f16000://ÈÕ¶³½á
				//i=Filter_Time(file->save_date_time_s,0x50040200,0,0);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
				i=DeletFlashData_SelectTime(0x50040200,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			case 0x13f18000://ÔÂ¶³½á
				//i=Filter_Time(file->save_date_time_s,0x50060200,0,0);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
				i=DeletFlashData_SelectTime(0x50060200,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			case 0x13f19000://15·ÖÖÓ¶³½á
				//i=Filter_Time(file->save_date_time_s,0x50020200,0,0);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
				i=DeletFlashData_SelectTime(0x50020200,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			case 0x13f22000://1·ÖÖÓ¶³½á
				//i=Filter_Time(file->save_date_time_s,0x50020200,0,0);//È¡ÎÄ¼şµÄ´æ´¢Ê±¼ä½øĞĞ¹ıÂË,³É¹¦·µ»Ø1,Ê§°Ü0
				i=DeletFlashData_SelectTime(0x50020200,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			case 0x13f12000://15·ÖÖÓ¶³½á
				//i=1;//Ä¬ÈÏÈ«²¿É¾³ı
				i=DeletFlashData_SelectTime(0x5002020E,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			case 0x13f17000://1·ÖÖÓ¶³½á
				//i=1;//Ä¬ÈÏÈ«²¿É¾³ı
				i=DeletFlashData_SelectTime(0x50020201,file->save_date_time_s);//ÔÚÃ¿Ò»´Î´ò°üÖ®ºó´¦ÀíÉ¾³ıµÄÊı¾İÏî(´ÓNANDFLASH),³É¹¦¾Í·µ»Ø1,Ê§°Ü·µ»Ø0
				break;
			default:
				return;
		}
		if(0==i)
		{
			continue;
		}
		file->BLOCK_ENTRY=0;
		ms->msfile_Delete(filename);
	}
}

void Delet_FileName(void)
{
	Delet_All_FromFlash(0x13f12000);//É¾³ıÕâ¸öÊ±¼äµãµÄÎÄ¼ş
	Delet_All_FromFlash(0x13f17000);//É¾³ıÕâ¸öÊ±¼äµãµÄÎÄ¼ş
}

void Delet_JsonFile(u8 *fanme)//É¾³ıµ±Ç°µÄRealtime.jsonÎÄ¼ş,±£ÁôÑ¹Ëõ°ü
{
	u32 i;
	u32 Len;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, (const char *)fanme);
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:É¾³ıtmpÀïÃæJSONÎÄ¼ş×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);	
	#endif
	ms->link_system((char *)p8);
}
void Delet_JsonFile_PATH(const char *path)//É¾³ıÂ·¾¶pathÏÂµÄjsonÎÄ¼ş
{
	u32 i;
	u32 Len;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, (const char *)path);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	mystrcpy((char *)p8+Len, ".json");
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:É¾³ıtmpÀïÃæJSONÎÄ¼ş×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);	
	#endif
	ms->link_system((char *)p8);
}
void Delet_AllData_PATH(const char *path)//É¾³ıÂ·¾¶pathÏÂµÄËùÓĞÎÄ¼ş
{
	u32 i;
	u32 Len;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, (const char *)path);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:É¾³ıtmpÀïÃæJSONÎÄ¼ş×Ö·û:%s \n", (u32)&__func__, __LINE__, (u32 )p8);	
	#endif
	ms->link_system((char *)p8);
}

void Delet_CurPath_JSON_And_TarGz(void)//É¾³ıµ±Ç°Ä¿Â¼ÏÂµÄjsonÎÄ¼şºÍtar.gzÑ¹ËõÎÄ¼ş
{
	u32 i;
	u32 Len;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	mystrcpy((char *)p8+Len, ".json");
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:É¾³ıÃüÁî:%s \n", (u32)&__func__, __LINE__, (u32 )p8);	
	#endif
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	mystrcpy((char *)p8+Len, ".tar.gz");
	#ifdef DEBUG_JSON
	myprintf("\n[%s:%d]:É¾³ıÃüÁî:%s \n", (u32)&__func__, __LINE__, (u32 )p8);
	#endif
	ms->link_system((char *)p8);
}


