gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
void Delet_RealTime_BZ2(void)//É¾³ıÊµÊ±µÄÑ¹ËõÎÄ¼ş,(ÉÏ±¨Ö®ºóÒªÉ¾³ı)
{
	u32 i;
	u32 Len;
	u8 *p8;
	u8 *pfilename;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	
	pfilename=GetFileJsonName_Compress(JSON->reportfiletime);
	p8=(u8 *)ADDR_DATABUFF+1024;
	Len=0;	
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, (const char *)pfilename);
	ms->link_system((char *)p8);
}

void Mkdir_JsonFile(const char *path)//´´½¨pathÂ·¾¶ÎÄ¼ş¼Ğ
{
	u32 i;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	mystrcpy((char *)p8, "mkdir ");
	i=mystrlen((const char *)p8);
	mystrcpy((char *)p8+i, (const char *)path);
	ms->link_system((char *)p8);
}

u32 Is_MinData_Flash(u32 FileID)//ÔÚFlash¿Õ¼äÀïÃæÕâ¸öÊı×ÖÊÇ²»ÊÇ·ÖÖÓÊı¾İ,0²»É¾³ı 1É¾³ı
{
	u32 ret=0;
	//¸ù¾İFileIDÀ´É¾³ı²»Í¬µÄÎÄ¼ş
	switch(FileID)
	{
		//case 0x13f12000:
		//case 0x13f17000:
		case 0x13f16000://ÈÕ¶³½á
		case 0x13f11000:
		case 0x13f18000://ÔÂ¶³½á
		case 0x13f13000:
		case 0x13f19000://15·ÖÖÓ¶³½á
		//case 0x13f22000://1·ÖÖÓ¶³½á
		case 3://ËÑ±í½á¹û²»É¾³ı
		case 4:
			break;
		default:
			ret=1;
		break;
	}
	return ret;
}

void Delet_MinData_Flash(u32 Delcnt)//ÔÚFlashÀïÃæÉ¾³ıDelcntµãµÄÊı¾İÁ¿
{
	u32 i;
	u32 FileCount;
	u32 FileID;
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	ms=Get_ms();
	FileCount=0;	
	file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);	
	for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
	{
		if(Delcnt<=FileCount)//Èç¹ûÉ¾³ıµÄ´ÎÊıÒÑ¾­µ½ÁË,ÄÇ¾ÍÍË³ö
		{
			break;
		}
		if(file->BLOCK_ENTRY)
		{
			//i=file->FILECOUNT;
			FileID=file->FILEID;
			i=Is_MinData_Flash(FileID);//ÔÚFlash¿Õ¼äÀïÃæÕâ¸öÊı×ÖÊÇ²»ÊÇ·ÖÖÓÊı¾İ,0²»É¾³ı 1É¾³ı
			if(i)
			{
				ms->msfile_Delete(filename);
				FileCount++;
			}
		}
		file++;
	}
}

void Delet_AllFile(u8 *ptime)//É¾³ıÁÙÊ±ÎÄ¼şÏÂÃæµÄËùÓĞÎÄ¼ş ²»°üÀ¨ÎÄ¼ş¼Ğ
{
	u32  i;
	u32 Len;
	u8 *p8;
	u8 *paddr;
	//u8 time[7];
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	i=Check_pYYMDHMS_hex(ptime);
	if(i)
	{
		return;
	}
	
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "mkdir ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONTEMPFILENAEM);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÃüÁî %s\n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "mv ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_REAL);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Get698CurTime_Ascii(p8+Len);//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë		
	Get698Time_Ascii(ptime, p8+Len);
	mystrcpy((char *)p8+Len+8, "* ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONTEMPFILENAEM);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÃüÁî %s\n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	ms->link_system((char *)p8);
	
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//ÎÄ¼şµÄÃû×Ö
	p8[Len++]='*';
	p8[Len]=0;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÃüÁî %s\n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	ms->link_system((char *)p8);
	
	Len=0;
	mystrcpy((char *)p8+Len, "mv ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONTEMPFILENAEM);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='/';
	p8[Len++]='*';
	p8[Len++]=' ';
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len]=0;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÃüÁî %s\n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//ÎÄ¼şµÄÃû×Ö
	mystrcpy((char *)p8+Len, JSONTEMPFILENAEM);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]=' ';
	p8[Len++]='-';
	p8[Len++]='r';
	p8[Len++]='f';
	p8[Len++]=0;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÃüÁî %s\n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	ms->link_system((char *)p8);

	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFREPATH);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÃüÁî %s\n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	ms->link_system((char *)p8);
	
}

u32 Check_TarFtzFile(u8 *ptime)
{
	u32 i;
	s32 fd;
	u8 *pname;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	i=Check_pYYMDHMS_hex(ptime);
	if(i)
	{
		return 0;
	}
	if(ptime[4]==0&&ptime[5]==0)
	{
		JSON->IsCreateFrzJson=0;
	}
	i=ptime[4]*60+ptime[5];
	if(i<70)//Õâ¸öÊ±¼ä¶ÎÄÚ²»»áÓĞÕâ¸öÑ¹ËõÎÄ¼şÉú³É
	{
		return 0;
	}
	if(JSON->IsCreateFrzJson!=0)
	{
		return 0;
	}
	Mkdir_JsonFile(JSONFREPATH);
	pname=GetFrzFileJsonName_Compress();//µÃµ½Ñ¹Ëõ°üµÄÃû×Ö´øÂ·¾¶
	fd=ms->link_open((char *)pname,O_CREAT|O_EXCL);//²âÊÔÎÄ¼ş´æ²»´æÔÚ
	if(fd!=-1)//ËµÃ÷ÎÄ¼ş²»´æÔÚ
	{
		//ÄÇ¾ÍËµÃ÷½ñÌìÃ»ÓĞ´ò°ü,»òÕßËµÊÇ´ò°üÒÑ¾­Ê§°ÜÁË,ĞèÒªÖØĞÂÔÙ´ò°ü
		//1.É¾³ıµ±Ç°Ä¿Â¼ÏÂÃæËùÓĞµÄ.jsonºÍ.tar
		Delet_CurPath_JSON_And_TarGz();
		Delet_AllFile(ptime);//É¾³ıÉÏÒ»ÌìµÄÎÄ¼ş¼ĞÄÚÈİ
		ms->link_close(fd);
		return 1;
	}else
	{
		//ÎÄ¼ş´æÔÚ½ñÌì¾Í²»½øĞĞÈ«Á¿ÎÄ¼ş´ò°ü²Ù×÷
		JSON->IsCreateFrzJson=1;
	}
	return 0;
}

