gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
u32 IsTimeTask(u8 *pt)//ÓÃÊ±¼äÅĞ¶ÏÊÇ²»ÊÇ´ò°üÈÎÎñÊ±¼äµ½ÁË,ptÉÏÒ»´Î´ò°üµÄÊ±¼ä
{
	u64 YYMDHM1;
	u64 YYMDHM2;
	u32 ret=0;
	YYMDHM1=0;
	YYMDHM1=((u64)pt[0]<<32)|((u64)pt[1]<<40)|((u64)pt[2]<<24)|((u64)pt[3]<<16)|((u64)pt[4]<<8)|((u64)pt[5]);
	//´æÔÚFlashÎÄ¼şÀïÃæµÄÊ±±ê
	YYMDHM2=0;
	YYMDHM2=((u64)Comm_Ram->DL698YMDHMS[0]<<32)|((u64)Comm_Ram->DL698YMDHMS[1]<<40)|((u64)Comm_Ram->DL698YMDHMS[2]<<24)|((u64)Comm_Ram->DL698YMDHMS[3]<<16)|((u64)Comm_Ram->DL698YMDHMS[4]<<8)|((u64)Comm_Ram->DL698YMDHMS[5]);
	if(JSON->reportfiletime[4]==0&&0==JSON->reportfiletime[5])
	{
		Delet_AllFile(JSON->reportfiletime);
	}
	if(YYMDHM1<YYMDHM2)
	{
		if(0==pt[5])
		{
			return 3;
		}
		return 1;
	}
	if(YYMDHM1>YYMDHM2)
	{
		return 2;
	}
	return ret;
}

u32 Can_GetVaildMetAddr(void)
{
	u8 *p8;
	u16 *p16s;
	u32 i;
	for(i=0;i<NUMmax_6000;i++)
	{
		p8=(u8*)ADDR_6000_SDRAM+i*LENper_6000;
		if(p8[0]==DataType_structure)
		{
			p16s=(u16*)(p8+10);//È¡²É¼¯µµ°¸ÅäÖÃĞòºÅµÄÍ¨ĞÅµØÖ·
			if(p16s[0]==0)
			{
				if(p16s[1]==0)
				{
					if(p16s[2]==0)
					{
						continue;
					}
				}
			}
			break;
		}
	}
	if(i>=NUMmax_6000)
	{
		return 0;
	}
	return 1;
}

void Terminal_FrzPack(void)
{
	u32 i;
	u32 CJSONLEN;//JSON×Ö·û´®¼ÆÊıÆ÷,³õÊ¼»¯0
	u32 JSONDataLen;
	u8 *p8;
	u8 *p8s;
	u8 *pAddr;//µØÖ·u8ÀàĞÍÖ¸Õë
	u8 *pname;
	u16 *p16;
	s32 fd;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();	
	
	switch (JSON->PackFrzJsonTask)
	{
		case 0://³õÊ¼»¯Êı¾İ
			JSON->PackFrzJsonTask++;
			break;
		case 1://Ê±¼äµÄÅĞ¶Ï	
			//¼ì²éÊÇ²»ÊÇÒòÎªÍ£ÉÏµçÒıÆğµÄ´ò°üÊ§°Ü»òÕßÑ¹ËõÊ§°Ü
			i=Check_pYYMDHMS_hex(JSON->Lastrealtime);
			if(i)
			{
				MW((u32)Comm_Ram->DL698YMDHMS, (u32)JSON->Lastrealtime, sizeof(JSON->Lastrealtime));
			}			
			i=i=Check_TarFtzFile(JSON->Lastrealtime);//Ö»ÓĞ¹ıÁËÒ»·ÖÖÓ²Å»áÖ´ĞĞÏàÓ¦µÄÈÎÎñ
			if(i!=0)//ÈÕ¶³½á´ò°üÈÎÎñ
			{
				#ifdef DEBUG_JSON
				myprintf("==============================================================================\n", 0, 0, 0);
				myprintf("==========================×¼±¸¿ªÊ¼´´½¨¶³½áJSON¸ñÊ½ÎÄ¼ş========================\n", 0, 0, 0);
				myprintf("==============================================================================\n", 0, 0, 0);
				#endif
				JSON->PackFrzJsonTask++;
			}
			break;
		case 2://´ò°üÖ®Ç°Òª×öµÄ¹¤×÷
			//TEST_PACK();
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:´ò°üÇ°Ê±¼ä\n",(u32)&__func__,(u32)__LINE__,0);
			for(i=0;i<7;i++)
				myprintf("%02x ",Comm_Ram->DL698YMDHMS[i],0,0);
			myprintf("\n",0,0,0);
			#endif
			i=Can_GetVaildMetAddr();
			if(i==0)
			{
				JSON->PackFrzJsonTask=0;
				return;
			}
			JSON->CurFrzMetCount=0;
			//´ò°üÖ®Ç°Çå¿ÕRAMÏÂÃæËùÓĞµÄ¿Õ¼ä
			Delet_RAM_FrzFile();
			JSON->PackFrzJsonTask++;
			break;
		case 3://Êı¾İÕıÔÚ´¦ÀíÖĞ
			//#ifndef DEBUG_JSON
			i=GetOneMetAddr((u16 *)&JSON->CurFrzMetCount);
			//#else
			//i=GetOneMetAddr_TEST(&JSON->CurFrzMetCount);
			//#endif
			if(i==0)//È«²¿±íµØÖ·ÒÑ¾­´ò°ü½áÊø
			{
				JSON->PackFrzJsonTask++;;//ÖØÖÃÃ¿Ìì´ò°üÈÕ¶³½áµÄ±êÖ¾
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:Êı¾İ´¦ÀíÍê±Ï¿ªÊ¼Ñ¹Ëõ\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				break;
			}
			JSON->CurFrzMetCount++;//ÏÂÒ»´ÎÑ­»·¾ÍÕÒÏÂÒ»Ö»±í
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:JSON->CurFrzMetCount=%d\n",(u32)&__func__,(u32)__LINE__,JSON->CurFrzMetCount);
			#endif
			//µÃµ½ÎÄ¼şÃû×Ö
			Mkdir_JsonFile(JSONFREPATH_RAM);
			pname=CreateFreJsonFile_RAM();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
			fd=ms->link_open((char *)pname,O_RDWR);
			if(fd!=-1)
			{
				i=ms->link_lseek(fd,0,SEEK_END);
				if((i>=RAMTOFLASH_COPYMAXSIZE))
				{
					//´ÓRAM¿Õ¼äÒÆ¶¯µ½Flash¿Õ¼ä
					i=Copy_RamToFlash(fd);
					if(i!=0)
					{
						ms->link_close(fd);
						return ;
					}
				}
				ms->link_close(fd);
			}
			p8=(u8 *)ms->ms_calloc(1024*1024);
			if(!p8)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:ÉêÇë¿Õ¼äÊ§°Üi\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				return ;
			}
			CJSONLEN=0;
			JSONDataLen=0;
			p8s=(u8 *)ADDR_DATABUFF;
			p16=(u16 *)(ADDR_AddrList);
			p16++;//Ç°ÃæÒ»¸öÊÇ±íµÄÊıÁ¿,ºóÃæÒ»¸öÊÇ±íµÄµØÖ·
			pAddr=(u8 *)p16;
			i=CreateArrayHead_Json(p8+CJSONLEN, DEBUG_FIRST_SPACENUM);
			JSONDataLen+=i;
			CJSONLEN+=i;
			Add_StrToASCII(p8s,pAddr,6);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
			i=Createitem_Json(p8+CJSONLEN, STR_ADDR, p8s, DEBUG_SECOND_SPACENUM);
			JSONDataLen+=i;
			CJSONLEN+=i;
			i=CreateitemArrayHead_Json(p8+CJSONLEN, STR_ITEMLIST, DEBUG_SECOND_SPACENUM);
			JSONDataLen+=i;
			CJSONLEN+=i;
			i=AllDataPack(p16,p8+CJSONLEN);
			CJSONLEN+=i;
			if(i>0)//ËµÃ÷ÊÇÓĞÊı¾İµÄ
			{
				i=CreateitemArrayEnd_Json(p8, CJSONLEN,DEBUG_SECOND_SPACENUM);
				CJSONLEN+=i;
				i=CreateArrayEnd_Json(p8, CJSONLEN, DEBUG_FIRST_SPACENUM);
				CJSONLEN+=i;
				CJSONLEN=Delet_COMMA(p8,CJSONLEN);//É¾³ı¶ººÅ
				i=Str_LF(p8+CJSONLEN);
				CJSONLEN+=i;			
			}else
			{		
				if(CJSONLEN>=JSONDataLen)
				{
					CJSONLEN-=JSONDataLen;
				}
			}
			
			if(CJSONLEN>0)//ÕâÒ»Ö»±íÊ¾ÓĞÊı¾İµÄ
			{
				//ÏÂÃæ¿ªÊ¼ÍùRAM¿Õ¼äÀïÃæĞ´Êı¾İ
				i=CalCulate_Space(JSONFREPATH_RAM);//¼ÆËãÕâ¸ö¿Õ¼äÀïÃæÊ£ÓàµÄÈİÁ¿
				if(i>=CJSONLEN)//Èç¹ûÊ£ÓàµÄ¿Õ¼ä¹»ÓÃ
				{
					//µÃµ½ÎÄ¼şÃû×Ö
					Mkdir_JsonFile(JSONFREPATH_RAM);
					pname=CreateFreJsonFile_RAM();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
					fd=ms->link_open((char *)pname,O_RDWR);
					if(fd!=-1)
					{
						ms->link_lseek(fd,0,SEEK_END);
						i=ms->link_write(fd,p8,CJSONLEN);
						if(i==CJSONLEN)
						{
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
							#endif
						}else
						{
							i=ms->link_write(fd,p8,CJSONLEN);
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
							#endif
						}
					}else
					{
						fd=ms->link_open((char *)pname,O_CREAT|O_RDWR);
						if(-1==fd)
						{
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:´´½¨ÎÄ¼şÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
							#endif
							ms->ms_free(p8);
							return;
						}
						ms->link_lseek(fd,0,SEEK_SET);
						i=ms->link_write(fd,p8,CJSONLEN);
						if(i==CJSONLEN)
						{
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
							#endif
						}else
						{
							i=ms->link_write(fd,p8,CJSONLEN);
							#ifdef DEBUG_JSON
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
							#endif
						}
					}
				}else
				{
					
