gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
				}
				ms->link_close(fd);//¹Ø±ÕÎÄ¼ş¾ä±ú
			}
			ms->ms_free(p8);
			break;
		case 4://Êı¾İ´¦Àí½áÊø,×¼±¸¿½±´ÎÄ¼şÑ¹Ëõ
			//µÃµ½ÎÄ¼şÃû×Ö
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:´ò°ü´¦ÀíÍê¿ªÊ¼Ñ¹Ëõ\n",(u32)&__func__,(u32)__LINE__,0);
			for(i=0;i<7;i++)
				myprintf("%02x ",Comm_Ram->DL698YMDHMS[i],0,0);
			myprintf("\n",0,0,0);
			#endif
			Mkdir_JsonFile(JSONFREPATH_RAM);
			pname=CreateFreJsonFile_RAM();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
			fd=ms->link_open((char *)pname,O_RDWR);
			if(fd!=-1)
			{
				i=ms->link_lseek(fd,0,SEEK_SET);
				//´ÓRAM¿Õ¼äÒÆ¶¯µ½Flash¿Õ¼ä
				i=Copy_RamToFlash(fd);
				if(i!=0)
				{
					ms->link_close(fd);
					return ;
				}
				ms->link_close(fd);
			}
			Mkdir_JsonFile(JSONFREPATH);
			pname=CreateFreJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
			fd=ms->link_open((char *)pname,O_RDWR);
			if(fd!=-1)
			{
				ms->link_close(fd);
				WWDT_Disable();
				Compress_JSONFile(pname,1024,0);//½«JSONÎÄ¼ş´ò°ü³Étar.gz¸ñÊ½
				//Delet_Yesterday_Data_Flash();//É¾³ıflashÀïÃæ×òÌìËùÓĞµÄÊı¾İ
				Delet_JsonFile_PATH(JSONFREPATH_RAM);//É¾³ıJSONÎÄ¼ş
				JSON->IsCreateFrzJson=1;
				JSON->PackFrzJsonTask=1;
			}else
			{
				//ËµÃ÷´ò°üÊ§°ÜÁË
				if(JSON->IsCreateFrzJson>=1)//½ñÌìµÄÊı¾İ´ò°üÊ§°ÜÁË
				{
					JSON->IsCreateFrzJson=1;
					JSON->PackFrzJsonTask=1;
					Delet_JsonFile_PATH(JSONFREPATH_RAM);//É¾³ıJSONÎÄ¼ş
				}
				else
				{
					JSON->IsCreateFrzJson++;//ÔÙ¸øÒ»´Î»ú»á´ò°ü
				}
			}
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:´ò°üºóÊ±¼ä\n",(u32)&__func__,(u32)__LINE__,0);
			for(i=0;i<7;i++)
				myprintf("%02x ",Comm_Ram->DL698YMDHMS[i],0,0);
			myprintf("\n",0,0,0);
			#endif
			break;
		default:
			JSON->PackFrzJsonTask=0;
		break;
	}
}

u32 GetOneMetAddr(u16 *MetCount)//ÕÒµ½Ò»¸ö±íµØÖ·
{
	u8 *p8;
	u16 *p16;
	u16 *p16s;
	#ifdef DEBUG_JSON
	u32 i;
	#endif
	u16 Met=*MetCount;
	p16=(u16*)(ADDR_AddrList+2);
	if(Met>=NUMmax_6000)
	{
		return 0;
	}
	for(;Met<NUMmax_6000;Met++)
	{
		p8=(u8*)ADDR_6000_SDRAM+(Met)*LENper_6000;
		if(p8[0]==DataType_structure)
		{
			p16s=(u16*)(p8+10);//È¡²É¼¯µµ°¸ÅäÖÃĞòºÅµÄÍ¨ĞÅµØÖ·
			p16[0]=p16s[0];
			p16[1]=p16s[1];
			p16[2]=p16s[2];
			break;
		}
	}
	if(Met>=NUMmax_6000)
	{
		return 0;
	}
	*MetCount=Met;
	p16=(u16*)ADDR_AddrList;
	p16[0]=1;

	p8=(u8 *)(ADDR_AddrList+2);
	#ifdef DEBUG_JSON
	for(i=6;i>0;i--)
	{
		myprintf("%02x",p8[i-1],0,0);
	}
	myprintf("\n",0,0,0);
	#endif
	return 1;
}

void Terminal_RealPack(void)
{
	s8 *pc="dateTime(æ•°æ®æ—¶é—´),20000201(Aç›¸ç”µå‹),20000202(Bç›¸ç”µå‹),20000203(Cç›¸ç”µå‹),20010201(Aç›¸ç”µæµ),20010202(Bç›¸ç”µæµ),20010203(Cç›¸ç”µæµ),20010400(é›¶çº¿ç”µæµ),20010500(å‰©ä½™ç”µæµ),20040201(æ€»æœ‰åŠŸåŠŸç‡),20040202(Aç›¸æœ‰åŠŸåŠŸç‡),20040203(Bç›¸æœ‰åŠŸåŠŸç‡),20040204(Cç›¸æœ‰åŠŸåŠŸç‡),43140506(å®¤å¤–æ¸©åº¦),43140505(å®¤å†…æ¸©åº¦),43140501(ç©ºè°ƒè®¾ç½®æ¸©åº¦),43140400(ç©ºè°ƒå¼€å…³æœºçŠ¶æ€),43110502(çƒ­æ°´å™¨åŠ çƒ­æ¸©åº¦),43110400(çƒ­æ°´å™¨å¼€å…³æœºçŠ¶æ€),00100201(æ­£å‘æœ‰åŠŸæ€»ç”µèƒ½),00100203(æ­£å‘æœ‰åŠŸå³°ç”µèƒ½),00100205(æ­£å‘æœ‰åŠŸè°·ç”µèƒ½),00200201(åå‘æœ‰åŠŸæ€»ç”µèƒ½),00200203(åå‘æœ‰åŠŸå³°ç”µèƒ½),00200205(åå‘æœ‰åŠŸè°·ç”µèƒ½)";
	s8 *pc1="]";
	u32 i;
	//u32 x;
	u32 y;
	u32 MAXMETNUM=1;
	u32 CJSONLEN;
	u8 *p8;                               
	u8 *pname;
	u16 *p16;
	//u16 AddrNUM;
	s32 fd;
	ms_Type *ms;	
	ms=(ms_Type *)Get_ms();
	switch (JSON->PackRealJsonTask)
	{
		case 0://³õÊ¼»¯Êı¾İ
			Delet_FileName();//É¾³ıÕâ¸öÊ±¼äµãµÄÎÄ¼ş
			pYYMDHMS_AddS_hex(JSON->Lastrealtime,60);//Ã¿Ö´ĞĞÒ»´Î´ò°üÈÎÎñÖ®ºó ·ÖÖÓ´ò°üµÄÊ±¼ä±êÖ¾¶¼¼Ó1·ÖÖÓ
			JSON->PackRealJsonTask++;
			break;
		case 1://Ê±¼äµÄÅĞ¶Ï	
			//¼ì²éÊÇ²»ÊÇÒòÎªÍ£ÉÏµçÒıÆğµÄ´ò°üÊ§°Ü»òÕßÑ¹ËõÊ§°Ü
			i=Check_pYYMDHMS_hex(JSON->Lastrealtime);
			if(i)
			{
				MW((u32)Comm_Ram->DL698YMDHMS, (u32)JSON->Lastrealtime, sizeof(JSON->Lastrealtime));
			}			
			i=IsTimeTask(JSON->Lastrealtime);//Ö»ÓĞ¹ıÁËÒ»·ÖÖÓ²Å»áÖ´ĞĞÏàÓ¦µÄÈÎÎñ
			switch (i)
			{
				case 1:
					JSON->PackRealJsonTask++;
					JSON->Is_AllRealData=0;
					break;
				case 2:
					MW((u32)Comm_Ram->DL698YMDHMS, (u32)JSON->Lastrealtime, sizeof(JSON->Lastrealtime));
					break;
				case 3:
					JSON->PackRealJsonTask++;
					JSON->Is_AllRealData=1;
					break;
				default:
					break;
			}	
			break;
		case 2://ÊµÊ±ÎÄ¼şÏÈĞ´Ò»¸öÍ·
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:ÊµÊ±Ê±¼ä±êÖ¾\n",(u32)&__func__,(u32)__LINE__,0);
			for(i=0;i<7;i++)
				myprintf("%02x ",JSON->Lastrealtime[i],0,0);
			myprintf("\n",0,0,0);
			#endif
			i=Can_GetVaildMetAddr();
			if(i==0)
			{
				JSON->PackRealJsonTask=0;//ÖØĞÂ¿ªÊ¼×ßÁ÷³Ì
				return;
			}
			JSON->CurRealMetCount=0;
			//ÏÈ´¦ÀíÊµÊ±ÎÄ¼şµÄÍ·
			p8=(u8 *)ms->ms_calloc(4*1024);
			if(!p8)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:malloc¿Õ¼ä²»×ã\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				return ;
			}
			CJSONLEN=0;
			i=HeadStart_JSON(p8+CJSONLEN);
			CJSONLEN+=i;
			i=CreateArrayHead_Json(p8+CJSONLEN, DEBUG_FIRST_SPACENUM);
			CJSONLEN+=i;
			i=CreateDataHead_Json(p8+CJSONLEN, (u8 *)STR_COLOUMNHEAD, DEBUG_SECOND_SPACENUM);
			CJSONLEN+=i;
			i=CreateData_Json(p8+CJSONLEN, (u8 *)pc);
			CJSONLEN+=i;
			i=CreateDataEnd_Json(p8,CJSONLEN);
			CJSONLEN+=i;
			i=CreateArrayEnd_Json(p8, CJSONLEN,DEBUG_FIRST_SPACENUM);
			CJSONLEN+=i;
			i=Str_LF(p8+CJSONLEN);
			CJSONLEN+=i;
			Mkdir_JsonFile(JSONREALPATH);//´´½¨Õâ¸öÎÄ¼ş¼Ğ
			pname=CreateRealJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú()
			fd=ms->link_open((char *)pname,O_RDWR);
			if(-1!=fd)//ÒÑ¾­´æÔÚ¸ÃÎÄ¼ş¾ÍÉ¾³ı
			{
				ms->link_remove((char *)pname);
				#ifdef DEBUG_JSON
				myprintf("\n\n[%s:%d]:É¾³ıÎÄ¼ş:%s \n\n", (u32)&__func__, __LINE__, (u32 )pname);
				#endif
			}
			ms->link_close(fd);
			fd=ms->link_open((char *)pname,O_CREAT|O_RDWR);
			if(-1==fd)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:´´½¨ÎÄ¼şÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				ms->ms_free(p8);
				JSON->PackRealJsonTask=0;//ÖØĞÂ¿ªÊ¼×ßÁ÷³Ì
				return;
			}
			y=ms->link_write(fd,(char *)p8,CJSONLEN);
			if(y==CJSONLEN)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿CJSONLEN=%d\n",(u32)&__func__,(u32)__LINE__,CJSONLEN);
				#endif
				JSON->PackRealJsonTask++;
			}else
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿y=%d\n",(u32)&__func__,(u32)__LINE__,y);
				#endif
			}
			ms->link_close(fd);
			ms->ms_free(p8);
			break;
		case 3://Êı¾İ´¦Àí¹ı³Ì
			while(MAXMETNUM>0)
			{
			MAXMETNUM--;	
			i=GetOneMetAddr((u16 *)&JSON->CurRealMetCount);
			//i=GetOneMetAddr_TEST(JSON->CurRealMetCount);
			if(i==0)//È«²¿±íµØÖ·ÒÑ¾­´ò°ü½áÊø
			{
				//²»ÊÇ´ò°üÈ«Á¿ÎÄ¼ş,ÄÇ¾ÍÊÇÃ»ÓĞ±íÓĞÊı¾İ
				Delet_JsonFile_PATH(JSONREALPATH);
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:Ã»ÓĞÒ»Ö»±íÓĞÊı¾İ\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				JSON->PackRealJsonTask=0;//ÖØĞÂ¿ªÊ¼×ßÁ÷³Ì
				break;
			}
			JSON->CurRealMetCount++;//ÏÂÒ»´ÎÑ­»·¾ÍÕÒÏÂÒ»Ö»±í		
			p16=(u16*)(ADDR_AddrList);
			p16++;	
			p8=(u8 *)ms->ms_calloc(1024*1024);
			if(!p8)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:malloc¿Õ¼ä²»×ã\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				JSON->PackRealJsonTask=0;//ÖØĞÂ¿ªÊ¼×ßÁ÷³Ì
				return;
			}
			CJSONLEN=0;
			i=RealDataPack(p16, p8+CJSONLEN, 0, 15, 1,JSON->Is_AllRealData);
			CJSONLEN+=i;
			i=RealDataPack(p16, p8+CJSONLEN, 0, 1, 1,JSON->Is_AllRealData);
			CJSONLEN+=i;

			if((CJSONLEN>0))
			{
				Mkdir_JsonFile(JSONREALPATH);//´´½¨Õâ¸öÎÄ¼ş¼Ğ
				pname=CreateRealJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú()
				fd=ms->link_open((char *)pname,O_RDWR);
				if(-1==fd)//²»´æÔÚÕâ¸öÎÄ¼ş
				{
					ms->ms_free(p8);
					JSON->PackRealJsonTask=2;
					return;
				}
				ms->link_lseek(fd,0,SEEK_END);
				y=ms->link_write(fd,(char *)p8,CJSONLEN);
				if(y==CJSONLEN)
				{
					#ifdef DEBUG_JSON
					myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿CJSONLEN=%d\n",(u32)&__func__,(u32)__LINE__,CJSONLEN);
					#endif
					JSON->PackRealJsonTask=0xff;
				}else
				{
					#ifdef DEBUG_JSON
					myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿y=%d\n",(u32)&__func__,(u32)__LINE__,y);
					#endif
				}
				ms->link_close(fd);
			}else
			{
				//myprintf("[%s:%d]:Ã»ÓĞÊı¾İ\n",(u32)&__func__,(u32)__LINE__,0);
			}
			ms->ms_free(p8);
			if(JSON->PackRealJsonTask==0xff)
			{
				break;
			}
			}
			break;
		case 4://¿ªÊ¼Ñ¹ËõÁ÷³Ì
			Mkdir_JsonFile(JSONREALPATH);//´´½¨Õâ¸öÎÄ¼ş¼Ğ
			pname=CreateRealJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú()
			fd=ms->link_open((char *)pname,O_RDWR);
			if(-1==fd)//²»´æÔÚÕâ¸öÎÄ¼ş
			{
				JSON->PackRealJsonTask=2;
				return;
			}
			i=ms->link_lseek(fd,0,SEEK_END);
			if(i>1)
			{
				ms->link_lseek(fd,i-2,SEEK_SET);
			}
			y=ms->link_write(fd,pc1,1);
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:y=%d\n",(u32)&__func__,(u32)__LINE__,y);
			#endif
			if(y==1)
			{
				Compress_JSONFile(pname,1024,1);//½«JSONÎÄ¼ş´ò°ü³Étar.gz¸ñÊ½
				//É¾³ıFlashÀïÃæµÄfilename
				SetReportInfo();//ÉèÖÃÉÏ±¨ĞÅÏ¢
			}else
			{
				y=ms->link_write(fd,(char *)p8,1);
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:y=%d\n",(u32)&__func__,(u32)__LINE__,y);
				#endif
				if(y==1)
				{
					Compress_JSONFile(pname,1024,1);//½«JSONÎÄ¼ş´ò°ü³Étar.gz¸ñÊ½
					//É¾³ıFlashÀïÃæµÄfilename
					SetReportInfo();//ÉèÖÃÉÏ±¨ĞÅÏ¢
				}
			}
			JSON->PackRealJsonTask=0;//ÖØĞÂ¿ªÊ¼×ßÁ÷³Ì
			ms->link_close(fd);
			break;
		case 0xff://Êı¾İ´¦Àí¹ı³Ì
			while (MAXMETNUM>0)
			{
			MAXMETNUM--;
			i=GetOneMetAddr((u16 *)&JSON->CurRealMetCount);
			//i=GetOneMetAddr_TEST(JSON->CurRealMetCount);
			if(i==0)//È«²¿±íµØÖ·ÒÑ¾­´ò°ü½áÊø
			{
				JSON->PackRealJsonTask=4;;//¿ªÊ¼Ñ¹Ëõ
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:Êı¾İ´¦ÀíÍê±Ï¿ªÊ¼Ñ¹Ëõ\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				break;
			}
			JSON->CurRealMetCount++;//ÏÂÒ»´ÎÑ­»·¾ÍÕÒÏÂÒ»Ö»±í		
			p16=(u16*)(ADDR_AddrList);
			p16++;	
			p8=(u8 *)ms->ms_calloc(1024*1024);
			if(!p8)
			{
				#ifdef DEBUG_JSON
				myprintf("[%s:%d]:malloc¿Õ¼ä²»×ã\n",(u32)&__func__,(u32)__LINE__,0);
				#endif
				JSON->PackRealJsonTask=0;//ÖØĞÂ¿ªÊ¼×ßÁ÷³Ì
				return ;
			}
			CJSONLEN=0;
			i=RealDataPack(p16, p8+CJSONLEN, 0, 15, 1,JSON->IsCreateFrzJson);
			CJSONLEN+=i;
			i=RealDataPack(p16, p8+CJSONLEN, 0, 1, 1,JSON->IsCreateFrzJson);
			CJSONLEN+=i;

			if(CJSONLEN>0)
			{
				Mkdir_JsonFile(JSONREALPATH);//´´½¨Õâ¸öÎÄ¼ş¼Ğ
				pname=CreateRealJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú()
				fd=ms->link_open((char *)pname,O_RDWR);
				if(-1==fd)//²»´æÔÚÕâ¸öÎÄ¼ş
				{
					ms->ms_free(p8);
					JSON->PackRealJsonTask=2;
					return;
				}
				ms->link_lseek(fd,0,SEEK_END);
				y=ms->link_write(fd,(char *)p8,CJSONLEN);
				if(y==CJSONLEN)
				{
					#ifdef DEBUG_JSON
					myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿CJSONLEN=%d\n",(u32)&__func__,(u32)__LINE__,CJSONLEN);
					#endif
				}else
				{
					#ifdef DEBUG_JSON
					myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿y=%d\n",(u32)&__func__,(u32)__LINE__,y);
					#endif
				}
				ms->link_close(fd);
			}	
			ms->ms_free(p8);
			}
			break;
		default:
			JSON->PackRealJsonTask=0;
		break;
	}		
}

