gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
void Terminal_PackJSON(void)//ÖÕ¶Ë´ò°üJSONÎÄ¼şÈÎÎñ
{
	u32 i;
	if(FileDownload->New==0)//Ô¶³ÌÉı¼¶Íê³É,²»½øÀ´´ò°ü
	{
		return;
	}
	switch (JSON->PackJsonTask)
	{
		case 0://³õÊ¼»¯Êı¾İ
			JSON->IsCreateFrzJson=0;//¸ÕÉÏµçÅĞ¶ÏÕâ¸öÖµ³õÊ¼»¯Îª0
			i=Check_pYYMDHMS_hex(Comm_Ram->DL698YMDHMS);
			if(i)
			{
				return;
			}	
			MW((u32)Comm_Ram->DL698YMDHMS, (u32)JSON->Lastrealtime, sizeof(JSON->Lastrealtime));
			MW((u32)Comm_Ram->DL698YMDHMS, (u32)JSON->reportfiletime, sizeof(JSON->reportfiletime));
			//Mkdir_JsonFile();//´´½¨ÎÄ¼ş¼Ğ
			//TEST_PACK();
			//tar_thread();
			//tar_text();
			//Crl_AllJsonFileAndTar();
			#ifdef DEBUG_JSON
			//log_Flash();
			//test_saveMIN15();
			//test_saveMIN();
			//test_saveDAY();
			#endif
			//TEST_RAM() ;
			//return;
			JSON->PackRealJsonTask=1;//ÊµÊ±´Ó1¿ªÊ¼
			JSON->PackJsonTask++;
			break;
		case 1:
			Terminal_FrzPack();//ÈÕ¶³½áÊı¾İ´ò°ü
			Terminal_RealPack();//ÊµÊ±Êı¾İ´ò°ü
			break;
		default:
			JSON->PackJsonTask=0;
		break;
	}
	
}
		
//=======================================È«ÍøÊµÊ±Êı¾İÉÏ±¨=====================================
void SetReportInfo(void)//ÉÏ±¨ÈÎÎñ´Ó0¿ªÊ¼,¿ÉÒÔÉÏ±¨
{
	JSON->g_ReportFlag=1;
}
u8 GetReportInfo(void)//µÃµ½ÊÇ²»ÊÇĞèÒªÉÏ±¨ÓĞÃ»ÓĞÉú³ÉĞÂµÄÉÏ±¨ÎÄ¼ş
{
	return JSON->g_ReportFlag;	
}
void ClrReportInfo(void)//ÇåµôÉÏ±¨±êÖ¾,ºÍÉÏ±¨ÎÄ¼şÃû
{
	JSON->Reportjsonfile_Task=0;
	JSON->g_ReportFlag=0;
	MC(0,(u32)JSON->RealFileName,sizeof(JSON->RealFileName));
	pYYMDHMS_AddS_hex(JSON->reportfiletime,60);//Ã¿Ö´ĞĞÒ»´Î´ò°üÈÎÎñÖ®ºó ·ÖÖÓ´ò°üµÄÊ±¼ä±êÖ¾¶¼¼Ó1·ÖÖÓ
}
u32 IsReportEnd(void)//ÊÇ²»ÊÇÉÏ±¨³É¹¦,×ÜÉÏ±¨Êı=ÒÑ¾­ÉÏ±¨Êı
{
	if(JSON->g_Block_Number==JSON->g_Need_report_Block)
	{
		return 1;
	}
	return 0;
}
void Next_DataBlock(void)//Ö¸ÏòÏÂÒ»¸öÉÏ±¨µÄÊı¾İ¿é
{
	JSON->g_Block_Number++;
}

u32 Merge_RealTimeData_JsonFile(u8 *ptime)//ºÏ²¢Á½¸öÉÏ±¨Ñ¹ËõÎÄ¼ş³ÉÎªÒ»¸öĞÂµÄÑ¹ËõÎÄ¼ş
{
	u64 YYMDHM1;
	u64 YYMDHM2;
	u32 i;
	u32 n;
	u8 isemptyfile;//Èç¹ûÕÒµ½µÄÊÇµÚÒ»¸öÎÄ¼ş
	u8 *pfilename;
	s32 fd1=-1;
	s32 fd_new=-1;
	u8 *p8;
	//u8 *paddr;
	u32 Len;
	u8 time[7];
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	
	MW((u32)ptime,(u32)time,sizeof(time));
	i=Check_pYYMDHMS_hex(time);
	if(i)
	{
		return 0;
	}
	pYYMDHMS_SubS_hex(time,60);//Ã¿Ö´ĞĞÒ»´Î´ò°üÈÎÎñÖ®ºó
	isemptyfile=1;
	pfilename=GetFileJsonName_Compress(time);//µÃµ½ÎÄ¼şµÄÂ·¾¶	
	fd_new=ms->link_open((char *)pfilename,O_RDWR);
	if(-1==fd_new)
	{
		//´´½¨Ò»¸öĞÂµÄÎÄ¼ş
		p8=GetRealTime_FileJson(time);
		//´´½¨Ò»¸öĞÂµÄÎÄ¼ş,ÎÄ¼şµÄÃû×Ö¸üĞÂµ½×îĞÂµÄ´ò°üÊ±¼ä
		fd_new=ms->link_open((char *)p8,O_CREAT|O_RDWR);
		if(-1==fd_new)
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:´´½¨ÎÄ¼şÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
			#endif
			return 0;
		}
		ms->link_lseek(fd_new,0,SEEK_SET);
		isemptyfile=0;
	}else
	{
		ms->link_close(fd_new);//ÂíÉÏÊÍ·ÅµôÕâ¸öÎÄ¼ş¾ä±ú
		//¿ªÊ¼½âÑ¹Ëõ
		p8=(u8 *)ADDR_DATABUFF+1024;
		Len=0;
		mystrcpy((char *)p8+Len, "tar jxvf ");
		i=mystrlen((const char *)p8+Len);
		Len+=i;
		mystrcpy((char *)p8+Len, (const char *)pfilename);
		i=mystrlen((const char *)p8+Len);
		Len+=i;
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:½âÑ¹ÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);	
		#endif
		ms->link_system((char *)p8);

		p8=GetRealTime_FileJson(time);

		fd_new=ms->link_open((char *)p8,O_RDWR);
		if(-1==fd_new)
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:´´½¨ÎÄ¼şÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
			#endif
			return 0;
		}
		isemptyfile=1;
	}
	
	YYMDHM2=0;
	YYMDHM2=((u64)JSON->reportfiletime[0]<<32)|((u64)JSON->reportfiletime[1]<<40)|((u64)JSON->reportfiletime[2]<<24)|((u64)JSON->reportfiletime[3]<<16)|((u64)JSON->reportfiletime[4]<<8)|((u64)JSON->reportfiletime[5]);
	while(1){
		pYYMDHMS_SubS_hex(time,60);//Ã¿Ö´ĞĞÒ»´Î´ò°üÈÎÎñÖ®ºó ·ÖÖÓ´ò°üµÄÊ±¼ä±êÖ¾¶¼¼Ó1·ÖÖÓ
		YYMDHM1=0;
		YYMDHM1=((u64)time[0]<<32)|((u64)time[1]<<40)|((u64)time[2]<<24)|((u64)time[3]<<16)|((u64)time[4]<<8)|((u64)time[5]);
		
		if(YYMDHM2>YYMDHM1)
		{
			break;
		}	
		//´Ó×î´óµÄÄÇ¸öÊ±¼äµãµÄÎÄ¼ş¿ªÊ¼ÕÒ
		pfilename=GetFileJsonName_Compress(time);//µÃµ½ÎÄ¼şµÄÂ·¾¶	
		fd1=ms->link_open((char *)pfilename,O_RDWR);
		if(-1!=fd1)
		{
			ms->link_close(fd1);//ÂíÉÏÊÍ·ÅµôÕâ¸öÎÄ¼ş¾ä±ú
			//¿ªÊ¼½âÑ¹Ëõ
			p8=(u8 *)ADDR_DATABUFF+1024;
			Len=0;
			mystrcpy((char *)p8+Len, "tar jxvf ");
			i=mystrlen((const char *)p8+Len);
			Len+=i;
			mystrcpy((char *)p8+Len, (const char *)pfilename);
			i=mystrlen((const char *)p8+Len);
			Len+=i;
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:½âÑ¹ÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);	
			#endif
			ms->link_system((char *)p8);
			
			//´ò¿ªÕâ¸öÎÄ¼ş
			p8=GetRealTime_FileJson(time);

			fd1=ms->link_open((char *)p8,O_RDWR);
			if(-1!=fd1)
			{
				Len=ms->link_lseek(fd1,0,SEEK_END);
				if(Len)
				{	
					p8=(u8 *)ms->ms_malloc(Len);
					if(p8)
					{	
						if(0==isemptyfile)//ÕÒµ½ÁËµÚÒ»¸öÎÄ¼ş,//ĞèÒª±£´æËùÓĞµÄÎÄ¼şĞÅÏ¢
						{
							isemptyfile=1;//½ÓÏÂÀ´ÕÒµÄ¶¼²»ÊÇµÚÒ»¸öÎÄ¼ş Òª×öÌØÊâ´¦Àí
							ms->link_lseek(fd1,0,SEEK_SET);
							i=ms->link_read(fd1,(u8 *)p8,Len);
							if(i==Len)
							{
								i=ms->link_write(fd_new,(u8 *)p8,Len);
							}
						}else
						{
							ms->link_lseek(fd1,0,SEEK_SET);
							i=ms->link_read(fd1,(u8 *)p8,Len);	
						
							if(i==Len&&Len>0)
							{
								for(i=0;i<Len-1;i++)
								{
									if(p8[i]==',')
									{
										if(p8[i+1]==0x0A)//»»ĞĞ·ûºÅ
										{
											break;
										}
									}
								}
								if(i<Len)
								{
									n=ms->link_lseek(fd_new,0,SEEK_END);
									if(n>0)
									{
										ms->link_lseek(fd_new,n-1,SEEK_SET);
										Len-=i;
										ms->link_write(fd_new,(u8 *)p8+i,Len);
									}	
								}
								
							}
						}
						ms->ms_free(p8);
						p8=NULL;
					}
				}
				ms->link_close(fd1);//ÂíÉÏÊÍ·ÅµôÕâ¸öÎÄ¼ş¾ä±ú
			}
		}
		
	}
	
	Len=ms->link_lseek(fd_new,0,SEEK_END);
	if(Len)
	{	
		MW((u32)ptime,(u32)JSON->reportfiletime,sizeof(JSON->reportfiletime));
		i=Check_pYYMDHMS_hex(JSON->reportfiletime);
		if(i)
		{
			ms->link_close(fd_new);
			return 0;
		}
		pYYMDHMS_SubS_hex(JSON->reportfiletime,60);//Ã¿Ö´ĞĞÒ»´Î´ò°üÈÎÎñÖ®ºó
		//µÃµ½ĞÂÎÄ¼şµÄÎÄ¼şÃû×Ö
		pfilename=GetRealTime_FileJson_Pack(JSON->reportfiletime);
		
		//Ñ¹ËõĞÂµÄÎÄ¼ş
		p8=(u8 *)ADDR_DATABUFF+1024;
		Len=0;
		mystrcpy((char *)p8+Len, "tar jcvf ");
		i=mystrlen((const char *)p8+Len);
		Len+=i;	
		mystrcpy((char *)p8+Len, (const char *)pfilename);
		i=mystrlen((const char *)p8+Len);
		Len+=i;
		mystrcpy((char *)p8+Len, " ");
		Len++;

		n=mystrlen((const char *)pfilename);
		for(i=0;i<n;i++)
		{
			if(pfilename[i]=='.')
			{
				break;
			}
		}
		if(i>=n)
		{
			ms->link_close(fd_new);
			return 0;
		}
		
		mystrcpy((char *)pfilename+i, ".json");
		mystrcpy((char *)p8+Len, (const char *)pfilename);
		i=mystrlen((const char *)p8+Len);
		Len+=i;
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:½âÑ¹ÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);	
		#endif
		ms->link_system((char *)p8);
		//ÒÆ¶¯ÎÄ¼şµ½ÏàÓ¦µÄÄ¿Â¼ÏÂÃæ
		p8=(u8 *)ADDR_DATABUFF+1024;
		Len=0;
		mystrcpy((char *)p8+Len, "mv *.tar.bz2 ");
		i=mystrlen((const char *)p8+Len);
		Len+=i;	
		mystrcpy((char *)p8+Len, JSONREALPATH);
		i=mystrlen((const char *)p8+Len);
		Len+=i;
		mystrcpy((char *)p8+Len, " -f");
		i=mystrlen((const char *)p8+Len);
		Len+=i;
		ms->link_system((char *)p8);
	}
	//É¾³ıµôµ±Ç°JsonÎÄ¼ş
	
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "rm *.json");
	i=mystrlen((const char *)p8+Len);
	Len+=i;	
	ms->link_system((char *)p8);
	
	ms->link_close(fd_new);
	return 1;
}
   
