gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
u32 Selec_ReportTime(void)//ÉÏ±¨Ê±¼äµÄÉ¾Ñ¡
{
	u32 i;
	u8 time[7];
	i=Compare_DL698DataString(JSON->Lastrealtime,JSON->reportfiletime,6);//Êı¾İ´®±È½Ï(¸ßÎ»ÔÚµÍ×Ö½Ú),p1ºÍp2ÒÑÔÚRAMÖĞ,·µ»Ø:0=ÏàÍ¬,1=²»ÏàÍ¬p1>p2,2=²»ÏàÍ¬p1<p2
	if(i==0)
	{
		return 1;
	}
	if(i==1)
	{
		if(JSON->Lastrealtime[5]==0)
		{
			MR((u32)time,(u32)JSON->reportfiletime,7);
			pYYMDHMS_AddS_hex(time,300);//Ã¿Ö´ĞĞÒ»´Î´ò°üÈÎÎñÖ®ºó ·ÖÖÓ´ò°üµÄÊ±¼ä±êÖ¾¶¼¼Ó1·ÖÖÓ
			i=Compare_DL698DataString(JSON->Lastrealtime,time,6);//Êı¾İ´®±È½Ï(¸ßÎ»ÔÚµÍ×Ö½Ú),p1ºÍp2ÒÑÔÚRAMÖĞ,·µ»Ø:0=ÏàÍ¬,1=²»ÏàÍ¬p1>p2,2=²»ÏàÍ¬p1<p2
			if(i!=2)
			{
				//°ÑÕâ10·ÖÖÓÖ®ÄÚµÄ¶«Î÷Æ´ÔÚÒ»ÆğÉÏ±¨Ò»¸öÎÄ¼ş
				Merge_RealTimeData_JsonFile(JSON->Lastrealtime);
			}
		}
		return 1;
	}
	return 0;
}

u8 *GetFileJsonName(u8 *ptime)//µÃµ½ÉÏ±¨ÎÄ¼şµÄÑ¹Ëõ°üÃû×Ö (²»´øÂ·¾¶)
{
	u32 i;
	//u32 SLen;
	u32 Len;
	u8 *p8;
	u8 *paddr;
	Len=0;
	p8=(u8 *)ADDR_DATABUFF;
	//´ò°üÍê³ÉÖ®ºó´¦ÀíÎÄ¼şµÄÃû×Ö,¹©ÉÏ´«µÄÊ±ºòµ÷ÓÃ
	Len=0;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_REAL);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	Get698Time_Ascii(ptime, p8+Len);
	mystrcpy((char *)p8+Len+12, ".tar.bz2");
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:×éÖ¡ÀïÃæÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);	
	#endif
	return p8;
}

u8 *GetFileJsonName_Compress(u8 *ptime)//µÃµ½ÉÏ±¨ÎÄ¼şÑ¹Ëõ°üµÄÃû×Ö(´ø¾ø¶ÔÂ·¾¶)
{
	
	u32 i;
	//u32 SLen;
	u32 Len;
	u8 *p8;
	u8 *paddr;
	p8=(u8 *)ADDR_DATABUFF;

	Len=0;
	mystrcpy((char *)p8+Len, JSONREALPATH);
	i=mystrlen((const char *)p8);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_REAL);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;	
	Get698Time_Ascii(ptime, p8+Len);
	mystrcpy((char *)p8+Len+12, ".tar.bz2");
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÉÏ±¨ÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	return p8;
}

u8 *GetFrzFileJsonName_Compress(void)//µÃµ½ÉÏ±¨ÎÄ¼şÑ¹Ëõ°üµÄÃû×Ö(´ø¾ø¶ÔÂ·¾¶)
{
	
	u32 i;
	//u32 SLen;
	u32 Len;
	u8 *p8;
	u8 *paddr;
	p8=(u8 *)ADDR_DATABUFF;

	Len=0;
	mystrcpy((char *)p8+Len, JSONFREPATH);
	i=mystrlen((const char *)p8);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_FRE);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	Get698CurTime_Ascii(p8+Len,1);//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë		
	mystrcpy((char *)p8+Len+8, ".tar.gz");
	//myprintf("[%s:%d]:ÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	return p8;
}

u8 *GetRealTime_FileJson(u8 *ptime)//µÃµ½ÉÏ±¨ÎÄ¼şÑ¹Ëõ°üµÄÃû×Ö(´ø¾ø¶ÔÂ·¾¶)
{
	
	u32 i;
	//u32 SLen;
	u32 Len;
	u8 *p8;
	u8 *paddr;
	p8=(u8 *)ADDR_DATABUFF;

	Len=0;
	//mystrcpy((char *)p8+Len, JSONREALPATH);
	//i=mystrlen((const char *)p8);
	//Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_REAL);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Get698CurTime_Ascii(p8+Len);//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë		
	Get698Time_Ascii(ptime, p8+Len);
	mystrcpy((char *)p8+Len+12, ".json");
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÉÏ±¨ÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	return p8;
}

u8 *GetRealTime_FileJson_Pack(u8 *ptime)//µÃµ½ÉÏ±¨ÎÄ¼şÑ¹Ëõ°üµÄÃû×Ö(´ø¾ø¶ÔÂ·¾¶)
{
	
	u32 i;
	//u32 SLen;
	u32 Len;
	u8 *p8;
	u8 *paddr;
	p8=(u8 *)ADDR_DATABUFF;

	Len=0;
	//mystrcpy((char *)p8+Len, JSONREALPATH);
	//i=mystrlen((const char *)p8);
	//Len+=i;
	mystrcpy((char *)p8+Len, JSONFILENAMEHEAD_REAL);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´µØÖ·
	MR(ADDR_DATABUFF+1024,ADDR_4001+1,LENmax_4001-1);
	paddr=(u8 *)ADDR_DATABUFF+1024;
	Add_StrToASCII(p8+Len,paddr+1,paddr[0]);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Ğ´Ê±¼ä
	mystrcpy((char *)p8+Len, "_");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	//Get698CurTime_Ascii(p8+Len);//µÃµ½698µ±Ç°Ê±¼ä×ª»»³ÉascÂë		
	Get698Time_Ascii(ptime, p8+Len);
	mystrcpy((char *)p8+Len+12, ".tar.bz2");
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:ÉÏ±¨ÎÄ¼şµÄÃû×Ö  %s \n",(u32)&__func__,(u32)__LINE__,(u32)p8);
	#endif
	return p8;
}

u32 AnalyzeReportFile(void)//·ÖÎöÉÏ±¨µÄÎÄ¼ş,(ÎÄ¼ş´óĞ¡,ÎÄ¼ş¿é×ÜÊı)
{
	u8 *pfilename;
	s32 fd;
	u32 i;
	u32 filesize;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();

	pfilename=GetFileJsonName_Compress(JSON->reportfiletime);
	if(!pfilename)
	{
		return 0;
	}
	fd=ms->link_open((char *)pfilename,O_RDWR);
	if(-1==fd)
	{
		i=Compare_DL698DataString(JSON->Lastrealtime,JSON->reportfiletime,6);//Êı¾İ´®±È½Ï(¸ßÎ»ÔÚµÍ×Ö½Ú),p1ºÍp2ÒÑÔÚRAMÖĞ,·µ»Ø:0=ÏàÍ¬,1=²»ÏàÍ¬p1>p2,2=²»ÏàÍ¬p1<p2
		if(i==1)
		{
			pYYMDHMS_AddS_hex(JSON->reportfiletime, 60);
		}
		return 0;
	}
	#ifdef DEBUG_JSON
	myprintf("===============¿ªÊ¼·ÖÎöÎÄ¼ş============= \n",0,0,0);
	#endif
	filesize=ms->link_lseek(fd,0,SEEK_END);
	if(0==filesize)
	{
		ms->link_close(fd);
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:ÎÄ¼şÎª¿Õ\n",(u32)&__func__,(u32)__LINE__,0);
		#endif
		return 0;
	}
	JSON->g_Filesize=filesize;
	//ĞèÒªÉÏ´«¿éÊıÁ¿
	JSON->g_Need_report_Block=filesize/REPORT_FILEJSON_DATASIZE;
	//ÖÁÉÙÉÏ´«Ò»¿é
	if(0==JSON->g_Need_report_Block)
	{
		JSON->g_Need_report_Block=1;
	}else
	{
		i=filesize%REPORT_FILEJSON_DATASIZE;
		if(i!=0)
		{
			JSON->g_Need_report_Block++;//³¬³öÕû¿éÔÙ¼ÓÒ»¿é
		}
	}
	JSON->g_Block_Number=0;
	ms->link_close(fd);
	
	return 1;
}

u32 GetCurBlockSize(void)//·µ»ØÕâÒ»¿éÉÏ±¨Êı¾İ´óĞ¡
{
	u32 LEN;
	//07 01 08 f0 01 08 00 02 02 12 00 00 09
	LEN=0;
	if(JSON->g_Filesize>((JSON->g_Block_Number+1)*REPORT_FILEJSON_DATASIZE))
	{
		LEN=REPORT_FILEJSON_DATASIZE;
	}else
	{
		if(JSON->g_Filesize>(JSON->g_Block_Number*REPORT_FILEJSON_DATASIZE))
		{
			LEN=JSON->g_Filesize-(JSON->g_Block_Number*REPORT_FILEJSON_DATASIZE);
		}else
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:´«ÊäĞòºÅ´íÎó JSON->g_Block_Number=%d\n",(u32)&__func__,(u32)__LINE__,JSON->g_Block_Number);
			#endif
			return 0;
		}
	}
	return LEN;
}

u32 GetCurBlockData(u8 *pout,u32 Len)//·µ»ØÉÏ±¨ÕâÒ»¿é¾ßÌåÄÚÈİ
{
	u8 *pfilename;
	s32 fd;
	u32 i;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	if(0==Len)
	{
		return 0;
	}
	//ms->link_system("cd /tmp/real_data");
	pfilename=GetFileJsonName_Compress(JSON->reportfiletime);
	if(!pfilename)
	{
		return 0;
	}
	//fd=ms->link_open((char *)JSON->RealFileName,O_RDONLY);
	fd=ms->link_open((char *)pfilename,O_RDONLY);
	if(-1==fd)
	{
		return 0;
	}
	ms->link_lseek(fd,JSON->g_Block_Number*REPORT_FILEJSON_DATASIZE,SEEK_SET);
	i=ms->link_read(fd,(u8 *)pout,Len);
	if(i!=Len)
	{
		ms->link_close(fd);
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:¶ÁÉÏ±¨ÎÄ¼şÊ§°Ü i=%d\n",(u32)&__func__,(u32)__LINE__,i);
		#endif
		return 0;
	}
	ms->link_close(fd);
	return i;
}

u32 File_HCS(void)//Ëã³öÎÄ¼şµÄĞ£Ñé(Ëã²»³öÀ´ÎÊÌâÓ¦¸ÃÒ²²»ÊÇºÜ´ó)
{
	s32 fd;
	u32 i;
	u32 Len;
	u32 HCS;
	u8 *p8;
	u8 *pfilename;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();	

