gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
	pfilename=GetFileJsonName_Compress(JSON->reportfiletime);
	if(!pfilename)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:È¡ÎÄ¼şÃûÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
		#endif
		return 0;
	}
	fd=ms->link_open((char *)pfilename,O_RDONLY);
	if(-1==fd)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:´ò¿ªÎÄ¼şÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
		#endif
		return 0;
	}
	i=ms->link_lseek(fd,0,SEEK_END);
	p8=(u8 *)ms->ms_malloc(i);
	if(!p8)
	{
		ms->link_close(fd);
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:·ÖÅä¿Õ¼äÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
		#endif
		return 0;
	}
	ms->link_lseek(fd,0,SEEK_SET);
	Len=ms->link_read(fd,(u8 *)p8,i);
	if(Len!=i)
	{
		ms->link_close(fd);
		ms->ms_free(p8);
		p8=NULL;
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:¶ÁÊı¾İ³¤¶È²»¶Ôi=%d,",(u32)&__func__,(u32)__LINE__,i);
		myprintf("Len=%d\n",Len,0,0);
		#endif
		return 0;
	}
	HCS=0xffff;
	for(i=0;i<Len;i++)
	{
		HCS=(HCS >> 8) ^ fcstab[(HCS ^ p8[i]) & 0xff];
	}
	HCS ^= 0xffff; //complement
	
	ms->link_close(fd);
	ms->ms_free(p8);
	p8=NULL;
	return HCS;
}

u32 Report_FileInfo(u16 *pTime,u32 PORTn)//F0010700//Æô¶¯´«Êä
{
	u32 i;
	u32 LEN_Tx;
	u32 LEN_TxAPDU;
	u32 LENmax_TxSPACE;//×î´ó»¹¿É·¢ËÍµÄ×Ö½ÚÊı
	//u8* p8;
	u8* p8tx;
	u8* pfilename;
	UARTCtrl_TypeDef *UARTCtrl;
	ClientConnectInfo_TypeDef *ClientConnectInfo;//¿Í»§»úÁ¬½ÓĞÅÏ¢
	
	
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//×î´ó»¹¿É·¢ËÍµÄ×Ö½ÚÊı
	LENmax_TxSPACE-=TxAPDUOffset+1;//1byteÉÏ±¨ĞÅÏ¢FollowReport OPTIONAL=0 ±íÊ¾Ã»ÓĞ
#if USE_ClientConnectInfo==0//Ê¹ÓÃ¿Í»§»úÁ¬½ÓĞÅÏ¢µÄ¿Í»§»ú×î´ó½ÓÊÕ×Ö½Ú:0=²»Ê¹ÓÃ,1=Ê¹ÓÃ
	ClientConnectInfo=ClientConnectInfo;
#else
	//¿Í»§»ú½ÓÊÕ»º³å³¤¶È
	ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//¿Í»§»úÁ¬½ÓĞÅÏ¢
	i=ClientConnectInfo->LEN_Rx;
	i=R_Inverse(i,2);//¼Ä´æÆ÷Êı¾İµ¹Ğò(¸ßµÍ×Ö½Úµ÷»»),Èë¿Ú:Data=¼Ä´æÆ÷ÖĞÊı¾İ,Byte=Ğèµ¹ĞòµÄ×Ö½ÚÊı;·µ»Ø:µ¹ĞòºóµÄÊı¾İ
	if(i<2048)
	{
		i=2048;
	}
	if(i>(TxAPDUOffset+1))
	{//²»Îª0
		i-=(TxAPDUOffset+1);
		if(LENmax_TxSPACE>i)
		{
			LENmax_TxSPACE=i;
		}
	}
#endif


UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);

//APDU£º88 04 01 01 40 00 02 00 01 1C 07 E0 0B 0E 00 02 00 00 00	
		p8tx+=TxAPDUOffset;//TxAPDU´æ·Å¿ªÊ¼µØÖ·
		p8tx[0]=0x88;//ÉÏ±¨Í¨Öª REPORT-Notification
		p8tx[1]=0x04;//Í¨ÖªÇëÇó¿Í»§»ú·şÎñÉÏ±¨Í¸Ã÷Êı¾İ
		i=UARTCtrl->REPORT_PIID;
		i++;
		i&=0x3f;
		UARTCtrl->REPORT_PIID=i;
		p8tx[2]=i;//PIID
//--------------ÉÏ±¨Æô¶¯´«ÊäÃüÁîÖ¡£¬Ö¡²ÉÓÃ×Ö·û´®¸ñÊ½£¬ÓÉÓÚÆô¶¯´«ÊäÃüÁîÖ¡ÄÚÈİ¹Ì¶¨£¬ËùÓĞ×Ö·û´®µÄ×Ü³¤¶È¿ÉÒÔ¹Ì¶¨------//			
		p8tx[3]=0x81;
		p8tx[4]=0x89;//Æô¶¯´«ÊäÃüÁîÖ¡µÄ×Ö·û´®³¤¶È
		
		p8tx[5]=0x07;//·½·¨7£¬Æô¶¯ÎÄ¼ş´«Êä
		p8tx[6]=0x01;
		p8tx[7]=i;//PIID
		
		p8tx[8]=0xf0;
		p8tx[9]=0x01;
		p8tx[10]=0x07;
		p8tx[11]=0x00;//ÎÄ¼ş´«ÊäOMD=F0010700
		
		p8tx[12]=0x02;
		p8tx[13]=0x03;//²ÎÊı½á¹¹Ìå
		
		p8tx[14]=0x02;
		p8tx[15]=0x06;//ÎÄ¼şĞÅÏ¢½á¹¹Ìå
		
		p8tx[16]=DataType_visible_string;//Ô´ÎÄ¼ş
		p8tx[17]=0x2f;
		LEN_TxAPDU=18;
		LENmax_TxSPACE-=LEN_TxAPDU+2;//±£Áô2byte(1byteÊ±¼ä±êÇ©,1byteÉÏ±¨ĞÅÏ¢FollowReport OPTIONAL£©

		pfilename=GetFileJsonName(JSON->reportfiletime);
		if(!pfilename)
		{
			#ifdef DEBUG_JSON
			myprintf("[%s:%d]:ÎÄ¼ş´«ÊäµÄnameÓĞ´í\n",(u32)&__func__,(u32)__LINE__,0);
			#endif
			return 0;
		}
		i=mystrlen((const char*)pfilename);
		MW((u32 )pfilename,(u32)p8tx+LEN_TxAPDU,i);
		LEN_TxAPDU+=i;
		LENmax_TxSPACE-=i;
		p8tx[LEN_TxAPDU]=DataType_visible_string;//Ä¿±êÎÄ¼ş
		p8tx[LEN_TxAPDU+1]=0x2f;
		LEN_TxAPDU+=2;
		LENmax_TxSPACE-=2;
		
		i=mystrlen((const char*)pfilename);
		MW((u32 )pfilename,(u32)p8tx+LEN_TxAPDU,i);
		LEN_TxAPDU+=i;
		LENmax_TxSPACE-=i;

		p8tx[LEN_TxAPDU]=0x06;//ÎÄ¼ş´óĞ¡
		LEN_TxAPDU++;
		p8tx[LEN_TxAPDU++]=(JSON->g_Filesize>>24)&0xff;
		p8tx[LEN_TxAPDU++]=(JSON->g_Filesize>>16)&0xff;
		p8tx[LEN_TxAPDU++]=(JSON->g_Filesize>>8)&0xff;
		p8tx[LEN_TxAPDU++]=JSON->g_Filesize&0xff;
		LENmax_TxSPACE-=5;

		p8tx[LEN_TxAPDU]=0x04;//ÎÄ¼şÊôĞÔ
		p8tx[LEN_TxAPDU+1]=0x08;//³¤¶È
		p8tx[LEN_TxAPDU+2]=0x80;
		LEN_TxAPDU+=3;
		LENmax_TxSPACE-=3;
		
		p8tx[LEN_TxAPDU]=0x0a;
		p8tx[LEN_TxAPDU+1]=0x04;
		p8tx[LEN_TxAPDU+2]=0x56;
		p8tx[LEN_TxAPDU+3]=0x31;
		p8tx[LEN_TxAPDU+4]=0x2e;
		p8tx[LEN_TxAPDU+5]=0x30;
		LEN_TxAPDU+=6;
		LENmax_TxSPACE-=6;
		//
		p8tx[LEN_TxAPDU]=0x16;
		p8tx[LEN_TxAPDU+1]=0;
		LEN_TxAPDU+=2;
		LENmax_TxSPACE-=2;
		
		p8tx[LEN_TxAPDU]=0x12;//´«Êä¿é´óĞ¡
		p8tx[LEN_TxAPDU+1]=REPORT_FILEJSON_DATASIZE/256;
		p8tx[LEN_TxAPDU+2]=REPORT_FILEJSON_DATASIZE%256;
		LEN_TxAPDU+=3;
		LENmax_TxSPACE-=3;
		
		p8tx[LEN_TxAPDU]=0x02;//Ğ£Ñé
		p8tx[LEN_TxAPDU+1]=0x02;
		LEN_TxAPDU+=2;
		LENmax_TxSPACE-=2;
		
		p8tx[LEN_TxAPDU]=0x16;
		p8tx[LEN_TxAPDU+1]=0;
		p8tx[LEN_TxAPDU+2]=0x09;
		p8tx[LEN_TxAPDU+3]=0x02;
		//¼ÆËãĞ£Ñé
		i=File_HCS();
		p8tx[LEN_TxAPDU+4]=(i>>8)&0xff;
		p8tx[LEN_TxAPDU+5]=i&0xff;
		p8tx[LEN_TxAPDU+6]=0x0;
		LEN_TxAPDU+=7;
		LENmax_TxSPACE-=7;
		
		p8tx[LEN_TxAPDU+0]=0;//Ê±¼ä±êÇ©
		p8tx[LEN_TxAPDU+1]=0;//ÉÏ±¨ĞÅÏ¢FollowReport OPTIONAL
		LEN_TxAPDU+=2;
		LENmax_TxSPACE-=2;

//----------------Æô¶¯´«ÊäEND------------------------// 		

			p8tx-=TxAPDUOffset;//TxAPDU´æ·Å¿ªÊ¼µØÖ·
			p8tx[0]=0x68;
			//2byte³¤¶ÈÓòL
			p8tx[3]=0x83;//¿ØÖÆÓòC
			p8tx[4]=5;//TSA
			MR((u32)p8tx+5,ADDR_4001+2,6);
			Data_Inverse((u32)p8tx+5,6);//Êı¾İµ¹Ğò(¸ßµÍ×Ö½Úµ÷»»),Èë¿ÚLe>=2
			p8tx[11]=0;//¿Í»§»úµØÖ·CA
			//2byteÖ¡Í·Ğ£ÑéHCS
			MR((u32)p8tx+14,(u32)p8tx+TxAPDUOffset,LEN_TxAPDU);
			//2byteĞ£Ñé
			LEN_Tx=14+LEN_TxAPDU+2;
			p8tx[LEN_Tx]=0x16;
			LEN_Tx++;
			UARTCtrl->TxByte=LEN_Tx;
			LEN_Tx-=2;
			p8tx[1]=(LEN_Tx)&0xff;
			p8tx[2]=(LEN_Tx>>8)&0xff;

			Uart_698_HCSFCS(p8tx);//ÕûÖ¡Ğ£Ñé¼ÆËã(HCSºÍFCS),Í¬Ê±¼Ó½áÊø0x16;·µ»Ø0=ÕıÈ·£¬1=´íÎó

			UARTCtrl->Task=2;//2=µÈ´ıµ¥Ö¡Êı¾İ·¢ËÍ
			//·¢ËÍÖ¡»º´æÔÚDataBuff+LEN_UARTnTx,ÓÃÒÔÖØ·¢
			i=Get_ADDR_UARTnFnDataBuff(PORTn);//µÃµ½UART³­±íÊı¾İ»º³åµØÖ·
			i+=Get_LEN_UARTnTx(PORTn);
			MW((u32)p8tx,i,LEN_Tx+2);
			//ÉÏ±¨ÏìÓ¦³¬Ê±Ê±¼ä	TI
			pTime[0]=0;//Ä¬ÈÏ×îĞ¡Öµ
			UARTCtrl->REPORT_OVER_SECOND=0;//ÉÏ±¨ÏìÓ¦³¬Ê±Ê±¼ä¼Ä´æ
			UARTCtrl->REPORT_NUMmax=0;//ÈôÖ÷Õ¾Ã»Ó¦´ğ×î´ó»¹ĞèÖØ·¢ÉÏ±¨´ÎÊı,Ã¿ÉÏ±¨1´Î¼õ1
			UARTCtrl->HostACK=8;//Ö÷¶¯ÉÏ±¨ĞèÖ÷Õ¾È·ÈÏÖ¡±ê¼Ç:0=ÎŞ,1=µÇÂ¼Ö¡,2=ÍË³öµÇÂ¼Ö¡,3=ĞÄÌøÖ¡,4=ÖØÒªÊÂ¼ş,5=¶¨Ê±ÈÎÎñ,6=µçÄÜ±íÊÂ¼ş,7=ÖÕ¶ËÇëÇóÖ÷Õ¾Ê±ÖÓ
			//×î´óÉÏ±¨´ÎÊı
			#ifdef DEBUG_JSON
			myprintf("======================ÔöÁ¿ÉÏ±¨×Ö½ÚÊı:%d==========\n",UARTCtrl->TxByte,0,0);
			//create_file();
			for(i=0;i<UARTCtrl->TxByte;i++)
				myprintf("%02x ",p8tx[i],0,0);
			myprintf("\n",0,0,0);
			#endif
			return 1;
}

