gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
u32 Report_FileData(u16 *pTime,u32 PORTn)//F0010800//ÉÏ±¨Êı¾İÄÚÈİ
{
	u8 *p8tx;
	u32 i;
	u32 LEN_Tx;
	u32 LEN_TxAPDU;
	u16 filesize;
	u32 LENmax_TxSPACE;
	UARTCtrl_TypeDef *UARTCtrl;
	ClientConnectInfo_TypeDef* ClientConnectInfo;
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
	LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//×î´ó»¹¿É·¢ËÍµÄ×Ö½ÚÊı
	LENmax_TxSPACE-=TxAPDUOffset+1;//1byteÉÏ±¨ĞÅÏ¢FollowReport OPTIONAL=0 ±íÊ¾Ã»ÓĞ
	#if USE_ClientConnectInfo==0//Ê¹ÓÃ¿Í»§»úÁ¬½ÓĞÅÏ¢µÄ¿Í»§»ú×î´ó½ÓÊÕ×Ö½Ú:0=²»Ê¹ÓÃ,1=Ê¹ÓÃ
	ClientConnectInfo=ClientConnectInfo;
	#else
		//¿Í»§»ú½ÓÊÕ»º³å³¤¶È
		ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//¿Í»§»úÁ¬½ÓĞÅÏ¢
		i=ClientConnectInfo->LEN_Rx;
		i=R_Inverse(i,2);//¼Ä´æÆ÷Êı¾İµ¹Ğò(¸ßµÍ×Ö½Úµ÷»»),Èë¿Ú:Data=¼Ä´æÆ÷ÖĞÊı¾İ,Byte=Ğèµ¹ĞòµÄ×Ö½ÚÊı;·µ»Ø:µ¹ĞòºóµÄÊı¾İ
		if(i<2048)
		{
			i=2048;
		}
		if(i>(TxAPDUOffset+1))
		{//²»Îª0
			i-=(TxAPDUOffset+1);
			if(LENmax_TxSPACE>i)
			{
				LENmax_TxSPACE=i;
			}
		}
	#endif
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);

	p8tx+=TxAPDUOffset;//TxAPDU´æ·Å¿ªÊ¼µØÖ·
	LEN_TxAPDU=0;
	p8tx[LEN_TxAPDU++]=0x88;
	p8tx[LEN_TxAPDU++]=0x04;
	i=UARTCtrl->REPORT_PIID;
	i++;
	i&=0x3f;
	UARTCtrl->REPORT_PIID=i;
	p8tx[LEN_TxAPDU++]=i;//PIID
	
	filesize=GetCurBlockSize();
	//³¤¶È
	if(256>16+filesize)
	{
		p8tx[LEN_TxAPDU++]=0x81;//
		p8tx[LEN_TxAPDU++]=16+filesize;//³¤¶È
	}else
	{		
		p8tx[LEN_TxAPDU++]=0x82;//
		p8tx[LEN_TxAPDU++]=(17+filesize)>>8;//³¤¶È
		p8tx[LEN_TxAPDU++]=(17+filesize)&0xff;//³¤¶È	
	}
	
	p8tx[LEN_TxAPDU++]=0x07;
	p8tx[LEN_TxAPDU++]=0x01;
	p8tx[LEN_TxAPDU++]=i;

	p8tx[LEN_TxAPDU++]=0xf0;
	p8tx[LEN_TxAPDU++]=0x01;
	p8tx[LEN_TxAPDU++]=0x08;
	p8tx[LEN_TxAPDU++]=0x00;

	p8tx[LEN_TxAPDU++]=0x02;
	p8tx[LEN_TxAPDU++]=0x02;
	p8tx[LEN_TxAPDU++]=0x12;
	p8tx[LEN_TxAPDU++]=JSON->g_Block_Number>>8;
	p8tx[LEN_TxAPDU++]=JSON->g_Block_Number&0xff;

	p8tx[LEN_TxAPDU++]=0x09;
	if(LENmax_TxSPACE<LEN_TxAPDU+REPORT_FILEJSON_DATASIZE)
	{
		#ifdef DEBUG_JSON
		myprintf("[%s:%d]:×Ö·û³¤¶È³¬\n",(u32)&__func__,(u32)__LINE__,0);
		#endif
		return 0;
	}
	LENmax_TxSPACE-=(LEN_TxAPDU+REPORT_FILEJSON_DATASIZE);
	//´ÓÎÄ¼şÖĞÌáÈ¡Êı×Ö
	#ifdef DEBUG_JSON
	myprintf("[%s:%d]:×Ö·û³¤¶Èfilesize=%d\n",(u32)&__func__,(u32)__LINE__,filesize);
	#endif
	if(filesize<256)
	{
		p8tx[LEN_TxAPDU++]=0x81;
		p8tx[LEN_TxAPDU++]=filesize;
	}else
	{
		p8tx[LEN_TxAPDU++]=0x82;
		p8tx[LEN_TxAPDU++]=filesize/256;
		p8tx[LEN_TxAPDU++]=filesize%256;
	}
	GetCurBlockData(p8tx+LEN_TxAPDU,filesize);
	LEN_TxAPDU+=filesize;	
	p8tx[LEN_TxAPDU++]=0;
	
	p8tx[LEN_TxAPDU++]=0;//Ê±¼ä±êÇ©
	p8tx[LEN_TxAPDU++]=0;//ÉÏ±¨ĞÅÏ¢FollowReport OPTIONAL
				
	//----------------Æô¶¯´«ÊäEND------------------------//			

	p8tx-=TxAPDUOffset;//TxAPDU´æ·Å¿ªÊ¼µØÖ·
	p8tx[0]=0x68;
	//2byte³¤¶ÈÓòL
	p8tx[3]=0x83;//¿ØÖÆÓòC
	p8tx[4]=5;//TSA
	MR((u32)p8tx+5,ADDR_4001+2,6);
	Data_Inverse((u32)p8tx+5,6);//Êı¾İµ¹Ğò(¸ßµÍ×Ö½Úµ÷»»),Èë¿ÚLe>=2
	p8tx[11]=0;//¿Í»§»úµØÖ·CA
	//2byteÖ¡Í·Ğ£ÑéHCS
	MR((u32)p8tx+14,(u32)p8tx+TxAPDUOffset,LEN_TxAPDU);
	//2byteĞ£Ñé
	LEN_Tx=14+LEN_TxAPDU+2;
	p8tx[LEN_Tx]=0x16;
	LEN_Tx++;
	UARTCtrl->TxByte=LEN_Tx;
	LEN_Tx-=2;
	p8tx[1]=(LEN_Tx)&0xff;
	p8tx[2]=(LEN_Tx>>8)&0xff;
	
	Uart_698_HCSFCS(p8tx);//ÕûÖ¡Ğ£Ñé¼ÆËã(HCSºÍFCS),Í¬Ê±¼Ó½áÊø0x16;·µ»Ø0=ÕıÈ·£¬1=´íÎó
	
	UARTCtrl->Task=2;//2=µÈ´ıµ¥Ö¡Êı¾İ·¢ËÍ
	//·¢ËÍÖ¡»º´æÔÚDataBuff+LEN_UARTnTx,ÓÃÒÔÖØ·¢
	i=Get_ADDR_UARTnFnDataBuff(PORTn);//µÃµ½UART³­±íÊı¾İ»º³åµØÖ·
	i+=Get_LEN_UARTnTx(PORTn);
	MW((u32)p8tx,i,LEN_Tx+2);
	//ÉÏ±¨ÏìÓ¦³¬Ê±Ê±¼ä  TI
	pTime[0]=0;//Ä¬ÈÏ×îĞ¡Öµ
	UARTCtrl->REPORT_OVER_SECOND=0;//ÉÏ±¨ÏìÓ¦³¬Ê±Ê±¼ä¼Ä´æ
	UARTCtrl->REPORT_NUMmax=0;//ÈôÖ÷Õ¾Ã»Ó¦´ğ×î´ó»¹ĞèÖØ·¢ÉÏ±¨´ÎÊı,Ã¿ÉÏ±¨1´Î¼õ1
	UARTCtrl->HostACK=8;//Ö÷¶¯ÉÏ±¨ĞèÖ÷Õ¾È·ÈÏÖ¡±ê¼Ç:0=ÎŞ,1=µÇÂ¼Ö¡,2=ÍË³öµÇÂ¼Ö¡,3=ĞÄÌøÖ¡,4=ÖØÒªÊÂ¼ş,5=¶¨Ê±ÈÎÎñ,6=µçÄÜ±íÊÂ¼ş,7=ÖÕ¶ËÇëÇóÖ÷Õ¾Ê±ÖÓ,8·ÖÖÓÉÏ±¨ÈÎÎñ
	#ifdef DEBUG_JSON
	myprintf("======================ÔöÁ¿ÉÏ±¨×Ö½ÚÊı:%d==========\n",LEN_Tx,0,0);
	for(i=0;i<UARTCtrl->TxByte;i++)
		myprintf("%02x ",p8tx[i],0,0);
	myprintf("\n",0,0,0);
	#endif
	return 1;
}

u32 Report_JsonFile(u16 *pTime,u32 PORTn)//PORTn¶Ë¿ÚºÅ,pTime¶Ë¿Ú³¬Ê±Ê±¼ä
{
	//u16 *p16time;
	u32 i;
	u32 ret;
	ret=0;
	if(FileDownload->New==0)//Ô¶³ÌÉı¼¶Íê³É,ÉÏ±¨Í£Ö¹
	{
		return ret;
	}
	i=Check_pYYMDHMS_hex(JSON->reportfiletime);
	if(i)
	{
		return ret;
	}
	i=Check_pYYMDHMS_hex(JSON->Lastrealtime);
	if(i)
	{
		return ret;
	}
	#ifdef DEBUG_JSON
	myprintf("===============½øÈëÉÏ±¨µÄ³ÌĞòJSON->Reportjsonfile_Task = %d============= \n",JSON->Reportjsonfile_Task,0,0);
	#endif
	switch(JSON->Reportjsonfile_Task)
	{
		case 0://·ÖÎöÉÏ±¨ÎÄ¼ş
		//´Ó½ñÌìµÄµÚÒ»¸öÉú³ÉµÄÎÄ¼ş¿ªÊ¼ÉÏ±¨	
			i=Selec_ReportTime();
			if(0==i)
			{
				return ret;
			}
			i=AnalyzeReportFile();
			if(i)
			{
				#ifdef DEBUG_JSON
				myprintf("===============·ÖÎöÎÄ¼ş³É¹¦,ÏÂÃæ¿ªÊ¼ÉÏ´«ÎÄ¼ş============= \n",0,0,0);
				#endif
				JSON->Reportjsonfile_Task++;
				ret=1;
			}
			break;
		case 1://Æô¶¯´«Êä
			i=Report_FileInfo(pTime,PORTn);
			if(i)
			{
				JSON->Reportjsonfile_Task++;
				ret=1;
			}else
			{
				//ÉÏ±¨Ê§°ÜµÄÊ±ºò,ÉÏ±¨Ê±¼äĞèÒª¼ÓÒ»Ìø¹ıÕâ¸öÎÄ¼ş,²»È»Ò»Ö±ËÀÑ­»·
				ClrReportInfo();
			}
			break;
		case 2://ÉÏ´«ÎÄ¼ş
			#ifdef DEBUG_JSON
			myprintf("===============¿ªÊ¼ÉÏ´«ÎÄ¼ş============= \n",0,0,0);
			#endif
			i=Report_FileData(pTime,PORTn);
			if(i)
			{
				Next_DataBlock();
				if(IsReportEnd())//½áÊøÁË
				{
					#ifdef DEBUG_JSON
					myprintf("===============ÉÏ´«ÎÄ¼ş³É¹¦============= \n",0,0,0);
					#endif
					ClrReportInfo();
				}
				ret=1;
			}else
			{
				ClrReportInfo();
			}
			break;
		default:
			JSON->Reportjsonfile_Task=0;
		break;
	}
	return ret;
}
/*
void tar_text(void)
{
	
	u32 i;
	u32 SLen;
	u32 size;
	u8 *p8;

	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	
	p8=(u8 *)ADDR_DATABUFF;
	//while(1)
	{
		SLen=0;
		mystrcpy((char *)p8+SLen, "tar zcvf ");
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		mystrcpy((char *)p8+SLen, "111.tar.gz ");
		i=mystrlen((const char *)p8+SLen);
		SLen+=i;
		mystrcpy((char *)p8+SLen, "/usr/app/frz_data/");
		size=ms->ms_malloc_sizemax();
		//p8=(u8 *)ms->ms_malloc(13*1024*1024);
		//if(!p8)
		{
			//return;
		}
		myprintf("size=%d\n",size,0,0);
		
