gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
		myprintf("¿ªÊ¼Ñ¹Ëõ \n",0,0,0);
		myprintf("[%s:%d]:ÃüÁî %s\n",(u32)&__func__,(u32)__LINE__,(u32)p8);
		ms->link_system((char *)p8);
		myprintf("Ñ¹Ëõ½áÊø \n",0,0,0);
		//ms->link_sleep(1);
	}
}

void save(u8 *pbuf,u32 FileID)
{
	u32 i;
	u32 x;
	u32 y;
	//u32 FileID;
	//u32 EventID;//ÊÂ¼ş¹ØÁªµÄID
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	RecordFileHead_TypeDef* RecordFileHead;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	//u8* p8;
	//UARTCtrl_TypeDef *UARTCtrl;
	Comm_Ram->msFILEchange=0;//ÎÄ¼ş¹ÜÀíÊı¾İ±ä»¯:0=±ä»¯,!=Ã»±ä»¯
	ms=Get_ms();
	//UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	//FileID=Get_FileID(PORTn);//UART¸÷ÈÎÎñµÄFileID=b31-b28·½°¸ÀàĞÍ,b27-b24²É¼¯ÀàĞÍ,b23-b20´æ´¢Ê±±êÀàĞÍ,b19-b12ÈÎÎñºÅ,b11-b8¶Ë¿ÚºÅ,b7-b0ÎÄ¼ş·ÖÀà
	Comm_Ram->msFILESearchCount=0;

		if((FileID==0x13f12000)||(FileID==0x13f17000))
		{	
			filename=Get_RecordFileName_JS(FileID,0xffffffff,pbuf+8);//Ì‘Ì·Ï„İ¾Ä»:É«à ?FileID=b31-b28×½Ğ¸`Ñ,b27-b24Ó‰Ü¯`Ñ,b23-b20Õ¦Ô¢Ê±Òª`Ñ,b19-b12ÉÏ±Û…,b11-b8×‹à šÛ?b7-b0,Ğ Ó¦Ô²ÖµÎª0xFÒ­Ê¾Ò»Ú˜×¢,pTimeË½ßÕ¦Ô¢Ê±Òª=0Ò­Ê¾Ò»Ú˜×¢;SearchCount=ßªÊ¼Ì‘Ì·Ö„Ï„İ¾Û…0xFFFFFFFFÒ­Ê¾Õ“ÊÕŞ¡Ë¸Û…ßªÊ¼Ì‘Ì·;×µÜ˜:0--(FILENAMEmax_FLASH-1)Ò­Ê¾Ï„İ¾ÕšFLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)Ò­Ê¾Ï„İ¾ÕšRAM,0xffffffffÒ­Ê¾Ã»Ö’Õ½
		}
		else
		{
			filename=Get_RecordFileName_JS(FileID,0xffffffff,pbuf+22);//Ì‘Ì·Ï„İ¾Ä»:É«à ?FileID=b31-b28×½Ğ¸`Ñ,b27-b24Ó‰Ü¯`Ñ,b23-b20Õ¦Ô¢Ê±Òª`Ñ,b19-b12ÉÏ±Û…,b11-b8×‹à šÛ?b7-b0,Ğ Ó¦Ô²ÖµÎª0xFÒ­Ê¾Ò»Ú˜×¢,pTimeË½ßÕ¦Ô¢Ê±Òª=0Ò­Ê¾Ò»Ú˜×¢;SearchCount=ßªÊ¼Ì‘Ì·Ö„Ï„İ¾Û…0xFFFFFFFFÒ­Ê¾Õ“ÊÕŞ¡Ë¸Û…ßªÊ¼Ì‘Ì·;×µÜ˜:0--(FILENAMEmax_FLASH-1)Ò­Ê¾Ï„İ¾ÕšFLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)Ò­Ê¾Ï„İ¾ÕšRAM,0xffffffffÒ­Ê¾Ã»Ö’Õ½
		}

		//log_Flash();

	
	if(filename!=0xffffffff)
	{
		if(filename<FILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
		}
		else
		{
			file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
		}
		y=file->NUM_DATA;//ÎÄ¼ş´æÈëÊı¾İ¸öÊı¼ÆÊı(Í¬³­±í³É¹¦¸öÊı)
		if(y>NUM_RMmax)
		{
			y=NUM_RMmax;
		}
		ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
		RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
		Addr0=pbuf[0]|(pbuf[1]<<8);
		Addr1=pbuf[2]|(pbuf[3]<<8);
		Addr2=pbuf[4]|(pbuf[5]<<8);
		for(i=0;i<y;i++)
		{
			if(RecordFileHead->Addr0==Addr0)
			{
				if(RecordFileHead->Addr1==Addr1)
				{
					if(RecordFileHead->Addr2==Addr2)
					{
						break;
					}
				}
			}
			RecordFileHead++;
		}
		if(i<y)
		{//µØÖ·ÒÑ´æÔÚ
			if((FileID==0x13f12000)||(FileID==0x13f17000))
			{
				;
			}else
			{
				return;//²¹³­ÇúÏßµÈÊı¾İÊ±¿ÉÄÜ»áÖØ¸´,¹Ê²»ÄÜÉ¾³ıÎÄ¼ş
			}
		}
	}
	if(filename==0xffffffff)
	{//Ã»ÕÒµ½

		{//FLASHÎÄ¼ş	
			while(1)
			{
				file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
				for(filename=0;filename<recordFILENAMEmax_FLASH;filename++)
				{
					if(file->BLOCK_ENTRY==0)
					{
						break;
					}
					file++;
				}
				if(filename>=recordFILENAMEmax_FLASH)
				{//Ã»¿Õ
					//myprintf("[%s:%d]:¿ªÊ¼Ö´ĞĞÉ¾³ıÃüÁî\n",(u32)&__func__,(u32)__LINE__,0);
					i=AutoDeleteFile(0);//×Ô¶¯É¾³ı¼ÇÂ¼ÎÄ¼ş(×Ô¶¯¼õÉÙ´æ´¢Éî¶È);Èë¿Ú:Ğ´ÈëÎÄ¼şÊ±¿Õ¼ä²»¹»µÄÎÄ¼şÃû,ÒÔÅĞ±ğÊÇRAM»¹ÊÇFLASH¿Õ¼ä²»¹»;·µ»Ø:0=Ã»É¾³ı,1=ÓĞÉ¾³ı
					if(i)
					{//ÓĞÉ¾³ı
						continue;
					}
					return;
				}
				break;
			}
		}
	}
	if(file->BLOCK_ENTRY==0)
	{//¿ÕÎÄ¼ş
		ms->msfile_lenclear(filename);//Çå0ÎÄ¼şÏà¹ØµÄ³¤¶È´ÎÊı,0-(FILENAMEmax_FLASH-1)±íÊ¾ÎÄ¼şÔÚFLASH,FILENAMEmax_FLASH-(FILENAMEmax_RAM-1)±íÊ¾ÎÄ¼şÔÚRAM
		file->FILEID=FileID;
		file->FILECOUNT=0;

			file->LEN_DATA=0;
			file->NUM_DATA=0;
			if((FileID==0x13f12000)||(FileID==0x13f17000))
			{
				MW((u32)pbuf+8,(u32)&file->save_date_time_s,7);//²É¼¯´æ´¢Ê±±ê
				MW((u32)pbuf+15,(u32)&file->start_date_time_s,7);//²É¼¯Æô¶¯Ê±¼ä
			}else
			{
				MW((u32)pbuf+22,(u32)&file->save_date_time_s,7);//²É¼¯´æ´¢Ê±±ê
				MW((u32)pbuf+8,(u32)&file->start_date_time_s,7);//²É¼¯Æô¶¯Ê±¼ä
			}
	}
//Ğ´ÎÄ¼ş
	x=file->NUM_DATA;
	if(x>=NUM_RMmax)
	{//´í
		ms->msfile_Delete(filename);
		return;
	}
	//Ğ´Êı¾İ
	if(filename>=FILENAMEmax_FLASH)
	{//RAMÖĞÎÄ¼ş
		i=ms->ms_malloc_sizemax();//×î´ó¿É·ÖÅäµÄ³ß´ç(×Ö½ÚÊı)
		if(i<(1024*1024))
		{//¿Õ¼ä<1M,±£ÁôÖÁÉÙ1M¿Õ¼äÓÃÓÚ¼ÇÂ¼Êı¾İ¶ÁÈ¡
			y=AutoDeleteFile(filename);//×Ô¶¯É¾³ı¼ÇÂ¼ÎÄ¼ş(×Ô¶¯¼õÉÙ´æ´¢Éî¶È);Èë¿Ú:Ğ´ÈëÎÄ¼şÊ±¿Õ¼ä²»¹»µÄÎÄ¼şÃû,ÒÔÅĞ±ğÊÇRAM»¹ÊÇFLASH¿Õ¼ä²»¹»;·µ»Ø:0=Ã»É¾³ı,1=ÓĞÉ¾³ı
			if(y==0)
			{//Ã»É¾³ı
				return;
			}
		}
	}
	i=file->LEN_DATA;
	if(i==0)
	{
		i=(NUM_RMmax*sizeof(RecordFileHead_TypeDef));
	}
	RecordFileHead=(RecordFileHead_TypeDef*)pbuf;
	//myprintf("[%s:%d]:RecordFileHead->Addr0=%04x\n ",(u32)&__func__,(u32)__LINE__,RecordFileHead->Addr0);
	///myprintf("[%s:%d]:RecordFileHead->Addr1=%04x\n ",(u32)&__func__,(u32)__LINE__,RecordFileHead->Addr1);
	//myprintf("[%s:%d]:RecordFileHead->Addr2=%04x\n ",(u32)&__func__,(u32)__LINE__,RecordFileHead->Addr2);
	//myprintf("[%s:%d]:RecordFileHead->LEN_DATA=%04x\n ",(u32)&__func__,(u32)__LINE__,RecordFileHead->LEN_DATA);

	while(1)
	{
		y=RecordFileHead->LEN_DATA;
		y=ms->msfile_write(filename,i,pbuf+sizeof(RecordFileHead_TypeDef),y);
		if(y!=RecordFileHead->LEN_DATA)
		{//Ğ´´íÎó
			y=AutoDeleteFile(filename);//×Ô¶¯É¾³ı¼ÇÂ¼ÎÄ¼ş(×Ô¶¯¼õÉÙ´æ´¢Éî¶È);Èë¿Ú:Ğ´ÈëÎÄ¼şÊ±¿Õ¼ä²»¹»µÄÎÄ¼şÃû,ÒÔÅĞ±ğÊÇRAM»¹ÊÇFLASH¿Õ¼ä²»¹»;·µ»Ø:0=Ã»É¾³ı,1=ÓĞÉ¾³ı
			if(y)
			{//ÓĞÉ¾³ı
				continue;
			}
			return;
		}
		break;
	}
	i+=y;
	file->LEN_DATA=i;
	
	//Ğ´µØÖ·ÁĞ±í
	ms->msfile_write(filename,x*sizeof(RecordFileHead_TypeDef),pbuf,sizeof(RecordFileHead_TypeDef));
	//Êı¾İÊı+1
	x++;
	file->NUM_DATA=x;
	//myprintf("[%s:%d]:Ğ´ÈëFlash³É¹¦\n",(u32)&__func__,(u32)__LINE__,0);

}

u32 MoreThan_StackLen(u32 LENMAX)
{
	return 0;
}
u32 GetOneMetAddr_TEST(u16 *MetCount)
{
	u8 *p8;
	u16 *p16;
	u32 i;
	u16 Met=*MetCount;
	p16=(u16*)(ADDR_AddrList+2);
	for(;Met<TEST_METNUM;Met++)
	{	
		//i=bcd_hex((Met)+1);
		i=Met;
		//myprintf("i=%d \n",i,0,0);
		p16[0]=(i&0xff)|(i>>8)&0xff;
		p16[1]=(i>>16)&0xff|(i>>24)&0xff;
		p16[2]=0;
		p16+=3;
		break;
	}
	if((Met)>=TEST_METNUM)
	{
		p16[0]=0;
		return 0;
	}
	*MetCount=Met;
	p16=(u16*)ADDR_AddrList;
	p16[0]=1;
	p8=(u8 *)(ADDR_AddrList+2);
	for(i=6;i>0;i--)
	{
		myprintf("%02x",p8[i-1],0,0);
	}
	myprintf("\n",0,0,0);
	return 1;
}
 */
u32 CalCulate_Space(const char *path)
{
	return 8*1024*1024;
}

void Delet_RAM_FrzFile(void)
{
	u32 i;
	u32 Len;
	u8 *p8;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	p8=(u8 *)ADDR_DATABUFF;
	Len=0;
	mystrcpy((char *)p8+Len, "rm ");
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	mystrcpy((char *)p8+Len, JSONFREPATH_RAM);
	i=mystrlen((const char *)p8+Len);
	Len+=i;
	p8[Len++]='*';
	p8[Len]=0;
	ms->link_system((char *)p8);
}

u32  Copy_RamToFlash(s32 fd)
{
	s32 fd1;
	u32 i;
	u32 filelen;
	u32 x;
	u32 y;
	u8 *p8;
	u8 *pname;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	Mkdir_JsonFile(JSONFREPATH);
	pname=CreateFreJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
	fd1=ms->link_open((char *)pname,O_RDWR);
	if(fd1==-1)//ÄÜÕÒµ½Õâ¸öÎÄ¼ş
	{
		fd1=ms->link_open((char *)pname,O_CREAT|O_RDWR);
		if(fd1==-1)
		{
			return 1;
		}
	}
		ms->link_lseek(fd1,0,SEEK_END);
		p8=(u8 *)ms->ms_malloc(RAMTOFLASH_COPYONESIZE);
		if(!p8)
		{
			ms->link_close(fd1);
			return 1;
		}
		filelen=ms->link_lseek(fd,0,SEEK_END);//RAM¿Õ¼äÏÂµÄÎÄ¼ş´óĞ¡
		if(filelen<=(RAMTOFLASH_COPYONESIZE))
		{
			//¿ÉÒÔÖ±½Ó¿½±´¹ıÈ¥
			ms->link_lseek(fd,0,SEEK_SET);//RAM¿Õ¼äÏÂµÄÎÄ¼ş´óĞ¡
			i=ms->link_read(fd,(u8 *)p8,filelen);
			if(i==filelen)//¶Á³É¹¦
			{
				i=ms->link_write(fd1,(u8 *)p8,filelen);
				if(i==filelen)
				{
					ms->link_close(fd1);
					return 0;
				}else//Ğ´²Ù×÷Ê§°ÜÓĞ¿ÉÄÜÊÇ´æ´¢¿Õ¼äÒÑ¾­ÂúÁËFlash,ĞèÒªÉ¾³ıFilename
				{
					
