gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
				}
			}
		}else
		{
			y=RAMTOFLASH_COPYONESIZE;
			x=0;
			while(x<filelen)
			{
				ms->link_lseek(fd,x,SEEK_SET);//RAM¿Õ¼äÏÂµÄÎÄ¼ş´óĞ¡
				if(filelen>=(y+x))//×ÜÎÄ¼ş´óĞ¡=×î´óÒ»´ÎĞ´ÈëÁ¿+ÒÑ¾­Ğ´ÈëÁ¿
				{//ÄÇ¾ÍÓÃ×î´óĞ´ÈëÁ¿Ğ´Èë
					i=ms->link_read(fd,(u8 *)p8,y);
					if(y==i)
					{
						i=ms->link_write(fd1,(u8 *)p8,y);
					}else//Ğ´²Ù×÷Ê§°ÜÓĞ¿ÉÄÜÊÇ´æ´¢¿Õ¼äÒÑ¾­ÂúÁËFlash,ĞèÒªÉ¾³ıFilename
					{
						
					}
					x+=y;
				}else
				{
					if(filelen>x)
					{
						y=filelen-x;
						i=ms->link_read(fd,(u8 *)p8,y);
						if(y==i)
						{
							i=ms->link_write(fd1,(u8 *)p8,y);
							if(y==i)
							{
								Delet_RAM_FrzFile();
								ms->link_close(fd1);
								return 0;
							}else
							{
								Delet_RAM_FrzFile();
								ms->link_close(fd1);
								return 1;
							}
						}
					}else//ËµÃ÷ÒÑ¾­È«²¿Ğ´ÍêÁË
					{
						Delet_RAM_FrzFile();
						ms->link_close(fd1);
						return 0;
					}
				}
				
			}
		}
		ms->link_close(fd1);
		return 1;
	
}

u32 Find_TodayFrzFile()
{
	s32 fd;
	u8 *pname;
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();
	pname=GetFrzFileJsonName_Compress();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
	fd=ms->link_open((char *)pname,O_CREAT|O_EXCL);
	if(fd!=-1)
	{
		ms->link_close(fd);
		return 0;
	}
	return 1;
}

/*
void TEST_PACK(void)
{
	u32 i;
	u32 x;
	u32 CJSONLEN;//JSON×Ö·û´®¼ÆÊıÆ÷,³õÊ¼»¯0
	u32 JSONDataLen;
	u8 *p8;
	u8 *p8s;
	u8 *pAddr;//µØÖ·u8ÀàĞÍÖ¸Õë
	u8 *pname;
	u16 *p16;
	u16 AddrNUM;//µµ°¸µÄÓĞĞ§ÊıÁ¿
	s32 fd;
	//u8 addr[6]={0};
	ms_Type *ms;
	ms=(ms_Type *)Get_ms();	
	
	switch(FrzPackTask)
	{
		case 0://´ò°üÖ®Ç°ĞèÒª×öµÄ×¼±¸
			CurMetCount=0;
			FrzPackTask++;
			//´ò°üÖ®Ç°Çå¿ÕRAMÏÂÃæËùÓĞµÄ¿Õ¼ä
			Delet_RAM_FrzFile();
			break;
		case 1:	
			//i=GetOneMetAddr();
			i=GetOneMetAddr_TEST();
			if(i==0)//È«²¿±íµØÖ·ÒÑ¾­´ò°ü½áÊø
			{
				FrzPackTask=2;//ÖØÖÃÃ¿Ìì´ò°üÈÕ¶³½áµÄ±êÖ¾
				myprintf("[%s:%d]:Êı¾İ´¦ÀíÍê±Ï¿ªÊ¼Ñ¹Ëõ\n",(u32)&__func__,(u32)__LINE__,0);
				break;
			}
			CurMetCount++;//ÏÂÒ»´ÎÑ­»·¾ÍÕÒÏÂÒ»Ö»±í
			//µÃµ½ÎÄ¼şÃû×Ö
			Mkdir_JsonFile(JSONFREPATH_RAM);
			pname=CreateFreJsonFile_RAM();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
			fd=ms->link_open((char *)pname,O_RDWR);
			if(fd!=-1)
			{
				i=ms->link_lseek(fd,0,SEEK_END);
				if((i>=8*1024*1024))
				//if(1024)
				{
					//´ÓRAM¿Õ¼äÒÆ¶¯µ½Flash¿Õ¼ä
					i=Copy_RamToFlash(fd);
					if(i!=0)
					{
						ms->link_close(fd);
						return ;
					}
				}
				ms->link_close(fd);
			}
			p8=(u8 *)ms->ms_calloc(1024*1024);
			if(!p8)
			{
				myprintf("[%s:%d]:ÉêÇë¿Õ¼äÊ§°Üi\n",(u32)&__func__,(u32)__LINE__,0);
				return ;
			}
			CJSONLEN=0;
			JSONDataLen=0;
			p8s=(u8 *)ADDR_DATABUFF;
			p16=(u16 *)(ADDR_AddrList);
			p16++;//Ç°ÃæÒ»¸öÊÇ±íµÄÊıÁ¿,ºóÃæÒ»¸öÊÇ±íµÄµØÖ·
			pAddr=(u8 *)p16;
			i=CreateArrayHead_Json(p8+CJSONLEN, DEBUG_FIRST_SPACENUM);
			JSONDataLen+=i;
			CJSONLEN+=i;
			Add_StrToASCII(p8s,pAddr,6);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
			i=Createitem_Json(p8+CJSONLEN, STR_ADDR, p8s, DEBUG_SECOND_SPACENUM);
			JSONDataLen+=i;
			CJSONLEN+=i;
			i=CreateitemArrayHead_Json(p8+CJSONLEN, STR_ITEMLIST, DEBUG_SECOND_SPACENUM);
			JSONDataLen+=i;
			CJSONLEN+=i;
			i=AllDataPack(p16,p8+CJSONLEN);
			CJSONLEN+=i;
			if(i>0)//ËµÃ÷ÊÇÓĞÊı¾İµÄ
			{
				i=CreateitemArrayEnd_Json(p8, CJSONLEN,DEBUG_SECOND_SPACENUM);
				CJSONLEN+=i;
				i=CreateArrayEnd_Json(p8, CJSONLEN, DEBUG_FIRST_SPACENUM);
				CJSONLEN+=i;
				CJSONLEN=Delet_COMMA(p8,CJSONLEN);//É¾³ı¶ººÅ
				i=Str_LF(p8+CJSONLEN);
				CJSONLEN+=i;			
			}else
			{		
				if(CJSONLEN>=JSONDataLen)
				{
					CJSONLEN-=JSONDataLen;
				}
			}
			
			if(CJSONLEN>0)//ÕâÒ»Ö»±íÊ¾ÓĞÊı¾İµÄ
			{
				//ÏÂÃæ¿ªÊ¼ÍùRAM¿Õ¼äÀïÃæĞ´Êı¾İ
				i=CalCulate_Space(JSONFREPATH_RAM);//¼ÆËãÕâ¸ö¿Õ¼äÀïÃæÊ£ÓàµÄÈİÁ¿
				if(i>=CJSONLEN)//Èç¹ûÊ£ÓàµÄ¿Õ¼ä¹»ÓÃ
				{
					//µÃµ½ÎÄ¼şÃû×Ö
					Mkdir_JsonFile(JSONFREPATH_RAM);
					pname=CreateFreJsonFile_RAM();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
					fd=ms->link_open((char *)pname,O_RDWR);
					if(fd!=-1)
					{
						ms->link_lseek(fd,0,SEEK_END);
						i=ms->link_write(fd,p8,CJSONLEN);
						if(i==CJSONLEN)
						{
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
						}else
						{
							i=ms->link_write(fd,p8,CJSONLEN);
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
						}
					}else
					{
						fd=ms->link_open((char *)pname,O_CREAT|O_RDWR);
						if(-1==fd)
						{
							myprintf("[%s:%d]:´´½¨ÎÄ¼şÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
							ms->ms_free(p8);
							return;
						}
						ms->link_lseek(fd,0,SEEK_SET);
						i=ms->link_write(fd,p8,CJSONLEN);
						if(i==CJSONLEN)
						{
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
						}else
						{
							i=ms->link_write(fd,p8,CJSONLEN);
							myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
						}
					}
				}else
				{
					
				}
				ms->link_close(fd);//¹Ø±ÕÎÄ¼ş¾ä±ú
			}
			ms->ms_free(p8);
			break;
		case 2:
			//µÃµ½ÎÄ¼şÃû×Ö
			Mkdir_JsonFile(JSONFREPATH_RAM);
			pname=CreateFreJsonFile_RAM();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
			fd=ms->link_open((char *)pname,O_RDWR);
			if(fd!=-1)
			{
				i=ms->link_lseek(fd,0,SEEK_SET);
				//´ÓRAM¿Õ¼äÒÆ¶¯µ½Flash¿Õ¼ä
				i=Copy_RamToFlash(fd);
				if(i!=0)
				{
					ms->link_close(fd);
					return ;
				}
				ms->link_close(fd);
			}
			Mkdir_JsonFile(JSONFREPATH);
			pname=CreateFreJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
			fd=ms->link_open((char *)pname,O_RDWR);
			if(fd!=-1)
			{
				ms->link_close(fd);
				Compress_JSONFile(pname,1024,0);//½«JSONÎÄ¼ş´ò°ü³Étar.gz¸ñÊ½
				JSON->IsCreateFrzJson=1;
				JSON->PackFrzJsonTask=1;
			}else
			{
				FrzPackTask=0;	
				//ËµÃ÷´ò°üÊ§°ÜÁË
				if(JSON->IsCreateFrzJson==2)
				{
					JSON->IsCreateFrzJson=1;
					JSON->PackFrzJsonTask=1;
				}
				else
				{
					JSON->IsCreateFrzJson++;
				}
			}	
			break;
		default:
			FrzPackTask=0;
		break;
	}

//===============================1.È¡µµ°¸ÀïÃæËùÓĞµÄ±íµØÖ·=========================== 
	//GetMetAddr();//È¡µÃËùÓĞ±íµÄµØÖ·	
	p16=(u16*)(ADDR_AddrList);//È¡µÃµµ°¸µÄÊıÁ¿ÓÃunsigned short±íÊ¾
	p16[0]=2;
	p16++;	
	for(x=0;x<2;x++)
	{	
		i=hex_bcd(x+1);
		p16[0]=(i&0xff)|(i>>8)&0xff;
		p16[1]=(i>>16)&0xff|(i>>24)&0xff;
		p16[2]=0;

		p8=(u8 *)p16;
		for(i=0;i<3;i++)
			myprintf("%04x ",p16[i],0,0);
		myprintf("\n",0,0,0);
		p16+=3;
	}
	AddrNUM=2;
	//p16++;		
//===============================2.Ïò¶ÑÉêÇë¿Õ¼ä=====================================
	p8=(u8 *)ms->ms_calloc(1024);
	if(!p8)
	{
		myprintf("[%s:%d]:malloc¿Õ¼ä²»×ã\n",(u32)&__func__,(u32)__LINE__,0);
		return ;
	}
//==============================3.¿ªÊ¼´¦ÀíÊı¾İ========================================
	CJSONLEN=0;//JSON×Ö·û´®¼ÆÊıÆ÷,³õÊ¼»¯0
	p8s=(u8 *)ADDR_DATABUFF;

