gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
	p16=(u16*)(ADDR_AddrList);//È¡µÃµµ°¸µÄÊıÁ¿ÓÃunsigned short±íÊ¾
	p16++;
	for(x=0;x<AddrNUM;x++)
	{
		if(0!=x)
		{
			p16+=3;
		}
		pAddr=(u8 *)p16;
		JSONDataLen=0;
		i=CreateArrayHead_Json(p8+CJSONLEN, DEBUG_FIRST_SPACENUM);
		JSONDataLen+=i;
		CJSONLEN+=i;
		Add_StrToASCII(p8s,pAddr,6);//pbufÀïÃæµÄ×Ö½ÚÊä³öµ½pstr²¢×ª³ÉascÂë
		i=Createitem_Json(p8+CJSONLEN, STR_ADDR, p8s, DEBUG_SECOND_SPACENUM);
		JSONDataLen+=i;
		CJSONLEN+=i;
		i=CreateitemArrayHead_Json(p8+CJSONLEN, STR_ITEMLIST, DEBUG_SECOND_SPACENUM);
		JSONDataLen+=i;
		CJSONLEN+=i;
		i=AllDataPack(p16,p8+CJSONLEN);
		CJSONLEN+=i;
		
		if(i>0)//ËµÃ÷ÊÇÓĞÊı¾İµÄ
		{
			i=CreateitemArrayEnd_Json(p8, CJSONLEN,DEBUG_SECOND_SPACENUM);
			CJSONLEN+=i;
			i=CreateArrayEnd_Json(p8, CJSONLEN, DEBUG_FIRST_SPACENUM);
			CJSONLEN+=i;
			CJSONLEN=Delet_COMMA(p8,CJSONLEN);//É¾³ı¶ººÅ
			i=Str_LF(p8+CJSONLEN);
			CJSONLEN+=i;			
		}else
		{		
			if(CJSONLEN>=JSONDataLen)
			{
				CJSONLEN-=JSONDataLen;
			}
		}	
	}
	if(CJSONLEN)
	{
		Delet_FrzJsonFile();//É¾³ıµôÔ­À´µÄJSONÎÄ¼ş
		pname=CreateFreJsonFile();//´´½¨Ò»¸öĞÂµÄÏîÄ¿ÎÄ¼ş,·µ»ØÎÄ¼ş¾ä±ú
		fd=ms->link_open((char *)pname,O_RDWR);
		if(-1!=fd)//ÒÑ¾­´æÔÚ¸ÃÎÄ¼ş¾ÍÉ¾³ı
		{
			//ms->link_remove((char *)pname);
			//myprintf("\n\n[%s:%d]:É¾³ıÎÄ¼ş:%s \n\n", (u32)&__func__, __LINE__, (u32 )pname);
			i=ms->link_write(fd,p8,CJSONLEN);
			if(i==CJSONLEN)
			{
				myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
				Compress_JSONFile(pname,1024,0);//½«JSONÎÄ¼ş´ò°ü³Étar.gz¸ñÊ½
			}else
			{
				myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
			}
		}else
		{
			fd=ms->link_open((char *)pname,O_CREAT|O_RDWR);
			if(-1==fd)
			{
				myprintf("[%s:%d]:´´½¨ÎÄ¼şÊ§°Ü\n",(u32)&__func__,(u32)__LINE__,0);
				return;
			}
			i=ms->link_write(fd,p8,CJSONLEN);
			if(i==CJSONLEN)
			{
				myprintf("[%s:%d]:Ğ´ÈëÎÄ¼ş³É¹¦  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
				Compress_JSONFile(pname,1024,0);//½«JSONÎÄ¼ş´ò°ü³Étar.gz¸ñÊ½
			}else
			{
				myprintf("[%s:%d]:Ğ´ÈëÎÄ¼şÊ§°Ü  ×Ö·ûÊıÁ¿i=%d\n",(u32)&__func__,(u32)__LINE__,i);
			}
		}
		ms->link_close(fd);
	}
	ms->ms_free(p8);
	*/
	/*
u8 day[]={0x01,0x01,0x5b,0x01,0x50,0x04,0x02,0x00,0x03,0x20,0x21,0x02,0x00,0x00,0x10,0x02,0x00,0x00,0x20,0x02,0x00,0x1C,0x07,0xE4,0x07,0x0A,0x00,0x00,0x00,0x01,0x05,0x06,0x00,0x1C,0x34,0x6B,0x06,0x00,0x00,0x00,0x00,0x06,0x00,0x0F,0x52,0x9D,0x06,0x00,0x00,0x00,0x00,0x06,0x00,0x0C,0xE1,0xCD,0x01,0x05,0x06,0x00,0x00,0x00,0x08,0x06,0x00,0x00,0x00,0x00,0x06,0x00,0x00,0x00,0x08,0x06,0x00,0x00,0x00,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};
//u8 min15[]={0x50,0x02,0x02,0x00,0x03,0x20,0x21,0x02,0x00,0x00,0x10,0x02,0x01,0x00,0x20,0x02,0x01,0x01,0x1C,0x06,0x06,0x0A,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x1C,0x34,0x6B,0x00,0x00,0x00,0x08,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x20,0x2D,0x84,0x00,0x00,0x00,0x08,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x21,0xC8,0x48,0x00,0x00,0x00,0x0C,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x20,0x5D,0xF2,0x00,0x00,0x00,0x09,0x07,0xE4,0x07,
	//0x09,0x16,0x00,0x00,0x00,0x1F,0x78,0xC6,0x00,0x00,0x00,0x34,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x26,0xC3,0xD3,0x00,0x00,0x00,0x09,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x1E,0xFB,0xD1,0x00,0x00,0x00,0x08,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x1F,0x91,0xAF,0x00,0x00,0x00,0x09,0x07,0xE4,0x07,0x09,0x16,0x00,0x00,0x00,0x1D,0x34,0xD5,0x00,0x00,0x00,0x08,
	//0x00,0x00
//};

u8 min[]={0x01,0x01,0x5b,0x01,0x50,0x02,0x02,0x00,0x0B,0x20,0x00,0x02,0x01,0x20,0x00,0x02,0x02,0x20,0x00,0x02,0x03,0x20,0x01,0x02,0x01,0x20,0x01,0x02,0x02,0x20,0x01,0x02,0x03,0x20,0x01,0x04,0x00,0x20,0x04,0x02,0x01,0x20,0x04,0x02,0x02,0x20,0x04,0x02,0x03,0x20,0x04,0x02,0x04,0x01,0x12,0x12,0x12,0x05,0x05,0x05,0x05,0x05,0x05,0x05,0x05,0x06,0x08,0xF8,0x08,0xED,0x08,0xF1,0x00,0x00,0x08,0xEB,0x00,0x00,0x0B,0xAD,0x00,0x00,0x0C,0xC7,0x00,0x00,0x03,0x58,0x00,0x00,
	0x4C,0x5C,0x00,0x00,0x14,0x79,0x00,0x00,0x1A,0xA7,0x00,0x00,0x1D,0x3A,0x08,0xFB,0x08,0xF0,0x08,0xF5,0x00,0x00,0x08,0xF4,0x00,0x00,0x0B,0xAF,0x00,0x00,0x0C,0xCA,0x00,0x00,0x03,0x52,0x00,0x00,0x4C,0x9B,0x00,0x00,0x14,0x96,0x00,0x00,0x1A,0xB5,0x00,0x00,0x1D,0x4E,0x08,0xFA,0x08,0xF0,0x08,0xF4,0x00,0x00,0x08,0xE7,0x00,0x00,0x0B,0xAD,0x00,0x00,0x0C,0xC6,0x00,0x00,0x00,0x00,0x00,0x00,0x4C,0x50,0x00,0x00,0x14,0x70,0x00,0x00,0x1A,0xA8,0x00,
	0x00,0x1D,0x38,0x08,0xFC,0x08,0xF1,0x08,0xF6,0x00,0x00,0x08,0xF0,0x00,0x00,0x0B,0xAD,0x00,0x00,0x0C,0xC8,0x00,0x00,0x00,0x00,0x00,0x00,0x4C,0xA0,0x00,0x00,0x14,0x94,0x00,0x00,0x1A,0xBC,0x00,0x00,0x1D,0x4C,0x08,0xF9,0x08,0xF0,0x08,0xF3,0x00,0x00,0x08,0xE7,0x00,0x00,0x0B,0xAB,0x00,0x00,0x0C,0xC5,0x00,0x00,0x00,0x00,0x00,0x00,0x4C,0x70,0x00,0x00,0x14,0x84,0x00,0x00,0x1A,0xA8,0x00,0x00,0x1D,0x4C,0x08,0xF9,0x08,0xEF,0x08,0xF3,0x00,0x00,
	0x08,0xED,0x00,0x00,0x0B,0xAA,0x00,0x00,0x0C,0xC5,0x00,0x00,0x00,0x00,0x00,0x00,0x4C,0x90,0x00,0x00,0x14,0x84,0x00,0x00,0x1A,0xBC,0x00,0x00,0x1D,0x4C,0x00,0x00
};

//u8 min[]={0x01,0x01,0x5b,0x01,0x50,0x02,0x02,0x00,0x05,0x20,0x00,0x02,0x01,0x20,0x01,0x02,0x01,0x20,0x01,0x04,0x00,0x20,0x04,0x02,0x01,0x20,0x04,0x02,0x02,0x01,0x12,0x07,0x05,0x05,0x05,0x0A,0x00,0x00,0x00};

u8 min15[]={0x01,0x01,0x5b,0x01,0x50,0x02,0x02,0x00,0x06,0x00,0x10,0x02,0x01,0x00,0x20,0x02,0x01,0x00,0x50,0x02,0x01,0x00,0x60,0x02,0x01,0x00,0x70,0x02,0x01,0x00,0x80,0x02,0x01,0x01,0x06,0x06,0x06,0x06,0x06,0x06,0x0C,0x00,0x07,0x72,0x7B,0x00,0x00,0x00,0x00,0x00,0x00,0x4F,0xB0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x07,0x72,0xA8,0x00,0x00,0x00,0x00,0x00,0x00,0x4F,0xB2,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
	0x07,0x72,0xD5,0x00,0x00,0x00,0x00,0x00,0x00,0x4F,0xB3,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x07,0x73,0x02,0x00,0x00,0x00,0x00,0x00,0x00,0x4F,0xB4,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x08,0x32,0xC9,0x00,0x00,0x00,0x00,0x00,0x00,0x69,0xAC,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x2F,0x00,0x08,0x32,0xF6,0x00,0x00,0x00,0x00,0x00,0x00,0x69,0xAD,0x00,0x00,0x00,0x00,0x00,
	0x00,0x00,0x00,0x00,0x00,0x00,0x2F,0x00,0x08,0x33,0x23,0x00,0x00,0x00,0x00,0x00,0x00,0x69,0xAF,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x2F,0x00,0x08,0x33,0x50,0x00,0x00,0x00,0x00,0x00,0x00,0x69,0xB0,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x2F,0x00,0x07,0x71,0xF7,0x00,0x00,0x00,0x00,0x00,0x00,0x51,0xA6,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x07,0x72,0x24,0x00,0x00,0x00,0x00,0x00,
	0x00,0x51,0xA7,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x07,0x72,0x51,0x00,0x00,0x00,0x00,0x00,0x00,0x51,0xA9,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x07,0x72,0x7E,0x00,0x00,0x00,0x00,0x00,0x00,0x51,0xAA,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};

VOID test_saveMIN(void)
{
	u32 i;
	u16 datalen;
	u32 FILEID;
	u32 addrcnt;
	u32 Offset;
	//u32 z;
	//UARTCtrl_TypeDef *UARTCtrl;
	u32 hex;
	u8 *p8;
	//UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
	u8 addr[6]={0};
	u8 time[]={0x07,0xE4,0x07,0x1A,0x00,0x00,0x00};
		p8=(u8 *)ADDR_DATABUFF;
	myprintf("·ÖÖÓ´æ´¢ \n",0,0,0);

	for(FILEID=0;FILEID<TEST_TIME;FILEID++)
	{
		for(addrcnt=0;addrcnt<TEST_METNUM;addrcnt++)
		{
			Offset=0;
			i=addrcnt+1;
			//hex=bcd_hex(i);
			hex=i;
			//myprintf("hex=%d \n",hex,0,0);
			addr[0]=(hex)&0xff;
			addr[1]=(hex>>8)&0xff;
			addr[2]=(hex>>16)&0xff;
			addr[3]=(hex>>24)&0xff;
			addr[4]=0;
			addr[5]=0;
			MR((u32)p8+Offset,(u32)addr,sizeof(addr));
			Offset+=sizeof(addr);
			
			datalen=sizeof(min);
			p8[Offset++]=(datalen+21)&0xff;
			p8[Offset++]=((datalen+21)>>8)&0xff;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
						
