gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_JSON.c
			MR((u32)p8+Offset,(u32)min,sizeof(min));
			Offset+=sizeof(min);			
			//for(z=0;z<Offset;z++)
				//myprintf("%02x ",p8[z],0,0);
			//myprintf("\n",0,0,0);
			save(p8,0x13f22000);
			//break;
		}
		pYYMDHMS_AddS_hex(time, 60);
		//break;
	}
	myprintf("È«²¿¶¼Ğ´Íê³É \n",0,0,0);
}

VOID test_saveMIN15(void)
{
	u32 i;
	u16 datalen;
	u32 FILEID;
	u32 addrcnt;
	u32 Offset;
	//u32 z;
	//UARTCtrl_TypeDef *UARTCtrl;
	u32 hex;
	u8 *p8;
	//UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
	u8 addr[6]={0};
	u8 time[]={0x07,0xE4,0x07,0x1A,0x00,0x00,0x00};
	p8=(u8 *)ADDR_DATABUFF;
	myprintf("·ÖÖÓ´æ´¢ \n",0,0,0);

	for(FILEID=0;FILEID<96;FILEID++)
	{
		for(addrcnt=0;addrcnt<TEST_METNUM;addrcnt++)
		{
			Offset=0;
			i=addrcnt+1;
			//hex=bcd_hex(i);
			hex=i;
			//myprintf("hex=%d \n",hex,0,0);
			addr[0]=(hex)&0xff;
			addr[1]=(hex>>8)&0xff;
			addr[2]=(hex>>16)&0xff;
			addr[3]=(hex>>24)&0xff;
			addr[4]=0;
			addr[5]=0;
			MR((u32)p8+Offset,(u32)addr,sizeof(addr));
			Offset+=sizeof(addr);
			
			datalen=sizeof(min15);
			p8[Offset++]=(datalen+21)&0xff;
			p8[Offset++]=((datalen+21)>>8)&0xff;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
						
			MR((u32)p8+Offset,(u32)min15,sizeof(min15));
			Offset+=sizeof(min15);			
			//for(z=0;z<Offset;z++)
				//myprintf("%02x ",p8[z],0,0);
			//myprintf("\n",0,0,0);
			save(p8,0x13f19000);
			//break;
		}
		pYYMDHMS_AddS_hex(time, 900);
		//break;
	}
	myprintf("È«²¿¶¼Ğ´Íê³É \n",0,0,0);
}

VOID test_saveDAY(void)
{
	u32 i;
	u16 datalen;
	//u32 FILEID;
	u32 addrcnt;
	u32 Offset;
	//u32 z;
	//UARTCtrl_TypeDef *UARTCtrl;
	u32 hex;
	u8 *p8;
	//UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(RS485_4PORT);
	u8 addr[6]={0};
	u8 time[]={0x07,0xE4,0x07,0x1a,0x17,0x3b,0x00};
	p8=(u8 *)ADDR_DATABUFF;
	myprintf("½øÈëÌì´æ´¢ \n",0,0,0);
	//for(FILEID=0;FILEID<TEST_TIME;FILEID++)
	{
		for(addrcnt=0;addrcnt<TEST_METNUM;addrcnt++)
		{
			Offset=0;
			i=addrcnt+1;
			//hex=bcd_hex(i);
			hex=i;
			//myprintf("hex=%d \n",hex,0,0);
			addr[0]=(hex)&0xff;
			addr[1]=(hex>>8)&0xff;
			addr[2]=(hex>>16)&0xff;
			addr[3]=(hex>>24)&0xff;
			addr[4]=0;
			addr[5]=0;
			MR((u32)p8+Offset,(u32)addr,sizeof(addr));
			Offset+=sizeof(addr);
			
			datalen=sizeof(day);
			p8[Offset++]=(datalen+21)&0xff;
			p8[Offset++]=((datalen+21)>>8)&0xff;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
			MR((u32)p8+Offset,(u32)time,sizeof(time));
			Offset+=7;
						
			MR((u32)p8+Offset,(u32)day,sizeof(day));
			Offset+=sizeof(day);			
			//for(z=0;z<Offset;z++)
				//myprintf("%02x ",p8[z],0,0);
			//myprintf("\n",0,0,0);
			save(p8,0x13f16000);
			//break;
		}
		//pYYMDHMS_AddS_hex(time, 60);
		//break;
	}
	myprintf("È«²¿¶¼Ğ´Íê³É \n",0,0,0);
}
*/

